package config

const AreaDict = `
[
    {
        "id": 37,
        "code": "110000",
        "name": "北京",
        "children": [
            {
                "id": 796,
                "code": "110100",
                "name": "北京",
                "children": [
                    {
                        "id": 10954,
                        "code": "110101",
                        "name": "东城区"
                    },
                    {
                        "id": 10965,
                        "code": "110102",
                        "name": "西城区"
                    },
                    {
                        "id": 10952,
                        "code": "110105",
                        "name": "朝阳区"
                    },
                    {
                        "id": 10956,
                        "code": "110106",
                        "name": "丰台区"
                    },
                    {
                        "id": 10962,
                        "code": "110107",
                        "name": "石景山区"
                    },
                    {
                        "id": 10957,
                        "code": "110108",
                        "name": "海淀区"
                    },
                    {
                        "id": 10959,
                        "code": "110109",
                        "name": "门头沟区"
                    },
                    {
                        "id": 10955,
                        "code": "110111",
                        "name": "房山区"
                    },
                    {
                        "id": 10964,
                        "code": "110112",
                        "name": "通州区"
                    },
                    {
                        "id": 10963,
                        "code": "110113",
                        "name": "顺义区"
                    },
                    {
                        "id": 10951,
                        "code": "110114",
                        "name": "昌平区"
                    },
                    {
                        "id": 10953,
                        "code": "110115",
                        "name": "大兴区"
                    },
                    {
                        "id": 10958,
                        "code": "110116",
                        "name": "怀柔区"
                    },
                    {
                        "id": 10961,
                        "code": "110117",
                        "name": "平谷区"
                    },
                    {
                        "id": 10960,
                        "code": "110118",
                        "name": "密云县"
                    },
                    {
                        "id": 10966,
                        "code": "110119",
                        "name": "延庆县"
                    }
                ]
            }
        ]
    },
    {
        "id": 63,
        "code": "120000",
        "name": "天津",
        "children": [
            {
                "id": 1108,
                "code": "120100",
                "name": "天津",
                "children": [
                    {
                        "id": 13879,
                        "code": "120101",
                        "name": "和平区"
                    },
                    {
                        "id": 13880,
                        "code": "120102",
                        "name": "河东区"
                    },
                    {
                        "id": 13416,
                        "code": "120103",
                        "name": "河西区"
                    },
                    {
                        "id": 13421,
                        "code": "120104",
                        "name": "南开区"
                    },
                    {
                        "id": 13415,
                        "code": "120105",
                        "name": "河北区"
                    },
                    {
                        "id": 13417,
                        "code": "120106",
                        "name": "红桥区"
                    },
                    {
                        "id": 13414,
                        "code": "120110",
                        "name": "东丽区"
                    },
                    {
                        "id": 13424,
                        "code": "120111",
                        "name": "西青区"
                    },
                    {
                        "id": 13419,
                        "code": "120112",
                        "name": "津南区"
                    },
                    {
                        "id": 13412,
                        "code": "120113",
                        "name": "北辰区"
                    },
                    {
                        "id": 13423,
                        "code": "120114",
                        "name": "武清区"
                    },
                    {
                        "id": 13411,
                        "code": "120115",
                        "name": "宝坻区"
                    },
                    {
                        "id": 13413,
                        "code": "120116",
                        "name": "滨海新区"
                    },
                    {
                        "id": 13422,
                        "code": "120117",
                        "name": "宁河区"
                    },
                    {
                        "id": 13420,
                        "code": "120118",
                        "name": "静海县"
                    },
                    {
                        "id": 13418,
                        "code": "120119",
                        "name": "蓟州区"
                    }
                ]
            }
        ]
    },
    {
        "id": 45,
        "code": "130000",
        "name": "河北",
        "children": [
            {
                "id": 891,
                "code": "130100",
                "name": "石家庄",
                "children": [
                    {
                        "id": 11638,
                        "code": "130102",
                        "name": "长安区"
                    },
                    {
                        "id": 11630,
                        "code": "130104",
                        "name": "桥西区"
                    },
                    {
                        "id": 13836,
                        "code": "130105",
                        "name": "新华区"
                    },
                    {
                        "id": 11624,
                        "code": "130107",
                        "name": "井陉矿区"
                    },
                    {
                        "id": 11635,
                        "code": "130108",
                        "name": "裕华区"
                    },
                    {
                        "id": 11621,
                        "code": "130109",
                        "name": "藁城市"
                    },
                    {
                        "id": 11627,
                        "code": "130110",
                        "name": "鹿泉市"
                    },
                    {
                        "id": 11628,
                        "code": "130111",
                        "name": "栾城县"
                    },
                    {
                        "id": 11625,
                        "code": "130121",
                        "name": "井陉县"
                    },
                    {
                        "id": 11640,
                        "code": "130123",
                        "name": "正定县"
                    },
                    {
                        "id": 11622,
                        "code": "130125",
                        "name": "行唐县"
                    },
                    {
                        "id": 11626,
                        "code": "130126",
                        "name": "灵寿县"
                    },
                    {
                        "id": 11620,
                        "code": "130127",
                        "name": "高邑县"
                    },
                    {
                        "id": 11631,
                        "code": "130128",
                        "name": "深泽县"
                    },
                    {
                        "id": 11637,
                        "code": "130129",
                        "name": "赞皇县"
                    },
                    {
                        "id": 11632,
                        "code": "130130",
                        "name": "无极县"
                    },
                    {
                        "id": 11629,
                        "code": "130131",
                        "name": "平山县"
                    },
                    {
                        "id": 11636,
                        "code": "130132",
                        "name": "元氏县"
                    },
                    {
                        "id": 11639,
                        "code": "130133",
                        "name": "赵县"
                    },
                    {
                        "id": 11633,
                        "code": "130181",
                        "name": "辛集市"
                    },
                    {
                        "id": 11623,
                        "code": "130183",
                        "name": "晋州市"
                    },
                    {
                        "id": 11634,
                        "code": "130184",
                        "name": "新乐市"
                    }
                ]
            },
            {
                "id": 892,
                "code": "130200",
                "name": "唐山",
                "children": [
                    {
                        "id": 11648,
                        "code": "130202",
                        "name": "路南区"
                    },
                    {
                        "id": 11647,
                        "code": "130203",
                        "name": "路北区"
                    },
                    {
                        "id": 11644,
                        "code": "130204",
                        "name": "古冶区"
                    },
                    {
                        "id": 11645,
                        "code": "130205",
                        "name": "开平区"
                    },
                    {
                        "id": 11642,
                        "code": "130207",
                        "name": "丰南区"
                    },
                    {
                        "id": 11643,
                        "code": "130208",
                        "name": "丰润区"
                    },
                    {
                        "id": 11641,
                        "code": "130209",
                        "name": "曹妃甸区"
                    },
                    {
                        "id": 11649,
                        "code": "130224",
                        "name": "滦南县"
                    },
                    {
                        "id": 11646,
                        "code": "130225",
                        "name": "乐亭县"
                    },
                    {
                        "id": 11652,
                        "code": "130227",
                        "name": "迁西县"
                    },
                    {
                        "id": 11653,
                        "code": "130229",
                        "name": "玉田县"
                    },
                    {
                        "id": 11654,
                        "code": "130281",
                        "name": "遵化市"
                    },
                    {
                        "id": 11651,
                        "code": "130283",
                        "name": "迁安市"
                    },
                    {
                        "id": 11650,
                        "code": "130284",
                        "name": "滦州市"
                    }
                ]
            },
            {
                "id": 890,
                "code": "130300",
                "name": "秦皇岛",
                "children": [
                    {
                        "id": 11616,
                        "code": "130302",
                        "name": "海港区"
                    },
                    {
                        "id": 11619,
                        "code": "130303",
                        "name": "山海关区"
                    },
                    {
                        "id": 11613,
                        "code": "130304",
                        "name": "北戴河区"
                    },
                    {
                        "id": 11615,
                        "code": "130306",
                        "name": "抚宁县"
                    },
                    {
                        "id": 11618,
                        "code": "130321",
                        "name": "青龙满族自治县"
                    },
                    {
                        "id": 11614,
                        "code": "130322",
                        "name": "昌黎县"
                    },
                    {
                        "id": 11617,
                        "code": "130324",
                        "name": "卢龙县"
                    }
                ]
            },
            {
                "id": 887,
                "code": "130400",
                "name": "邯郸",
                "children": [
                    {
                        "id": 11583,
                        "code": "130402",
                        "name": "邯山区"
                    },
                    {
                        "id": 11576,
                        "code": "130403",
                        "name": "丛台区"
                    },
                    {
                        "id": 11580,
                        "code": "130404",
                        "name": "复兴区"
                    },
                    {
                        "id": 11579,
                        "code": "130406",
                        "name": "峰峰矿区"
                    },
                    {
                        "id": 11578,
                        "code": "130407",
                        "name": "肥乡县"
                    },
                    {
                        "id": 11591,
                        "code": "130408",
                        "name": "永年县"
                    },
                    {
                        "id": 11585,
                        "code": "130423",
                        "name": "临漳县"
                    },
                    {
                        "id": 11574,
                        "code": "130424",
                        "name": "成安县"
                    },
                    {
                        "id": 11577,
                        "code": "130425",
                        "name": "大名县"
                    },
                    {
                        "id": 11588,
                        "code": "130426",
                        "name": "涉县"
                    },
                    {
                        "id": 11575,
                        "code": "130427",
                        "name": "磁县"
                    },
                    {
                        "id": 11586,
                        "code": "130430",
                        "name": "邱县"
                    },
                    {
                        "id": 11584,
                        "code": "130431",
                        "name": "鸡泽县"
                    },
                    {
                        "id": 11582,
                        "code": "130432",
                        "name": "广平县"
                    },
                    {
                        "id": 11581,
                        "code": "130433",
                        "name": "馆陶县"
                    },
                    {
                        "id": 11589,
                        "code": "130434",
                        "name": "魏县"
                    },
                    {
                        "id": 11587,
                        "code": "130435",
                        "name": "曲周县"
                    },
                    {
                        "id": 11590,
                        "code": "130481",
                        "name": "武安市"
                    }
                ]
            },
            {
                "id": 893,
                "code": "130500",
                "name": "邢台",
                "children": [
                    {
                        "id": 11670,
                        "code": "130502",
                        "name": "襄都区"
                    },
                    {
                        "id": 11672,
                        "code": "130503",
                        "name": "信都区"
                    },
                    {
                        "id": 11667,
                        "code": "130505",
                        "name": "任泽区"
                    },
                    {
                        "id": 11662,
                        "code": "130506",
                        "name": "南和县"
                    },
                    {
                        "id": 11658,
                        "code": "130522",
                        "name": "临城县"
                    },
                    {
                        "id": 11663,
                        "code": "130523",
                        "name": "内丘县"
                    },
                    {
                        "id": 11655,
                        "code": "130524",
                        "name": "柏乡县"
                    },
                    {
                        "id": 11660,
                        "code": "130525",
                        "name": "隆尧县"
                    },
                    {
                        "id": 11664,
                        "code": "130528",
                        "name": "宁晋县"
                    },
                    {
                        "id": 11657,
                        "code": "130529",
                        "name": "巨鹿县"
                    },
                    {
                        "id": 11671,
                        "code": "130530",
                        "name": "新河县"
                    },
                    {
                        "id": 11656,
                        "code": "130531",
                        "name": "广宗县"
                    },
                    {
                        "id": 11665,
                        "code": "130532",
                        "name": "平乡县"
                    },
                    {
                        "id": 11669,
                        "code": "130533",
                        "name": "威县"
                    },
                    {
                        "id": 11666,
                        "code": "130534",
                        "name": "清河县"
                    },
                    {
                        "id": 11659,
                        "code": "130535",
                        "name": "临西县"
                    },
                    {
                        "id": 11661,
                        "code": "130581",
                        "name": "南宫市"
                    },
                    {
                        "id": 11668,
                        "code": "130582",
                        "name": "沙河市"
                    }
                ]
            },
            {
                "id": 884,
                "code": "130600",
                "name": "保定",
                "children": [
                    {
                        "id": 11531,
                        "code": "130602",
                        "name": "竞秀区"
                    },
                    {
                        "id": 11535,
                        "code": "130606",
                        "name": "莲池区"
                    },
                    {
                        "id": 11536,
                        "code": "130607",
                        "name": "满城县"
                    },
                    {
                        "id": 11537,
                        "code": "130608",
                        "name": "清苑县"
                    },
                    {
                        "id": 11544,
                        "code": "130609",
                        "name": "徐水县"
                    },
                    {
                        "id": 11532,
                        "code": "130623",
                        "name": "涞水县"
                    },
                    {
                        "id": 11528,
                        "code": "130624",
                        "name": "阜平县"
                    },
                    {
                        "id": 11526,
                        "code": "130626",
                        "name": "定兴县"
                    },
                    {
                        "id": 11541,
                        "code": "130627",
                        "name": "唐县"
                    },
                    {
                        "id": 11530,
                        "code": "130628",
                        "name": "高阳县"
                    },
                    {
                        "id": 11539,
                        "code": "130629",
                        "name": "容城县"
                    },
                    {
                        "id": 11533,
                        "code": "130630",
                        "name": "涞源县"
                    },
                    {
                        "id": 11542,
                        "code": "130631",
                        "name": "望都县"
                    },
                    {
                        "id": 11524,
                        "code": "130632",
                        "name": "安新县"
                    },
                    {
                        "id": 11545,
                        "code": "130633",
                        "name": "易县"
                    },
                    {
                        "id": 11538,
                        "code": "130634",
                        "name": "曲阳县"
                    },
                    {
                        "id": 11534,
                        "code": "130635",
                        "name": "蠡县"
                    },
                    {
                        "id": 11540,
                        "code": "130636",
                        "name": "顺平县"
                    },
                    {
                        "id": 11525,
                        "code": "130637",
                        "name": "博野县"
                    },
                    {
                        "id": 11543,
                        "code": "130638",
                        "name": "雄县"
                    },
                    {
                        "id": 11546,
                        "code": "130681",
                        "name": "涿州市"
                    },
                    {
                        "id": 11527,
                        "code": "130682",
                        "name": "定州市"
                    },
                    {
                        "id": 11523,
                        "code": "130683",
                        "name": "安国市"
                    },
                    {
                        "id": 11529,
                        "code": "130684",
                        "name": "高碑店市"
                    }
                ]
            },
            {
                "id": 894,
                "code": "130700",
                "name": "张家口",
                "children": [
                    {
                        "id": 11679,
                        "code": "130702",
                        "name": "桥东区"
                    },
                    {
                        "id": 13837,
                        "code": "130703",
                        "name": "桥西区"
                    },
                    {
                        "id": 11684,
                        "code": "130705",
                        "name": "宣化区"
                    },
                    {
                        "id": 11683,
                        "code": "130706",
                        "name": "下花园区"
                    },
                    {
                        "id": 11681,
                        "code": "130708",
                        "name": "万全县"
                    },
                    {
                        "id": 11674,
                        "code": "130709",
                        "name": "崇礼县"
                    },
                    {
                        "id": 11686,
                        "code": "130722",
                        "name": "张北县"
                    },
                    {
                        "id": 11678,
                        "code": "130723",
                        "name": "康保县"
                    },
                    {
                        "id": 11675,
                        "code": "130724",
                        "name": "沽源县"
                    },
                    {
                        "id": 11680,
                        "code": "130725",
                        "name": "尚义县"
                    },
                    {
                        "id": 11682,
                        "code": "130726",
                        "name": "蔚县"
                    },
                    {
                        "id": 11685,
                        "code": "130727",
                        "name": "阳原县"
                    },
                    {
                        "id": 11676,
                        "code": "130728",
                        "name": "怀安县"
                    },
                    {
                        "id": 11677,
                        "code": "130730",
                        "name": "怀来县"
                    },
                    {
                        "id": 11687,
                        "code": "130731",
                        "name": "涿鹿县"
                    },
                    {
                        "id": 11673,
                        "code": "130732",
                        "name": "赤城县"
                    }
                ]
            },
            {
                "id": 886,
                "code": "130800",
                "name": "承德",
                "children": [
                    {
                        "id": 11570,
                        "code": "130802",
                        "name": "双桥区"
                    },
                    {
                        "id": 11569,
                        "code": "130803",
                        "name": "双滦区"
                    },
                    {
                        "id": 11573,
                        "code": "130804",
                        "name": "鹰手营子矿区"
                    },
                    {
                        "id": 11563,
                        "code": "130821",
                        "name": "承德县"
                    },
                    {
                        "id": 11572,
                        "code": "130822",
                        "name": "兴隆县"
                    },
                    {
                        "id": 11567,
                        "code": "130824",
                        "name": "滦平县"
                    },
                    {
                        "id": 11566,
                        "code": "130825",
                        "name": "隆化县"
                    },
                    {
                        "id": 11564,
                        "code": "130826",
                        "name": "丰宁满族自治县"
                    },
                    {
                        "id": 11565,
                        "code": "130827",
                        "name": "宽城满族自治县"
                    },
                    {
                        "id": 11571,
                        "code": "130828",
                        "name": "围场满族蒙古族自治县"
                    },
                    {
                        "id": 11568,
                        "code": "130881",
                        "name": "平泉县"
                    }
                ]
            },
            {
                "id": 885,
                "code": "130900",
                "name": "沧州",
                "children": [
                    {
                        "id": 11560,
                        "code": "130902",
                        "name": "新华区"
                    },
                    {
                        "id": 11562,
                        "code": "130903",
                        "name": "运河区"
                    },
                    {
                        "id": 11548,
                        "code": "130921",
                        "name": "沧县"
                    },
                    {
                        "id": 11555,
                        "code": "130922",
                        "name": "青县"
                    },
                    {
                        "id": 11549,
                        "code": "130923",
                        "name": "东光县"
                    },
                    {
                        "id": 11550,
                        "code": "130924",
                        "name": "海兴县"
                    },
                    {
                        "id": 11561,
                        "code": "130925",
                        "name": "盐山县"
                    },
                    {
                        "id": 11557,
                        "code": "130926",
                        "name": "肃宁县"
                    },
                    {
                        "id": 11554,
                        "code": "130927",
                        "name": "南皮县"
                    },
                    {
                        "id": 11558,
                        "code": "130928",
                        "name": "吴桥县"
                    },
                    {
                        "id": 11559,
                        "code": "130929",
                        "name": "献县"
                    },
                    {
                        "id": 11553,
                        "code": "130930",
                        "name": "孟村回族自治县"
                    },
                    {
                        "id": 11547,
                        "code": "130981",
                        "name": "泊头市"
                    },
                    {
                        "id": 11556,
                        "code": "130982",
                        "name": "任丘市"
                    },
                    {
                        "id": 11552,
                        "code": "130983",
                        "name": "黄骅市"
                    },
                    {
                        "id": 11551,
                        "code": "130984",
                        "name": "河间市"
                    }
                ]
            },
            {
                "id": 889,
                "code": "131000",
                "name": "廊坊",
                "children": [
                    {
                        "id": 11603,
                        "code": "131002",
                        "name": "安次区"
                    },
                    {
                        "id": 11608,
                        "code": "131003",
                        "name": "广阳区"
                    },
                    {
                        "id": 11607,
                        "code": "131022",
                        "name": "固安县"
                    },
                    {
                        "id": 11612,
                        "code": "131023",
                        "name": "永清县"
                    },
                    {
                        "id": 11611,
                        "code": "131024",
                        "name": "香河县"
                    },
                    {
                        "id": 11606,
                        "code": "131025",
                        "name": "大城县"
                    },
                    {
                        "id": 11610,
                        "code": "131026",
                        "name": "文安县"
                    },
                    {
                        "id": 11605,
                        "code": "131028",
                        "name": "大厂回族自治县"
                    },
                    {
                        "id": 11604,
                        "code": "131081",
                        "name": "霸州市"
                    },
                    {
                        "id": 11609,
                        "code": "131082",
                        "name": "三河市"
                    }
                ]
            },
            {
                "id": 888,
                "code": "131100",
                "name": "衡水",
                "children": [
                    {
                        "id": 11599,
                        "code": "131102",
                        "name": "桃城区"
                    },
                    {
                        "id": 11595,
                        "code": "131103",
                        "name": "冀州市"
                    },
                    {
                        "id": 11602,
                        "code": "131121",
                        "name": "枣强县"
                    },
                    {
                        "id": 11601,
                        "code": "131122",
                        "name": "武邑县"
                    },
                    {
                        "id": 11600,
                        "code": "131123",
                        "name": "武强县"
                    },
                    {
                        "id": 11597,
                        "code": "131124",
                        "name": "饶阳县"
                    },
                    {
                        "id": 11592,
                        "code": "131125",
                        "name": "安平县"
                    },
                    {
                        "id": 11594,
                        "code": "131126",
                        "name": "故城县"
                    },
                    {
                        "id": 11596,
                        "code": "131127",
                        "name": "景县"
                    },
                    {
                        "id": 11593,
                        "code": "131128",
                        "name": "阜城县"
                    },
                    {
                        "id": 11598,
                        "code": "131182",
                        "name": "深州市"
                    }
                ]
            }
        ]
    },
    {
        "id": 59,
        "code": "140000",
        "name": "山西",
        "children": [
            {
                "id": 1051,
                "code": "140100",
                "name": "太原",
                "children": [
                    {
                        "id": 12909,
                        "code": "140105",
                        "name": "小店区"
                    },
                    {
                        "id": 12912,
                        "code": "140106",
                        "name": "迎泽区"
                    },
                    {
                        "id": 12910,
                        "code": "140107",
                        "name": "杏花岭区"
                    },
                    {
                        "id": 12904,
                        "code": "140108",
                        "name": "尖草坪区"
                    },
                    {
                        "id": 12908,
                        "code": "140109",
                        "name": "万柏林区"
                    },
                    {
                        "id": 12905,
                        "code": "140110",
                        "name": "晋源区"
                    },
                    {
                        "id": 12907,
                        "code": "140121",
                        "name": "清徐县"
                    },
                    {
                        "id": 12911,
                        "code": "140122",
                        "name": "阳曲县"
                    },
                    {
                        "id": 12906,
                        "code": "140123",
                        "name": "娄烦县"
                    },
                    {
                        "id": 12903,
                        "code": "140181",
                        "name": "古交市"
                    }
                ]
            },
            {
                "id": 1045,
                "code": "140200",
                "name": "大同",
                "children": [
                    {
                        "id": 12846,
                        "code": "140212",
                        "name": "新荣区"
                    },
                    {
                        "id": 12844,
                        "code": "140213",
                        "name": "平城区"
                    },
                    {
                        "id": 12848,
                        "code": "140214",
                        "name": "云冈区"
                    },
                    {
                        "id": 12849,
                        "code": "140215",
                        "name": "云州区"
                    },
                    {
                        "id": 12847,
                        "code": "140221",
                        "name": "阳高县"
                    },
                    {
                        "id": 12845,
                        "code": "140222",
                        "name": "天镇县"
                    },
                    {
                        "id": 12841,
                        "code": "140223",
                        "name": "广灵县"
                    },
                    {
                        "id": 12843,
                        "code": "140224",
                        "name": "灵丘县"
                    },
                    {
                        "id": 12842,
                        "code": "140225",
                        "name": "浑源县"
                    },
                    {
                        "id": 12850,
                        "code": "140226",
                        "name": "左云县"
                    }
                ]
            },
            {
                "id": 1053,
                "code": "140300",
                "name": "阳泉",
                "children": [
                    {
                        "id": 13855,
                        "code": "140302",
                        "name": "城区"
                    },
                    {
                        "id": 12927,
                        "code": "140303",
                        "name": "矿区"
                    },
                    {
                        "id": 13856,
                        "code": "140311",
                        "name": "郊区"
                    },
                    {
                        "id": 12928,
                        "code": "140321",
                        "name": "平定县"
                    },
                    {
                        "id": 12929,
                        "code": "140322",
                        "name": "盂县"
                    }
                ]
            },
            {
                "id": 1055,
                "code": "140400",
                "name": "长治",
                "children": [
                    {
                        "id": 12946,
                        "code": "140403",
                        "name": "潞州区"
                    },
                    {
                        "id": 12950,
                        "code": "140404",
                        "name": "上党区"
                    },
                    {
                        "id": 12951,
                        "code": "140405",
                        "name": "屯留县"
                    },
                    {
                        "id": 12945,
                        "code": "140406",
                        "name": "潞城市"
                    },
                    {
                        "id": 12953,
                        "code": "140423",
                        "name": "襄垣县"
                    },
                    {
                        "id": 12947,
                        "code": "140425",
                        "name": "平顺县"
                    },
                    {
                        "id": 12944,
                        "code": "140426",
                        "name": "黎城县"
                    },
                    {
                        "id": 12943,
                        "code": "140427",
                        "name": "壶关县"
                    },
                    {
                        "id": 12954,
                        "code": "140428",
                        "name": "长子县"
                    },
                    {
                        "id": 12952,
                        "code": "140429",
                        "name": "武乡县"
                    },
                    {
                        "id": 12948,
                        "code": "140430",
                        "name": "沁县"
                    },
                    {
                        "id": 12949,
                        "code": "140431",
                        "name": "沁源县"
                    }
                ]
            },
            {
                "id": 1046,
                "code": "140500",
                "name": "晋城",
                "children": [
                    {
                        "id": 13854,
                        "code": "140502",
                        "name": "城区"
                    },
                    {
                        "id": 12853,
                        "code": "140521",
                        "name": "沁水县"
                    },
                    {
                        "id": 12854,
                        "code": "140522",
                        "name": "阳城县"
                    },
                    {
                        "id": 12852,
                        "code": "140524",
                        "name": "陵川县"
                    },
                    {
                        "id": 12855,
                        "code": "140525",
                        "name": "泽州县"
                    },
                    {
                        "id": 12851,
                        "code": "140581",
                        "name": "高平市"
                    }
                ]
            },
            {
                "id": 1050,
                "code": "140600",
                "name": "朔州",
                "children": [
                    {
                        "id": 12900,
                        "code": "140602",
                        "name": "朔城区"
                    },
                    {
                        "id": 12898,
                        "code": "140603",
                        "name": "平鲁区"
                    },
                    {
                        "id": 12899,
                        "code": "140621",
                        "name": "山阴县"
                    },
                    {
                        "id": 12901,
                        "code": "140622",
                        "name": "应县"
                    },
                    {
                        "id": 12902,
                        "code": "140623",
                        "name": "右玉县"
                    },
                    {
                        "id": 12897,
                        "code": "140681",
                        "name": "怀仁县"
                    }
                ]
            },
            {
                "id": 1047,
                "code": "140700",
                "name": "晋中",
                "children": [
                    {
                        "id": 12864,
                        "code": "140702",
                        "name": "榆次区"
                    },
                    {
                        "id": 12862,
                        "code": "140703",
                        "name": "太谷县"
                    },
                    {
                        "id": 12865,
                        "code": "140721",
                        "name": "榆社县"
                    },
                    {
                        "id": 12866,
                        "code": "140722",
                        "name": "左权县"
                    },
                    {
                        "id": 12856,
                        "code": "140723",
                        "name": "和顺县"
                    },
                    {
                        "id": 12863,
                        "code": "140724",
                        "name": "昔阳县"
                    },
                    {
                        "id": 12861,
                        "code": "140725",
                        "name": "寿阳县"
                    },
                    {
                        "id": 12860,
                        "code": "140727",
                        "name": "祁县"
                    },
                    {
                        "id": 12859,
                        "code": "140728",
                        "name": "平遥县"
                    },
                    {
                        "id": 12858,
                        "code": "140729",
                        "name": "灵石县"
                    },
                    {
                        "id": 12857,
                        "code": "140781",
                        "name": "介休市"
                    }
                ]
            },
            {
                "id": 1054,
                "code": "140800",
                "name": "运城",
                "children": [
                    {
                        "id": 12940,
                        "code": "140802",
                        "name": "盐湖区"
                    },
                    {
                        "id": 12933,
                        "code": "140821",
                        "name": "临猗县"
                    },
                    {
                        "id": 12936,
                        "code": "140822",
                        "name": "万荣县"
                    },
                    {
                        "id": 12937,
                        "code": "140823",
                        "name": "闻喜县"
                    },
                    {
                        "id": 12931,
                        "code": "140824",
                        "name": "稷山县"
                    },
                    {
                        "id": 12939,
                        "code": "140825",
                        "name": "新绛县"
                    },
                    {
                        "id": 12932,
                        "code": "140826",
                        "name": "绛县"
                    },
                    {
                        "id": 12942,
                        "code": "140827",
                        "name": "垣曲县"
                    },
                    {
                        "id": 12938,
                        "code": "140828",
                        "name": "夏县"
                    },
                    {
                        "id": 12934,
                        "code": "140829",
                        "name": "平陆县"
                    },
                    {
                        "id": 12935,
                        "code": "140830",
                        "name": "芮城县"
                    },
                    {
                        "id": 12941,
                        "code": "140881",
                        "name": "永济市"
                    },
                    {
                        "id": 12930,
                        "code": "140882",
                        "name": "河津市"
                    }
                ]
            },
            {
                "id": 1052,
                "code": "140900",
                "name": "忻州",
                "children": [
                    {
                        "id": 12925,
                        "code": "140902",
                        "name": "忻府区"
                    },
                    {
                        "id": 12915,
                        "code": "140921",
                        "name": "定襄县"
                    },
                    {
                        "id": 12923,
                        "code": "140922",
                        "name": "五台县"
                    },
                    {
                        "id": 12914,
                        "code": "140923",
                        "name": "代县"
                    },
                    {
                        "id": 12916,
                        "code": "140924",
                        "name": "繁峙县"
                    },
                    {
                        "id": 12920,
                        "code": "140925",
                        "name": "宁武县"
                    },
                    {
                        "id": 12918,
                        "code": "140926",
                        "name": "静乐县"
                    },
                    {
                        "id": 12922,
                        "code": "140927",
                        "name": "神池县"
                    },
                    {
                        "id": 12924,
                        "code": "140928",
                        "name": "五寨县"
                    },
                    {
                        "id": 12919,
                        "code": "140929",
                        "name": "岢岚县"
                    },
                    {
                        "id": 12917,
                        "code": "140930",
                        "name": "河曲县"
                    },
                    {
                        "id": 12913,
                        "code": "140931",
                        "name": "保德县"
                    },
                    {
                        "id": 12921,
                        "code": "140932",
                        "name": "偏关县"
                    },
                    {
                        "id": 12926,
                        "code": "140981",
                        "name": "原平市"
                    }
                ]
            },
            {
                "id": 1048,
                "code": "141000",
                "name": "临汾",
                "children": [
                    {
                        "id": 12881,
                        "code": "141002",
                        "name": "尧都区"
                    },
                    {
                        "id": 12877,
                        "code": "141021",
                        "name": "曲沃县"
                    },
                    {
                        "id": 12882,
                        "code": "141022",
                        "name": "翼城县"
                    },
                    {
                        "id": 12880,
                        "code": "141023",
                        "name": "襄汾县"
                    },
                    {
                        "id": 12872,
                        "code": "141024",
                        "name": "洪洞县"
                    },
                    {
                        "id": 12871,
                        "code": "141025",
                        "name": "古县"
                    },
                    {
                        "id": 12867,
                        "code": "141026",
                        "name": "安泽县"
                    },
                    {
                        "id": 12870,
                        "code": "141027",
                        "name": "浮山县"
                    },
                    {
                        "id": 12875,
                        "code": "141028",
                        "name": "吉县"
                    },
                    {
                        "id": 12879,
                        "code": "141029",
                        "name": "乡宁县"
                    },
                    {
                        "id": 12868,
                        "code": "141030",
                        "name": "大宁县"
                    },
                    {
                        "id": 12878,
                        "code": "141031",
                        "name": "隰县"
                    },
                    {
                        "id": 12883,
                        "code": "141032",
                        "name": "永和县"
                    },
                    {
                        "id": 12876,
                        "code": "141033",
                        "name": "蒲县"
                    },
                    {
                        "id": 12869,
                        "code": "141034",
                        "name": "汾西县"
                    },
                    {
                        "id": 12873,
                        "code": "141081",
                        "name": "侯马市"
                    },
                    {
                        "id": 12874,
                        "code": "141082",
                        "name": "霍州市"
                    }
                ]
            },
            {
                "id": 1049,
                "code": "141100",
                "name": "吕梁",
                "children": [
                    {
                        "id": 12889,
                        "code": "141102",
                        "name": "离石区"
                    },
                    {
                        "id": 12893,
                        "code": "141121",
                        "name": "文水县"
                    },
                    {
                        "id": 12886,
                        "code": "141122",
                        "name": "交城县"
                    },
                    {
                        "id": 12895,
                        "code": "141123",
                        "name": "兴县"
                    },
                    {
                        "id": 12890,
                        "code": "141124",
                        "name": "临县"
                    },
                    {
                        "id": 12891,
                        "code": "141125",
                        "name": "柳林县"
                    },
                    {
                        "id": 12892,
                        "code": "141126",
                        "name": "石楼县"
                    },
                    {
                        "id": 12888,
                        "code": "141127",
                        "name": "岚县"
                    },
                    {
                        "id": 12884,
                        "code": "141128",
                        "name": "方山县"
                    },
                    {
                        "id": 12896,
                        "code": "141129",
                        "name": "中阳县"
                    },
                    {
                        "id": 12887,
                        "code": "141130",
                        "name": "交口县"
                    },
                    {
                        "id": 12894,
                        "code": "141181",
                        "name": "孝义市"
                    },
                    {
                        "id": 12885,
                        "code": "141182",
                        "name": "汾阳市"
                    }
                ]
            }
        ]
    },
    {
        "id": 54,
        "code": "150000",
        "name": "内蒙古",
        "children": [
            {
                "id": 1009,
                "code": "150100",
                "name": "呼和浩特",
                "children": [
                    {
                        "id": 12584,
                        "code": "150102",
                        "name": "新城区"
                    },
                    {
                        "id": 12578,
                        "code": "150103",
                        "name": "回民区"
                    },
                    {
                        "id": 12585,
                        "code": "150104",
                        "name": "玉泉区"
                    },
                    {
                        "id": 12580,
                        "code": "150105",
                        "name": "赛罕区"
                    },
                    {
                        "id": 12581,
                        "code": "150121",
                        "name": "土默特左旗"
                    },
                    {
                        "id": 12582,
                        "code": "150122",
                        "name": "托克托县"
                    },
                    {
                        "id": 12577,
                        "code": "150123",
                        "name": "和林格尔县"
                    },
                    {
                        "id": 12579,
                        "code": "150124",
                        "name": "清水河县"
                    },
                    {
                        "id": 12583,
                        "code": "150125",
                        "name": "武川县"
                    }
                ]
            },
            {
                "id": 1006,
                "code": "150200",
                "name": "包头",
                "children": [
                    {
                        "id": 12550,
                        "code": "150202",
                        "name": "东河区"
                    },
                    {
                        "id": 12553,
                        "code": "150203",
                        "name": "昆都仑区"
                    },
                    {
                        "id": 13851,
                        "code": "150204",
                        "name": "青山区"
                    },
                    {
                        "id": 12554,
                        "code": "150205",
                        "name": "石拐区"
                    },
                    {
                        "id": 12548,
                        "code": "150206",
                        "name": "白云矿区"
                    },
                    {
                        "id": 12552,
                        "code": "150207",
                        "name": "九原区"
                    },
                    {
                        "id": 12555,
                        "code": "150221",
                        "name": "土默特右旗"
                    },
                    {
                        "id": 12551,
                        "code": "150222",
                        "name": "固阳县"
                    },
                    {
                        "id": 12549,
                        "code": "150223",
                        "name": "达尔罕茂明安联合旗"
                    }
                ]
            },
            {
                "id": 1012,
                "code": "150300",
                "name": "乌海",
                "children": [
                    {
                        "id": 12608,
                        "code": "150302",
                        "name": "海勃湾区"
                    },
                    {
                        "id": 12609,
                        "code": "150303",
                        "name": "海南区"
                    },
                    {
                        "id": 12610,
                        "code": "150304",
                        "name": "乌达区"
                    }
                ]
            },
            {
                "id": 1007,
                "code": "150400",
                "name": "赤峰",
                "children": [
                    {
                        "id": 12560,
                        "code": "150402",
                        "name": "红山区"
                    },
                    {
                        "id": 12567,
                        "code": "150403",
                        "name": "元宝山区"
                    },
                    {
                        "id": 12565,
                        "code": "150404",
                        "name": "松山区"
                    },
                    {
                        "id": 12556,
                        "code": "150421",
                        "name": "阿鲁科尔沁旗"
                    },
                    {
                        "id": 12559,
                        "code": "150422",
                        "name": "巴林左旗"
                    },
                    {
                        "id": 12558,
                        "code": "150423",
                        "name": "巴林右旗"
                    },
                    {
                        "id": 12563,
                        "code": "150424",
                        "name": "林西县"
                    },
                    {
                        "id": 12562,
                        "code": "150425",
                        "name": "克什克腾旗"
                    },
                    {
                        "id": 12566,
                        "code": "150426",
                        "name": "翁牛特旗"
                    },
                    {
                        "id": 12561,
                        "code": "150428",
                        "name": "喀喇沁旗"
                    },
                    {
                        "id": 12564,
                        "code": "150429",
                        "name": "宁城县"
                    },
                    {
                        "id": 12557,
                        "code": "150430",
                        "name": "敖汉旗"
                    }
                ]
            },
            {
                "id": 1011,
                "code": "150500",
                "name": "通辽",
                "children": [
                    {
                        "id": 12602,
                        "code": "150502",
                        "name": "科尔沁区"
                    },
                    {
                        "id": 12604,
                        "code": "150521",
                        "name": "科尔沁左翼中旗"
                    },
                    {
                        "id": 12603,
                        "code": "150522",
                        "name": "科尔沁左翼后旗"
                    },
                    {
                        "id": 12601,
                        "code": "150523",
                        "name": "开鲁县"
                    },
                    {
                        "id": 12605,
                        "code": "150524",
                        "name": "库伦旗"
                    },
                    {
                        "id": 12606,
                        "code": "150525",
                        "name": "奈曼旗"
                    },
                    {
                        "id": 12607,
                        "code": "150526",
                        "name": "扎鲁特旗"
                    },
                    {
                        "id": 12600,
                        "code": "150581",
                        "name": "霍林郭勒市"
                    }
                ]
            },
            {
                "id": 1008,
                "code": "150600",
                "name": "鄂尔多斯",
                "children": [
                    {
                        "id": 12569,
                        "code": "150602",
                        "name": "东胜区"
                    },
                    {
                        "id": 12573,
                        "code": "150603",
                        "name": "康巴什区"
                    },
                    {
                        "id": 12568,
                        "code": "150621",
                        "name": "达拉特旗"
                    },
                    {
                        "id": 12576,
                        "code": "150622",
                        "name": "准格尔旗"
                    },
                    {
                        "id": 12571,
                        "code": "150623",
                        "name": "鄂托克前旗"
                    },
                    {
                        "id": 12570,
                        "code": "150624",
                        "name": "鄂托克旗"
                    },
                    {
                        "id": 12572,
                        "code": "150625",
                        "name": "杭锦旗"
                    },
                    {
                        "id": 12574,
                        "code": "150626",
                        "name": "乌审旗"
                    },
                    {
                        "id": 12575,
                        "code": "150627",
                        "name": "伊金霍洛旗"
                    }
                ]
            },
            {
                "id": 1010,
                "code": "150700",
                "name": "呼伦贝尔",
                "children": [
                    {
                        "id": 12592,
                        "code": "150702",
                        "name": "海拉尔区"
                    },
                    {
                        "id": 12598,
                        "code": "150703",
                        "name": "扎赉诺尔区"
                    },
                    {
                        "id": 12586,
                        "code": "150721",
                        "name": "阿荣旗"
                    },
                    {
                        "id": 12594,
                        "code": "150722",
                        "name": "莫力达瓦达斡尔族自治旗"
                    },
                    {
                        "id": 12589,
                        "code": "150723",
                        "name": "鄂伦春自治旗"
                    },
                    {
                        "id": 12590,
                        "code": "150724",
                        "name": "鄂温克族自治旗"
                    },
                    {
                        "id": 12587,
                        "code": "150725",
                        "name": "陈巴尔虎旗"
                    },
                    {
                        "id": 12596,
                        "code": "150726",
                        "name": "新巴尔虎左旗"
                    },
                    {
                        "id": 12595,
                        "code": "150727",
                        "name": "新巴尔虎右旗"
                    },
                    {
                        "id": 12593,
                        "code": "150781",
                        "name": "满洲里市"
                    },
                    {
                        "id": 12597,
                        "code": "150782",
                        "name": "牙克石市"
                    },
                    {
                        "id": 12599,
                        "code": "150783",
                        "name": "扎兰屯市"
                    },
                    {
                        "id": 12588,
                        "code": "150784",
                        "name": "额尔古纳市"
                    },
                    {
                        "id": 12591,
                        "code": "150785",
                        "name": "根河市"
                    }
                ]
            },
            {
                "id": 1005,
                "code": "150800",
                "name": "巴彦淖尔",
                "children": [
                    {
                        "id": 12543,
                        "code": "150802",
                        "name": "临河区"
                    },
                    {
                        "id": 12547,
                        "code": "150821",
                        "name": "五原县"
                    },
                    {
                        "id": 12541,
                        "code": "150822",
                        "name": "磴口县"
                    },
                    {
                        "id": 12545,
                        "code": "150823",
                        "name": "乌拉特前旗"
                    },
                    {
                        "id": 12546,
                        "code": "150824",
                        "name": "乌拉特中旗"
                    },
                    {
                        "id": 12544,
                        "code": "150825",
                        "name": "乌拉特后旗"
                    },
                    {
                        "id": 12542,
                        "code": "150826",
                        "name": "杭锦后旗"
                    }
                ]
            },
            {
                "id": 1013,
                "code": "150900",
                "name": "乌兰察布",
                "children": [
                    {
                        "id": 12616,
                        "code": "150902",
                        "name": "集宁区"
                    },
                    {
                        "id": 12621,
                        "code": "150921",
                        "name": "卓资县"
                    },
                    {
                        "id": 12615,
                        "code": "150922",
                        "name": "化德县"
                    },
                    {
                        "id": 12618,
                        "code": "150923",
                        "name": "商都县"
                    },
                    {
                        "id": 12620,
                        "code": "150924",
                        "name": "兴和县"
                    },
                    {
                        "id": 12617,
                        "code": "150925",
                        "name": "凉城县"
                    },
                    {
                        "id": 12612,
                        "code": "150926",
                        "name": "察哈尔右翼前旗"
                    },
                    {
                        "id": 12613,
                        "code": "150927",
                        "name": "察哈尔右翼中旗"
                    },
                    {
                        "id": 12611,
                        "code": "150928",
                        "name": "察哈尔右翼后旗"
                    },
                    {
                        "id": 12619,
                        "code": "150929",
                        "name": "四子王旗"
                    },
                    {
                        "id": 12614,
                        "code": "150981",
                        "name": "丰镇市"
                    }
                ]
            },
            {
                "id": 1015,
                "code": "152200",
                "name": "兴安",
                "children": [
                    {
                        "id": 12638,
                        "code": "152201",
                        "name": "乌兰浩特市"
                    },
                    {
                        "id": 12634,
                        "code": "152202",
                        "name": "阿尔山市"
                    },
                    {
                        "id": 12635,
                        "code": "152221",
                        "name": "科尔沁右翼前旗"
                    },
                    {
                        "id": 12636,
                        "code": "152222",
                        "name": "科尔沁右翼中旗"
                    },
                    {
                        "id": 12639,
                        "code": "152223",
                        "name": "扎赉特旗"
                    },
                    {
                        "id": 12637,
                        "code": "152224",
                        "name": "突泉县"
                    }
                ]
            },
            {
                "id": 1014,
                "code": "152500",
                "name": "锡林郭勒",
                "children": [
                    {
                        "id": 12625,
                        "code": "152501",
                        "name": "二连浩特市"
                    },
                    {
                        "id": 12630,
                        "code": "152502",
                        "name": "锡林浩特市"
                    },
                    {
                        "id": 12622,
                        "code": "152522",
                        "name": "阿巴嘎旗"
                    },
                    {
                        "id": 12627,
                        "code": "152523",
                        "name": "苏尼特左旗"
                    },
                    {
                        "id": 12626,
                        "code": "152524",
                        "name": "苏尼特右旗"
                    },
                    {
                        "id": 12623,
                        "code": "152525",
                        "name": "东乌珠穆沁旗"
                    },
                    {
                        "id": 12629,
                        "code": "152526",
                        "name": "西乌珠穆沁旗"
                    },
                    {
                        "id": 12628,
                        "code": "152527",
                        "name": "太仆寺旗"
                    },
                    {
                        "id": 12631,
                        "code": "152528",
                        "name": "镶黄旗"
                    },
                    {
                        "id": 12633,
                        "code": "152529",
                        "name": "正镶白旗"
                    },
                    {
                        "id": 12632,
                        "code": "152530",
                        "name": "正蓝旗"
                    },
                    {
                        "id": 12624,
                        "code": "152531",
                        "name": "多伦县"
                    }
                ]
            },
            {
                "id": 1004,
                "code": "152900",
                "name": "阿拉善",
                "children": [
                    {
                        "id": 12539,
                        "code": "152921",
                        "name": "阿拉善左旗"
                    },
                    {
                        "id": 12538,
                        "code": "152922",
                        "name": "阿拉善右旗"
                    },
                    {
                        "id": 12540,
                        "code": "152923",
                        "name": "额济纳旗"
                    }
                ]
            }
        ]
    },
    {
        "id": 53,
        "code": "210000",
        "name": "辽宁",
        "children": [
            {
                "id": 1001,
                "code": "210100",
                "name": "沈阳",
                "children": [
                    {
                        "id": 12515,
                        "code": "210102",
                        "name": "和平区"
                    },
                    {
                        "id": 12521,
                        "code": "210103",
                        "name": "沈河区"
                    },
                    {
                        "id": 12513,
                        "code": "210104",
                        "name": "大东区"
                    },
                    {
                        "id": 12516,
                        "code": "210105",
                        "name": "皇姑区"
                    },
                    {
                        "id": 13850,
                        "code": "210106",
                        "name": "铁西区"
                    },
                    {
                        "id": 12522,
                        "code": "210111",
                        "name": "苏家屯区"
                    },
                    {
                        "id": 12517,
                        "code": "210112",
                        "name": "浑南区"
                    },
                    {
                        "id": 12520,
                        "code": "210113",
                        "name": "沈北新区"
                    },
                    {
                        "id": 12524,
                        "code": "210114",
                        "name": "于洪区"
                    },
                    {
                        "id": 12519,
                        "code": "210115",
                        "name": "辽中县"
                    },
                    {
                        "id": 12518,
                        "code": "210123",
                        "name": "康平县"
                    },
                    {
                        "id": 12514,
                        "code": "210124",
                        "name": "法库县"
                    },
                    {
                        "id": 12523,
                        "code": "210181",
                        "name": "新民市"
                    }
                ]
            },
            {
                "id": 993,
                "code": "210200",
                "name": "大连",
                "children": [
                    {
                        "id": 12468,
                        "code": "210202",
                        "name": "中山区"
                    },
                    {
                        "id": 12466,
                        "code": "210203",
                        "name": "西岗区"
                    },
                    {
                        "id": 12464,
                        "code": "210204",
                        "name": "沙河口区"
                    },
                    {
                        "id": 12460,
                        "code": "210211",
                        "name": "甘井子区"
                    },
                    {
                        "id": 12462,
                        "code": "210212",
                        "name": "旅顺口区"
                    },
                    {
                        "id": 12461,
                        "code": "210213",
                        "name": "金州区"
                    },
                    {
                        "id": 12463,
                        "code": "210214",
                        "name": "普兰店市"
                    },
                    {
                        "id": 12467,
                        "code": "210224",
                        "name": "长海县"
                    },
                    {
                        "id": 12465,
                        "code": "210281",
                        "name": "瓦房店市"
                    },
                    {
                        "id": 12469,
                        "code": "210283",
                        "name": "庄河市"
                    }
                ]
            },
            {
                "id": 990,
                "code": "210300",
                "name": "鞍山",
                "children": [
                    {
                        "id": 13847,
                        "code": "210302",
                        "name": "铁东区"
                    },
                    {
                        "id": 13848,
                        "code": "210303",
                        "name": "铁西区"
                    },
                    {
                        "id": 12443,
                        "code": "210304",
                        "name": "立山区"
                    },
                    {
                        "id": 12444,
                        "code": "210311",
                        "name": "千山区"
                    },
                    {
                        "id": 12445,
                        "code": "210321",
                        "name": "台安县"
                    },
                    {
                        "id": 12446,
                        "code": "210323",
                        "name": "岫岩满族自治县"
                    },
                    {
                        "id": 12442,
                        "code": "210381",
                        "name": "海城市"
                    }
                ]
            },
            {
                "id": 995,
                "code": "210400",
                "name": "抚顺",
                "children": [
                    {
                        "id": 12482,
                        "code": "210402",
                        "name": "新抚区"
                    },
                    {
                        "id": 12476,
                        "code": "210403",
                        "name": "东洲区"
                    },
                    {
                        "id": 12480,
                        "code": "210404",
                        "name": "望花区"
                    },
                    {
                        "id": 12479,
                        "code": "210411",
                        "name": "顺城区"
                    },
                    {
                        "id": 12477,
                        "code": "210421",
                        "name": "抚顺县"
                    },
                    {
                        "id": 12481,
                        "code": "210422",
                        "name": "新宾满族自治县"
                    },
                    {
                        "id": 12478,
                        "code": "210423",
                        "name": "清原满族自治县"
                    }
                ]
            },
            {
                "id": 991,
                "code": "210500",
                "name": "本溪",
                "children": [
                    {
                        "id": 12451,
                        "code": "210502",
                        "name": "平山区"
                    },
                    {
                        "id": 12452,
                        "code": "210503",
                        "name": "溪湖区"
                    },
                    {
                        "id": 12449,
                        "code": "210504",
                        "name": "明山区"
                    },
                    {
                        "id": 12450,
                        "code": "210505",
                        "name": "南芬区"
                    },
                    {
                        "id": 12447,
                        "code": "210521",
                        "name": "本溪满族自治县"
                    },
                    {
                        "id": 12448,
                        "code": "210522",
                        "name": "桓仁满族自治县"
                    }
                ]
            },
            {
                "id": 994,
                "code": "210600",
                "name": "丹东",
                "children": [
                    {
                        "id": 12473,
                        "code": "210602",
                        "name": "元宝区"
                    },
                    {
                        "id": 12475,
                        "code": "210603",
                        "name": "振兴区"
                    },
                    {
                        "id": 12474,
                        "code": "210604",
                        "name": "振安区"
                    },
                    {
                        "id": 12472,
                        "code": "210624",
                        "name": "宽甸满族自治县"
                    },
                    {
                        "id": 12470,
                        "code": "210681",
                        "name": "东港市"
                    },
                    {
                        "id": 12471,
                        "code": "210682",
                        "name": "凤城市"
                    }
                ]
            },
            {
                "id": 998,
                "code": "210700",
                "name": "锦州",
                "children": [
                    {
                        "id": 12496,
                        "code": "210702",
                        "name": "古塔区"
                    },
                    {
                        "id": 12499,
                        "code": "210703",
                        "name": "凌河区"
                    },
                    {
                        "id": 12500,
                        "code": "210711",
                        "name": "太和区"
                    },
                    {
                        "id": 12497,
                        "code": "210726",
                        "name": "黑山县"
                    },
                    {
                        "id": 12501,
                        "code": "210727",
                        "name": "义县"
                    },
                    {
                        "id": 12498,
                        "code": "210781",
                        "name": "凌海市"
                    },
                    {
                        "id": 12495,
                        "code": "210782",
                        "name": "北镇市"
                    }
                ]
            },
            {
                "id": 1003,
                "code": "210800",
                "name": "营口",
                "children": [
                    {
                        "id": 12537,
                        "code": "210802",
                        "name": "站前区"
                    },
                    {
                        "id": 12536,
                        "code": "210803",
                        "name": "西市区"
                    },
                    {
                        "id": 12532,
                        "code": "210804",
                        "name": "鲅鱼圈区"
                    },
                    {
                        "id": 12535,
                        "code": "210811",
                        "name": "老边区"
                    },
                    {
                        "id": 12534,
                        "code": "210881",
                        "name": "盖州市"
                    },
                    {
                        "id": 12533,
                        "code": "210882",
                        "name": "大石桥市"
                    }
                ]
            },
            {
                "id": 996,
                "code": "210900",
                "name": "阜新",
                "children": [
                    {
                        "id": 13849,
                        "code": "210902",
                        "name": "海州区"
                    },
                    {
                        "id": 12487,
                        "code": "210903",
                        "name": "新邱区"
                    },
                    {
                        "id": 12485,
                        "code": "210904",
                        "name": "太平区"
                    },
                    {
                        "id": 12484,
                        "code": "210905",
                        "name": "清河门区"
                    },
                    {
                        "id": 12486,
                        "code": "210911",
                        "name": "细河区"
                    },
                    {
                        "id": 12483,
                        "code": "210921",
                        "name": "阜新蒙古族自治县"
                    },
                    {
                        "id": 12488,
                        "code": "210922",
                        "name": "彰武县"
                    }
                ]
            },
            {
                "id": 999,
                "code": "211000",
                "name": "辽阳",
                "children": [
                    {
                        "id": 12502,
                        "code": "211002",
                        "name": "白塔区"
                    },
                    {
                        "id": 12508,
                        "code": "211003",
                        "name": "文圣区"
                    },
                    {
                        "id": 12505,
                        "code": "211004",
                        "name": "宏伟区"
                    },
                    {
                        "id": 12504,
                        "code": "211005",
                        "name": "弓长岭区"
                    },
                    {
                        "id": 12507,
                        "code": "211011",
                        "name": "太子河区"
                    },
                    {
                        "id": 12506,
                        "code": "211021",
                        "name": "辽阳县"
                    },
                    {
                        "id": 12503,
                        "code": "211081",
                        "name": "灯塔市"
                    }
                ]
            },
            {
                "id": 1000,
                "code": "211100",
                "name": "盘锦",
                "children": [
                    {
                        "id": 12511,
                        "code": "211102",
                        "name": "双台子区"
                    },
                    {
                        "id": 12512,
                        "code": "211103",
                        "name": "兴隆台区"
                    },
                    {
                        "id": 12509,
                        "code": "211104",
                        "name": "大洼县"
                    },
                    {
                        "id": 12510,
                        "code": "211122",
                        "name": "盘山县"
                    }
                ]
            },
            {
                "id": 1002,
                "code": "211200",
                "name": "铁岭",
                "children": [
                    {
                        "id": 12531,
                        "code": "211202",
                        "name": "银州区"
                    },
                    {
                        "id": 12527,
                        "code": "211204",
                        "name": "清河区"
                    },
                    {
                        "id": 12529,
                        "code": "211221",
                        "name": "铁岭县"
                    },
                    {
                        "id": 12530,
                        "code": "211223",
                        "name": "西丰县"
                    },
                    {
                        "id": 12525,
                        "code": "211224",
                        "name": "昌图县"
                    },
                    {
                        "id": 12528,
                        "code": "211281",
                        "name": "调兵山市"
                    },
                    {
                        "id": 12526,
                        "code": "211282",
                        "name": "开原市"
                    }
                ]
            },
            {
                "id": 992,
                "code": "211300",
                "name": "朝阳",
                "children": [
                    {
                        "id": 12459,
                        "code": "211302",
                        "name": "双塔区"
                    },
                    {
                        "id": 12458,
                        "code": "211303",
                        "name": "龙城区"
                    },
                    {
                        "id": 12454,
                        "code": "211321",
                        "name": "朝阳县"
                    },
                    {
                        "id": 12455,
                        "code": "211322",
                        "name": "建平县"
                    },
                    {
                        "id": 12456,
                        "code": "211324",
                        "name": "喀喇沁左翼蒙古族自治县"
                    },
                    {
                        "id": 12453,
                        "code": "211381",
                        "name": "北票市"
                    },
                    {
                        "id": 12457,
                        "code": "211382",
                        "name": "凌源市"
                    }
                ]
            },
            {
                "id": 997,
                "code": "211400",
                "name": "葫芦岛",
                "children": [
                    {
                        "id": 12490,
                        "code": "211402",
                        "name": "连山区"
                    },
                    {
                        "id": 12491,
                        "code": "211403",
                        "name": "龙港区"
                    },
                    {
                        "id": 12492,
                        "code": "211404",
                        "name": "南票区"
                    },
                    {
                        "id": 12493,
                        "code": "211421",
                        "name": "绥中县"
                    },
                    {
                        "id": 12489,
                        "code": "211422",
                        "name": "建昌县"
                    },
                    {
                        "id": 12494,
                        "code": "211481",
                        "name": "兴城市"
                    }
                ]
            }
        ]
    },
    {
        "id": 52,
        "code": "220000",
        "name": "吉林",
        "children": [
            {
                "id": 965,
                "code": "220100",
                "name": "长春",
                "children": [
                    {
                        "id": 12244,
                        "code": "220102",
                        "name": "南关区"
                    },
                    {
                        "id": 12242,
                        "code": "220103",
                        "name": "宽城区"
                    },
                    {
                        "id": 13844,
                        "code": "220104",
                        "name": "朝阳区"
                    },
                    {
                        "id": 12239,
                        "code": "220105",
                        "name": "二道区"
                    },
                    {
                        "id": 12243,
                        "code": "220106",
                        "name": "绿园区"
                    },
                    {
                        "id": 12246,
                        "code": "220112",
                        "name": "双阳区"
                    },
                    {
                        "id": 12241,
                        "code": "220113",
                        "name": "九台市"
                    },
                    {
                        "id": 12245,
                        "code": "220122",
                        "name": "农安县"
                    },
                    {
                        "id": 12247,
                        "code": "220182",
                        "name": "榆树市"
                    },
                    {
                        "id": 12238,
                        "code": "220183",
                        "name": "德惠市"
                    },
                    {
                        "id": 12240,
                        "code": "220184",
                        "name": "公主岭市"
                    }
                ]
            },
            {
                "id": 959,
                "code": "220200",
                "name": "吉林",
                "children": [
                    {
                        "id": 12201,
                        "code": "220202",
                        "name": "昌邑区"
                    },
                    {
                        "id": 12206,
                        "code": "220203",
                        "name": "龙潭区"
                    },
                    {
                        "id": 12202,
                        "code": "220204",
                        "name": "船营区"
                    },
                    {
                        "id": 12203,
                        "code": "220211",
                        "name": "丰满区"
                    },
                    {
                        "id": 12209,
                        "code": "220221",
                        "name": "永吉县"
                    },
                    {
                        "id": 12205,
                        "code": "220281",
                        "name": "蛟河市"
                    },
                    {
                        "id": 12204,
                        "code": "220282",
                        "name": "桦甸市"
                    },
                    {
                        "id": 12208,
                        "code": "220283",
                        "name": "舒兰市"
                    },
                    {
                        "id": 12207,
                        "code": "220284",
                        "name": "磐石市"
                    }
                ]
            },
            {
                "id": 961,
                "code": "220300",
                "name": "四平",
                "children": [
                    {
                        "id": 12216,
                        "code": "220302",
                        "name": "铁西区"
                    },
                    {
                        "id": 12215,
                        "code": "220303",
                        "name": "铁东区"
                    },
                    {
                        "id": 12213,
                        "code": "220322",
                        "name": "梨树县"
                    },
                    {
                        "id": 12217,
                        "code": "220323",
                        "name": "伊通满族自治县"
                    },
                    {
                        "id": 12214,
                        "code": "220382",
                        "name": "双辽市"
                    }
                ]
            },
            {
                "id": 960,
                "code": "220400",
                "name": "辽源",
                "children": [
                    {
                        "id": 12212,
                        "code": "220402",
                        "name": "龙山区"
                    },
                    {
                        "id": 13843,
                        "code": "220403",
                        "name": "西安区"
                    },
                    {
                        "id": 12210,
                        "code": "220421",
                        "name": "东丰县"
                    },
                    {
                        "id": 12211,
                        "code": "220422",
                        "name": "东辽县"
                    }
                ]
            },
            {
                "id": 963,
                "code": "220500",
                "name": "通化",
                "children": [
                    {
                        "id": 12223,
                        "code": "220502",
                        "name": "东昌区"
                    },
                    {
                        "id": 12224,
                        "code": "220503",
                        "name": "二道江区"
                    },
                    {
                        "id": 12229,
                        "code": "220521",
                        "name": "通化县"
                    },
                    {
                        "id": 12225,
                        "code": "220523",
                        "name": "辉南县"
                    },
                    {
                        "id": 12227,
                        "code": "220524",
                        "name": "柳河县"
                    },
                    {
                        "id": 12228,
                        "code": "220581",
                        "name": "梅河口市"
                    },
                    {
                        "id": 12226,
                        "code": "220582",
                        "name": "集安市"
                    }
                ]
            },
            {
                "id": 958,
                "code": "220600",
                "name": "白山",
                "children": [
                    {
                        "id": 12196,
                        "code": "220602",
                        "name": "浑江区"
                    },
                    {
                        "id": 12197,
                        "code": "220605",
                        "name": "江源区"
                    },
                    {
                        "id": 12195,
                        "code": "220621",
                        "name": "抚松县"
                    },
                    {
                        "id": 12198,
                        "code": "220622",
                        "name": "靖宇县"
                    },
                    {
                        "id": 12200,
                        "code": "220623",
                        "name": "长白朝鲜族自治县"
                    },
                    {
                        "id": 12199,
                        "code": "220681",
                        "name": "临江市"
                    }
                ]
            },
            {
                "id": 962,
                "code": "220700",
                "name": "松原",
                "children": [
                    {
                        "id": 12219,
                        "code": "220702",
                        "name": "宁江区"
                    },
                    {
                        "id": 12220,
                        "code": "220721",
                        "name": "前郭尔罗斯蒙古族自治县"
                    },
                    {
                        "id": 12222,
                        "code": "220722",
                        "name": "长岭县"
                    },
                    {
                        "id": 12221,
                        "code": "220723",
                        "name": "乾安县"
                    },
                    {
                        "id": 12218,
                        "code": "220781",
                        "name": "扶余县"
                    }
                ]
            },
            {
                "id": 957,
                "code": "220800",
                "name": "白城",
                "children": [
                    {
                        "id": 12191,
                        "code": "220802",
                        "name": "洮北区"
                    },
                    {
                        "id": 12194,
                        "code": "220821",
                        "name": "镇赉县"
                    },
                    {
                        "id": 12193,
                        "code": "220822",
                        "name": "通榆县"
                    },
                    {
                        "id": 12192,
                        "code": "220881",
                        "name": "洮南市"
                    },
                    {
                        "id": 12190,
                        "code": "220882",
                        "name": "大安市"
                    }
                ]
            },
            {
                "id": 964,
                "code": "222400",
                "name": "延边",
                "children": [
                    {
                        "id": 12237,
                        "code": "222401",
                        "name": "延吉市"
                    },
                    {
                        "id": 12235,
                        "code": "222402",
                        "name": "图们市"
                    },
                    {
                        "id": 12231,
                        "code": "222403",
                        "name": "敦化市"
                    },
                    {
                        "id": 12233,
                        "code": "222404",
                        "name": "珲春市"
                    },
                    {
                        "id": 12234,
                        "code": "222405",
                        "name": "龙井市"
                    },
                    {
                        "id": 12232,
                        "code": "222406",
                        "name": "和龙市"
                    },
                    {
                        "id": 12236,
                        "code": "222424",
                        "name": "汪清县"
                    },
                    {
                        "id": 12230,
                        "code": "222426",
                        "name": "安图县"
                    }
                ]
            }
        ]
    },
    {
        "id": 46,
        "code": "230000",
        "name": "黑龙江",
        "children": [
            {
                "id": 915,
                "code": "230100",
                "name": "哈尔滨",
                "children": [
                    {
                        "id": 11862,
                        "code": "230102",
                        "name": "道里区"
                    },
                    {
                        "id": 11867,
                        "code": "230103",
                        "name": "南岗区"
                    },
                    {
                        "id": 11863,
                        "code": "230104",
                        "name": "道外区"
                    },
                    {
                        "id": 11868,
                        "code": "230108",
                        "name": "平房区"
                    },
                    {
                        "id": 11871,
                        "code": "230109",
                        "name": "松北区"
                    },
                    {
                        "id": 11874,
                        "code": "230110",
                        "name": "香坊区"
                    },
                    {
                        "id": 11865,
                        "code": "230111",
                        "name": "呼兰区"
                    },
                    {
                        "id": 11859,
                        "code": "230112",
                        "name": "阿城区"
                    },
                    {
                        "id": 11870,
                        "code": "230113",
                        "name": "双城市"
                    },
                    {
                        "id": 11876,
                        "code": "230123",
                        "name": "依兰县"
                    },
                    {
                        "id": 11864,
                        "code": "230124",
                        "name": "方正县"
                    },
                    {
                        "id": 11861,
                        "code": "230125",
                        "name": "宾县"
                    },
                    {
                        "id": 11860,
                        "code": "230126",
                        "name": "巴彦县"
                    },
                    {
                        "id": 11866,
                        "code": "230127",
                        "name": "木兰县"
                    },
                    {
                        "id": 11872,
                        "code": "230128",
                        "name": "通河县"
                    },
                    {
                        "id": 11875,
                        "code": "230129",
                        "name": "延寿县"
                    },
                    {
                        "id": 11869,
                        "code": "230183",
                        "name": "尚志市"
                    },
                    {
                        "id": 11873,
                        "code": "230184",
                        "name": "五常市"
                    }
                ]
            },
            {
                "id": 922,
                "code": "230200",
                "name": "齐齐哈尔",
                "children": [
                    {
                        "id": 11930,
                        "code": "230202",
                        "name": "龙沙区"
                    },
                    {
                        "id": 11926,
                        "code": "230203",
                        "name": "建华区"
                    },
                    {
                        "id": 11935,
                        "code": "230204",
                        "name": "铁锋区"
                    },
                    {
                        "id": 11921,
                        "code": "230205",
                        "name": "昂昂溪区"
                    },
                    {
                        "id": 11923,
                        "code": "230206",
                        "name": "富拉尔基区"
                    },
                    {
                        "id": 11933,
                        "code": "230207",
                        "name": "碾子山区"
                    },
                    {
                        "id": 11931,
                        "code": "230208",
                        "name": "梅里斯达斡尔族区"
                    },
                    {
                        "id": 11929,
                        "code": "230221",
                        "name": "龙江县"
                    },
                    {
                        "id": 11936,
                        "code": "230223",
                        "name": "依安县"
                    },
                    {
                        "id": 11934,
                        "code": "230224",
                        "name": "泰来县"
                    },
                    {
                        "id": 11925,
                        "code": "230225",
                        "name": "甘南县"
                    },
                    {
                        "id": 11924,
                        "code": "230227",
                        "name": "富裕县"
                    },
                    {
                        "id": 11928,
                        "code": "230229",
                        "name": "克山县"
                    },
                    {
                        "id": 11927,
                        "code": "230230",
                        "name": "克东县"
                    },
                    {
                        "id": 11922,
                        "code": "230231",
                        "name": "拜泉县"
                    },
                    {
                        "id": 11932,
                        "code": "230281",
                        "name": "讷河市"
                    }
                ]
            },
            {
                "id": 918,
                "code": "230300",
                "name": "鸡西",
                "children": [
                    {
                        "id": 11895,
                        "code": "230302",
                        "name": "鸡冠区"
                    },
                    {
                        "id": 11892,
                        "code": "230303",
                        "name": "恒山区"
                    },
                    {
                        "id": 11891,
                        "code": "230304",
                        "name": "滴道区"
                    },
                    {
                        "id": 11896,
                        "code": "230305",
                        "name": "梨树区"
                    },
                    {
                        "id": 11890,
                        "code": "230306",
                        "name": "城子河区"
                    },
                    {
                        "id": 11897,
                        "code": "230307",
                        "name": "麻山区"
                    },
                    {
                        "id": 11894,
                        "code": "230321",
                        "name": "鸡东县"
                    },
                    {
                        "id": 11893,
                        "code": "230381",
                        "name": "虎林市"
                    },
                    {
                        "id": 11898,
                        "code": "230382",
                        "name": "密山市"
                    }
                ]
            },
            {
                "id": 916,
                "code": "230400",
                "name": "鹤岗",
                "children": [
                    {
                        "id": 11881,
                        "code": "230402",
                        "name": "向阳区"
                    },
                    {
                        "id": 11878,
                        "code": "230403",
                        "name": "工农区"
                    },
                    {
                        "id": 13840,
                        "code": "230404",
                        "name": "南山区"
                    },
                    {
                        "id": 11882,
                        "code": "230405",
                        "name": "兴安区"
                    },
                    {
                        "id": 11877,
                        "code": "230406",
                        "name": "东山区"
                    },
                    {
                        "id": 11883,
                        "code": "230407",
                        "name": "兴山区"
                    },
                    {
                        "id": 11879,
                        "code": "230421",
                        "name": "萝北县"
                    },
                    {
                        "id": 11880,
                        "code": "230422",
                        "name": "绥滨县"
                    }
                ]
            },
            {
                "id": 923,
                "code": "230500",
                "name": "双鸭山",
                "children": [
                    {
                        "id": 11940,
                        "code": "230502",
                        "name": "尖山区"
                    },
                    {
                        "id": 11941,
                        "code": "230503",
                        "name": "岭东区"
                    },
                    {
                        "id": 11943,
                        "code": "230505",
                        "name": "四方台区"
                    },
                    {
                        "id": 11938,
                        "code": "230506",
                        "name": "宝山区"
                    },
                    {
                        "id": 11939,
                        "code": "230521",
                        "name": "集贤县"
                    },
                    {
                        "id": 11944,
                        "code": "230522",
                        "name": "友谊县"
                    },
                    {
                        "id": 11937,
                        "code": "230523",
                        "name": "宝清县"
                    },
                    {
                        "id": 11942,
                        "code": "230524",
                        "name": "饶河县"
                    }
                ]
            },
            {
                "id": 913,
                "code": "230600",
                "name": "大庆",
                "children": [
                    {
                        "id": 11850,
                        "code": "230602",
                        "name": "萨尔图区"
                    },
                    {
                        "id": 11848,
                        "code": "230603",
                        "name": "龙凤区"
                    },
                    {
                        "id": 11849,
                        "code": "230604",
                        "name": "让胡路区"
                    },
                    {
                        "id": 11846,
                        "code": "230605",
                        "name": "红岗区"
                    },
                    {
                        "id": 11844,
                        "code": "230606",
                        "name": "大同区"
                    },
                    {
                        "id": 11852,
                        "code": "230621",
                        "name": "肇州县"
                    },
                    {
                        "id": 11851,
                        "code": "230622",
                        "name": "肇源县"
                    },
                    {
                        "id": 11847,
                        "code": "230623",
                        "name": "林甸县"
                    },
                    {
                        "id": 11845,
                        "code": "230624",
                        "name": "杜尔伯特蒙古族自治县"
                    }
                ]
            },
            {
                "id": 925,
                "code": "230700",
                "name": "伊春",
                "children": [
                    {
                        "id": 11963,
                        "code": "230717",
                        "name": "伊美区"
                    },
                    {
                        "id": 11962,
                        "code": "230718",
                        "name": "乌翠区"
                    },
                    {
                        "id": 11964,
                        "code": "230719",
                        "name": "友好区"
                    },
                    {
                        "id": 11957,
                        "code": "230722",
                        "name": "嘉荫县"
                    },
                    {
                        "id": 11960,
                        "code": "230723",
                        "name": "汤旺县"
                    },
                    {
                        "id": 11956,
                        "code": "230724",
                        "name": "丰林县"
                    },
                    {
                        "id": 11955,
                        "code": "230725",
                        "name": "大箐山县"
                    },
                    {
                        "id": 11959,
                        "code": "230726",
                        "name": "南岔区"
                    },
                    {
                        "id": 11958,
                        "code": "230751",
                        "name": "金林区"
                    },
                    {
                        "id": 11961,
                        "code": "230781",
                        "name": "铁力市"
                    }
                ]
            },
            {
                "id": 919,
                "code": "230800",
                "name": "佳木斯",
                "children": [
                    {
                        "id": 13842,
                        "code": "230803",
                        "name": "向阳区"
                    },
                    {
                        "id": 11904,
                        "code": "230804",
                        "name": "前进区"
                    },
                    {
                        "id": 11899,
                        "code": "230805",
                        "name": "东风区"
                    },
                    {
                        "id": 13841,
                        "code": "230811",
                        "name": "郊区"
                    },
                    {
                        "id": 11903,
                        "code": "230822",
                        "name": "桦南县"
                    },
                    {
                        "id": 11902,
                        "code": "230826",
                        "name": "桦川县"
                    },
                    {
                        "id": 11905,
                        "code": "230828",
                        "name": "汤原县"
                    },
                    {
                        "id": 11906,
                        "code": "230881",
                        "name": "同江市"
                    },
                    {
                        "id": 11901,
                        "code": "230882",
                        "name": "富锦市"
                    },
                    {
                        "id": 11900,
                        "code": "230883",
                        "name": "抚远县"
                    }
                ]
            },
            {
                "id": 921,
                "code": "230900",
                "name": "七台河",
                "children": [
                    {
                        "id": 11920,
                        "code": "230902",
                        "name": "新兴区"
                    },
                    {
                        "id": 11919,
                        "code": "230903",
                        "name": "桃山区"
                    },
                    {
                        "id": 11918,
                        "code": "230904",
                        "name": "茄子河区"
                    },
                    {
                        "id": 11917,
                        "code": "230921",
                        "name": "勃利县"
                    }
                ]
            },
            {
                "id": 920,
                "code": "231000",
                "name": "牡丹江",
                "children": [
                    {
                        "id": 11908,
                        "code": "231002",
                        "name": "东安区"
                    },
                    {
                        "id": 11916,
                        "code": "231003",
                        "name": "阳明区"
                    },
                    {
                        "id": 11907,
                        "code": "231004",
                        "name": "爱民区"
                    },
                    {
                        "id": 11915,
                        "code": "231005",
                        "name": "西安区"
                    },
                    {
                        "id": 11911,
                        "code": "231025",
                        "name": "林口县"
                    },
                    {
                        "id": 11914,
                        "code": "231081",
                        "name": "绥芬河市"
                    },
                    {
                        "id": 11910,
                        "code": "231083",
                        "name": "海林市"
                    },
                    {
                        "id": 11913,
                        "code": "231084",
                        "name": "宁安市"
                    },
                    {
                        "id": 11912,
                        "code": "231085",
                        "name": "穆棱市"
                    },
                    {
                        "id": 11909,
                        "code": "231086",
                        "name": "东宁县"
                    }
                ]
            },
            {
                "id": 917,
                "code": "231100",
                "name": "黑河",
                "children": [
                    {
                        "id": 11884,
                        "code": "231102",
                        "name": "爱辉区"
                    },
                    {
                        "id": 11889,
                        "code": "231123",
                        "name": "逊克县"
                    },
                    {
                        "id": 11887,
                        "code": "231124",
                        "name": "孙吴县"
                    },
                    {
                        "id": 11885,
                        "code": "231181",
                        "name": "北安市"
                    },
                    {
                        "id": 11888,
                        "code": "231182",
                        "name": "五大连池市"
                    },
                    {
                        "id": 11886,
                        "code": "231183",
                        "name": "嫩江县"
                    }
                ]
            },
            {
                "id": 924,
                "code": "231200",
                "name": "绥化",
                "children": [
                    {
                        "id": 11946,
                        "code": "231202",
                        "name": "北林区"
                    },
                    {
                        "id": 11953,
                        "code": "231221",
                        "name": "望奎县"
                    },
                    {
                        "id": 11948,
                        "code": "231222",
                        "name": "兰西县"
                    },
                    {
                        "id": 11950,
                        "code": "231223",
                        "name": "青冈县"
                    },
                    {
                        "id": 11951,
                        "code": "231224",
                        "name": "庆安县"
                    },
                    {
                        "id": 11949,
                        "code": "231225",
                        "name": "明水县"
                    },
                    {
                        "id": 11952,
                        "code": "231226",
                        "name": "绥棱县"
                    },
                    {
                        "id": 11945,
                        "code": "231281",
                        "name": "安达市"
                    },
                    {
                        "id": 11954,
                        "code": "231282",
                        "name": "肇东市"
                    },
                    {
                        "id": 11947,
                        "code": "231283",
                        "name": "海伦市"
                    }
                ]
            },
            {
                "id": 914,
                "code": "232700",
                "name": "大兴安岭",
                "children": [
                    {
                        "id": 11853,
                        "code": "232700",
                        "name": "大兴安岭地区"
                    },
                    {
                        "id": 11856,
                        "code": "232701",
                        "name": "漠河县"
                    },
                    {
                        "id": 11854,
                        "code": "232721",
                        "name": "呼玛县"
                    },
                    {
                        "id": 11858,
                        "code": "232722",
                        "name": "塔河县"
                    },
                    {
                        "id": 11855,
                        "code": "232761",
                        "name": "加格达奇区"
                    },
                    {
                        "id": 11857,
                        "code": "232762",
                        "name": "松岭区"
                    }
                ]
            }
        ]
    },
    {
        "id": 58,
        "code": "310000",
        "name": "上海",
        "children": [
            {
                "id": 1066,
                "code": "310100",
                "name": "上海",
                "children": [
                    {
                        "id": 13064,
                        "code": "310101",
                        "name": "黄浦区"
                    },
                    {
                        "id": 13073,
                        "code": "310104",
                        "name": "徐汇区"
                    },
                    {
                        "id": 13060,
                        "code": "310105",
                        "name": "长宁区"
                    },
                    {
                        "id": 13067,
                        "code": "310106",
                        "name": "静安区"
                    },
                    {
                        "id": 13070,
                        "code": "310107",
                        "name": "普陀区"
                    },
                    {
                        "id": 13063,
                        "code": "310109",
                        "name": "虹口区"
                    },
                    {
                        "id": 13074,
                        "code": "310110",
                        "name": "杨浦区"
                    },
                    {
                        "id": 13068,
                        "code": "310112",
                        "name": "闵行区"
                    },
                    {
                        "id": 13859,
                        "code": "310113",
                        "name": "宝山区"
                    },
                    {
                        "id": 13065,
                        "code": "310114",
                        "name": "嘉定区"
                    },
                    {
                        "id": 13069,
                        "code": "310115",
                        "name": "浦东新区"
                    },
                    {
                        "id": 13066,
                        "code": "310116",
                        "name": "金山区"
                    },
                    {
                        "id": 13072,
                        "code": "310117",
                        "name": "松江区"
                    },
                    {
                        "id": 13071,
                        "code": "310118",
                        "name": "青浦区"
                    },
                    {
                        "id": 13062,
                        "code": "310120",
                        "name": "奉贤区"
                    },
                    {
                        "id": 13061,
                        "code": "310151",
                        "name": "崇明县"
                    }
                ]
            }
        ]
    },
    {
        "id": 50,
        "code": "320000",
        "name": "江苏",
        "children": [
            {
                "id": 969,
                "code": "320100",
                "name": "南京",
                "children": [
                    {
                        "id": 12275,
                        "code": "320102",
                        "name": "玄武区"
                    },
                    {
                        "id": 12274,
                        "code": "320104",
                        "name": "秦淮区"
                    },
                    {
                        "id": 12268,
                        "code": "320105",
                        "name": "建邺区"
                    },
                    {
                        "id": 13845,
                        "code": "320106",
                        "name": "鼓楼区"
                    },
                    {
                        "id": 12272,
                        "code": "320111",
                        "name": "浦口区"
                    },
                    {
                        "id": 12273,
                        "code": "320113",
                        "name": "栖霞区"
                    },
                    {
                        "id": 12276,
                        "code": "320114",
                        "name": "雨花台区"
                    },
                    {
                        "id": 12269,
                        "code": "320115",
                        "name": "江宁区"
                    },
                    {
                        "id": 12271,
                        "code": "320116",
                        "name": "六合区"
                    },
                    {
                        "id": 12270,
                        "code": "320117",
                        "name": "溧水县"
                    },
                    {
                        "id": 12267,
                        "code": "320118",
                        "name": "高淳县"
                    }
                ]
            },
            {
                "id": 973,
                "code": "320200",
                "name": "无锡",
                "children": [
                    {
                        "id": 12304,
                        "code": "320205",
                        "name": "锡山区"
                    },
                    {
                        "id": 12301,
                        "code": "320206",
                        "name": "惠山区"
                    },
                    {
                        "id": 12300,
                        "code": "320211",
                        "name": "滨湖区"
                    },
                    {
                        "id": 12303,
                        "code": "320213",
                        "name": "梁溪区"
                    },
                    {
                        "id": 12305,
                        "code": "320214",
                        "name": "新吴区"
                    },
                    {
                        "id": 12302,
                        "code": "320281",
                        "name": "江阴市"
                    },
                    {
                        "id": 12306,
                        "code": "320282",
                        "name": "宜兴市"
                    }
                ]
            },
            {
                "id": 975,
                "code": "320300",
                "name": "徐州",
                "children": [
                    {
                        "id": 13846,
                        "code": "320302",
                        "name": "鼓楼区"
                    },
                    {
                        "id": 12320,
                        "code": "320303",
                        "name": "云龙区"
                    },
                    {
                        "id": 12313,
                        "code": "320305",
                        "name": "贾汪区"
                    },
                    {
                        "id": 12316,
                        "code": "320311",
                        "name": "泉山区"
                    },
                    {
                        "id": 12318,
                        "code": "320312",
                        "name": "铜山县"
                    },
                    {
                        "id": 12312,
                        "code": "320321",
                        "name": "丰县"
                    },
                    {
                        "id": 12314,
                        "code": "320322",
                        "name": "沛县"
                    },
                    {
                        "id": 12317,
                        "code": "320324",
                        "name": "睢宁县"
                    },
                    {
                        "id": 12319,
                        "code": "320381",
                        "name": "新沂市"
                    },
                    {
                        "id": 12315,
                        "code": "320382",
                        "name": "邳州市"
                    }
                ]
            },
            {
                "id": 966,
                "code": "320400",
                "name": "常州",
                "children": [
                    {
                        "id": 12250,
                        "code": "320402",
                        "name": "天宁区"
                    },
                    {
                        "id": 12253,
                        "code": "320404",
                        "name": "钟楼区"
                    },
                    {
                        "id": 12252,
                        "code": "320411",
                        "name": "新北区"
                    },
                    {
                        "id": 12251,
                        "code": "320412",
                        "name": "武进区"
                    },
                    {
                        "id": 12248,
                        "code": "320413",
                        "name": "金坛区"
                    },
                    {
                        "id": 12249,
                        "code": "320481",
                        "name": "溧阳市"
                    }
                ]
            },
            {
                "id": 971,
                "code": "320500",
                "name": "苏州",
                "children": [
                    {
                        "id": 12286,
                        "code": "320505",
                        "name": "虎丘区"
                    },
                    {
                        "id": 12291,
                        "code": "320506",
                        "name": "吴中区"
                    },
                    {
                        "id": 12292,
                        "code": "320507",
                        "name": "相城区"
                    },
                    {
                        "id": 12285,
                        "code": "320508",
                        "name": "姑苏区"
                    },
                    {
                        "id": 12290,
                        "code": "320509",
                        "name": "吴江市"
                    },
                    {
                        "id": 12288,
                        "code": "320571",
                        "name": "苏州工业园区"
                    },
                    {
                        "id": 12284,
                        "code": "320581",
                        "name": "常熟市"
                    },
                    {
                        "id": 12293,
                        "code": "320582",
                        "name": "张家港市"
                    },
                    {
                        "id": 12287,
                        "code": "320583",
                        "name": "昆山市"
                    },
                    {
                        "id": 12289,
                        "code": "320585",
                        "name": "太仓市"
                    }
                ]
            },
            {
                "id": 970,
                "code": "320600",
                "name": "南通",
                "children": [
                    {
                        "id": 12277,
                        "code": "320602",
                        "name": "崇川区"
                    },
                    {
                        "id": 12283,
                        "code": "320612",
                        "name": "通州市"
                    },
                    {
                        "id": 12281,
                        "code": "320623",
                        "name": "如东县"
                    },
                    {
                        "id": 12280,
                        "code": "320681",
                        "name": "启东市"
                    },
                    {
                        "id": 12282,
                        "code": "320682",
                        "name": "如皋市"
                    },
                    {
                        "id": 12279,
                        "code": "320684",
                        "name": "海门市"
                    },
                    {
                        "id": 12278,
                        "code": "320685",
                        "name": "海安县"
                    }
                ]
            },
            {
                "id": 968,
                "code": "320700",
                "name": "连云港",
                "children": [
                    {
                        "id": 12266,
                        "code": "320703",
                        "name": "连云区"
                    },
                    {
                        "id": 12265,
                        "code": "320706",
                        "name": "海州区"
                    },
                    {
                        "id": 12262,
                        "code": "320707",
                        "name": "赣榆县"
                    },
                    {
                        "id": 12261,
                        "code": "320722",
                        "name": "东海县"
                    },
                    {
                        "id": 12264,
                        "code": "320723",
                        "name": "灌云县"
                    },
                    {
                        "id": 12263,
                        "code": "320724",
                        "name": "灌南县"
                    }
                ]
            },
            {
                "id": 967,
                "code": "320800",
                "name": "淮安",
                "children": [
                    {
                        "id": 12255,
                        "code": "320803",
                        "name": "淮安区"
                    },
                    {
                        "id": 12256,
                        "code": "320804",
                        "name": "淮阴区"
                    },
                    {
                        "id": 12259,
                        "code": "320812",
                        "name": "清江浦区"
                    },
                    {
                        "id": 12254,
                        "code": "320813",
                        "name": "洪泽县"
                    },
                    {
                        "id": 12258,
                        "code": "320826",
                        "name": "涟水县"
                    },
                    {
                        "id": 12260,
                        "code": "320830",
                        "name": "盱眙县"
                    },
                    {
                        "id": 12257,
                        "code": "320831",
                        "name": "金湖县"
                    }
                ]
            },
            {
                "id": 976,
                "code": "320900",
                "name": "盐城",
                "children": [
                    {
                        "id": 12327,
                        "code": "320902",
                        "name": "亭湖区"
                    },
                    {
                        "id": 12329,
                        "code": "320903",
                        "name": "盐都区"
                    },
                    {
                        "id": 12322,
                        "code": "320904",
                        "name": "大丰市"
                    },
                    {
                        "id": 12328,
                        "code": "320921",
                        "name": "响水县"
                    },
                    {
                        "id": 12321,
                        "code": "320922",
                        "name": "滨海县"
                    },
                    {
                        "id": 12324,
                        "code": "320923",
                        "name": "阜宁县"
                    },
                    {
                        "id": 12326,
                        "code": "320924",
                        "name": "射阳县"
                    },
                    {
                        "id": 12325,
                        "code": "320925",
                        "name": "建湖县"
                    },
                    {
                        "id": 12323,
                        "code": "320981",
                        "name": "东台市"
                    }
                ]
            },
            {
                "id": 977,
                "code": "321000",
                "name": "扬州",
                "children": [
                    {
                        "id": 12332,
                        "code": "321002",
                        "name": "广陵区"
                    },
                    {
                        "id": 12333,
                        "code": "321003",
                        "name": "邗江区"
                    },
                    {
                        "id": 12334,
                        "code": "321012",
                        "name": "江都市"
                    },
                    {
                        "id": 12330,
                        "code": "321023",
                        "name": "宝应县"
                    },
                    {
                        "id": 12335,
                        "code": "321081",
                        "name": "仪征市"
                    },
                    {
                        "id": 12331,
                        "code": "321084",
                        "name": "高邮市"
                    }
                ]
            },
            {
                "id": 978,
                "code": "321100",
                "name": "镇江",
                "children": [
                    {
                        "id": 12338,
                        "code": "321102",
                        "name": "京口区"
                    },
                    {
                        "id": 12340,
                        "code": "321111",
                        "name": "润州区"
                    },
                    {
                        "id": 12336,
                        "code": "321112",
                        "name": "丹徒区"
                    },
                    {
                        "id": 12337,
                        "code": "321181",
                        "name": "丹阳市"
                    },
                    {
                        "id": 12341,
                        "code": "321182",
                        "name": "扬中市"
                    },
                    {
                        "id": 12339,
                        "code": "321183",
                        "name": "句容市"
                    }
                ]
            },
            {
                "id": 972,
                "code": "321200",
                "name": "泰州",
                "children": [
                    {
                        "id": 12295,
                        "code": "321202",
                        "name": "海陵区"
                    },
                    {
                        "id": 12294,
                        "code": "321203",
                        "name": "高港区"
                    },
                    {
                        "id": 12296,
                        "code": "321204",
                        "name": "姜堰市"
                    },
                    {
                        "id": 12299,
                        "code": "321281",
                        "name": "兴化市"
                    },
                    {
                        "id": 12297,
                        "code": "321282",
                        "name": "靖江市"
                    },
                    {
                        "id": 12298,
                        "code": "321283",
                        "name": "泰兴市"
                    }
                ]
            },
            {
                "id": 974,
                "code": "321300",
                "name": "宿迁",
                "children": [
                    {
                        "id": 12310,
                        "code": "321302",
                        "name": "宿城区"
                    },
                    {
                        "id": 12311,
                        "code": "321311",
                        "name": "宿豫区"
                    },
                    {
                        "id": 12307,
                        "code": "321322",
                        "name": "沭阳县"
                    },
                    {
                        "id": 12309,
                        "code": "321323",
                        "name": "泗阳县"
                    },
                    {
                        "id": 12308,
                        "code": "321324",
                        "name": "泗洪县"
                    }
                ]
            }
        ]
    },
    {
        "id": 68,
        "code": "330000",
        "name": "浙江",
        "children": [
            {
                "id": 1157,
                "code": "330100",
                "name": "杭州",
                "children": [
                    {
                        "id": 13753,
                        "code": "330102",
                        "name": "上城区"
                    },
                    {
                        "id": 13755,
                        "code": "330103",
                        "name": "下城区"
                    },
                    {
                        "id": 13751,
                        "code": "330104",
                        "name": "江干区"
                    },
                    {
                        "id": 13749,
                        "code": "330105",
                        "name": "拱墅区"
                    },
                    {
                        "id": 13887,
                        "code": "330106",
                        "name": "西湖区"
                    },
                    {
                        "id": 13746,
                        "code": "330108",
                        "name": "滨江区"
                    },
                    {
                        "id": 13756,
                        "code": "330109",
                        "name": "萧山区"
                    },
                    {
                        "id": 13757,
                        "code": "330110",
                        "name": "余杭区"
                    },
                    {
                        "id": 13748,
                        "code": "330111",
                        "name": "富阳市"
                    },
                    {
                        "id": 13752,
                        "code": "330112",
                        "name": "临安市"
                    },
                    {
                        "id": 13754,
                        "code": "330122",
                        "name": "桐庐县"
                    },
                    {
                        "id": 13747,
                        "code": "330127",
                        "name": "淳安县"
                    },
                    {
                        "id": 13750,
                        "code": "330182",
                        "name": "建德市"
                    }
                ]
            },
            {
                "id": 1162,
                "code": "330200",
                "name": "宁波",
                "children": [
                    {
                        "id": 13791,
                        "code": "330203",
                        "name": "海曙区"
                    },
                    {
                        "id": 13792,
                        "code": "330205",
                        "name": "江北区"
                    },
                    {
                        "id": 13788,
                        "code": "330206",
                        "name": "北仑区"
                    },
                    {
                        "id": 13797,
                        "code": "330211",
                        "name": "镇海区"
                    },
                    {
                        "id": 13795,
                        "code": "330212",
                        "name": "鄞州区"
                    },
                    {
                        "id": 13790,
                        "code": "330213",
                        "name": "奉化市"
                    },
                    {
                        "id": 13794,
                        "code": "330225",
                        "name": "象山县"
                    },
                    {
                        "id": 13793,
                        "code": "330226",
                        "name": "宁海县"
                    },
                    {
                        "id": 13796,
                        "code": "330281",
                        "name": "余姚市"
                    },
                    {
                        "id": 13789,
                        "code": "330282",
                        "name": "慈溪市"
                    }
                ]
            },
            {
                "id": 1166,
                "code": "330300",
                "name": "温州",
                "children": [
                    {
                        "id": 13824,
                        "code": "330302",
                        "name": "鹿城区"
                    },
                    {
                        "id": 13823,
                        "code": "330303",
                        "name": "龙湾区"
                    },
                    {
                        "id": 13825,
                        "code": "330304",
                        "name": "瓯海区"
                    },
                    {
                        "id": 13820,
                        "code": "330305",
                        "name": "洞头县"
                    },
                    {
                        "id": 13830,
                        "code": "330324",
                        "name": "永嘉县"
                    },
                    {
                        "id": 13826,
                        "code": "330326",
                        "name": "平阳县"
                    },
                    {
                        "id": 13819,
                        "code": "330327",
                        "name": "苍南县"
                    },
                    {
                        "id": 13829,
                        "code": "330328",
                        "name": "文成县"
                    },
                    {
                        "id": 13828,
                        "code": "330329",
                        "name": "泰顺县"
                    },
                    {
                        "id": 13827,
                        "code": "330381",
                        "name": "瑞安市"
                    },
                    {
                        "id": 13821,
                        "code": "330382",
                        "name": "乐清市"
                    },
                    {
                        "id": 13822,
                        "code": "330383",
                        "name": "龙港市"
                    }
                ]
            },
            {
                "id": 1159,
                "code": "330400",
                "name": "嘉兴",
                "children": [
                    {
                        "id": 13766,
                        "code": "330402",
                        "name": "南湖区"
                    },
                    {
                        "id": 13769,
                        "code": "330411",
                        "name": "秀洲区"
                    },
                    {
                        "id": 13765,
                        "code": "330421",
                        "name": "嘉善县"
                    },
                    {
                        "id": 13764,
                        "code": "330424",
                        "name": "海盐县"
                    },
                    {
                        "id": 13763,
                        "code": "330481",
                        "name": "海宁市"
                    },
                    {
                        "id": 13767,
                        "code": "330482",
                        "name": "平湖市"
                    },
                    {
                        "id": 13768,
                        "code": "330483",
                        "name": "桐乡市"
                    }
                ]
            },
            {
                "id": 1158,
                "code": "330500",
                "name": "湖州",
                "children": [
                    {
                        "id": 13762,
                        "code": "330502",
                        "name": "吴兴区"
                    },
                    {
                        "id": 13761,
                        "code": "330503",
                        "name": "南浔区"
                    },
                    {
                        "id": 13760,
                        "code": "330521",
                        "name": "德清县"
                    },
                    {
                        "id": 13759,
                        "code": "330522",
                        "name": "长兴县"
                    },
                    {
                        "id": 13758,
                        "code": "330523",
                        "name": "安吉县"
                    }
                ]
            },
            {
                "id": 1164,
                "code": "330600",
                "name": "绍兴",
                "children": [
                    {
                        "id": 13808,
                        "code": "330602",
                        "name": "越城区"
                    },
                    {
                        "id": 13804,
                        "code": "330603",
                        "name": "柯桥区"
                    },
                    {
                        "id": 13805,
                        "code": "330604",
                        "name": "上虞市"
                    },
                    {
                        "id": 13807,
                        "code": "330624",
                        "name": "新昌县"
                    },
                    {
                        "id": 13809,
                        "code": "330681",
                        "name": "诸暨市"
                    },
                    {
                        "id": 13806,
                        "code": "330683",
                        "name": "嵊州市"
                    }
                ]
            },
            {
                "id": 1160,
                "code": "330700",
                "name": "金华",
                "children": [
                    {
                        "id": 13776,
                        "code": "330702",
                        "name": "婺城区"
                    },
                    {
                        "id": 13771,
                        "code": "330703",
                        "name": "金东区"
                    },
                    {
                        "id": 13775,
                        "code": "330723",
                        "name": "武义县"
                    },
                    {
                        "id": 13774,
                        "code": "330726",
                        "name": "浦江县"
                    },
                    {
                        "id": 13773,
                        "code": "330727",
                        "name": "磐安县"
                    },
                    {
                        "id": 13772,
                        "code": "330781",
                        "name": "兰溪市"
                    },
                    {
                        "id": 13777,
                        "code": "330782",
                        "name": "义乌市"
                    },
                    {
                        "id": 13770,
                        "code": "330783",
                        "name": "东阳市"
                    },
                    {
                        "id": 13778,
                        "code": "330784",
                        "name": "永康市"
                    }
                ]
            },
            {
                "id": 1163,
                "code": "330800",
                "name": "衢州",
                "children": [
                    {
                        "id": 13801,
                        "code": "330802",
                        "name": "柯城区"
                    },
                    {
                        "id": 13803,
                        "code": "330803",
                        "name": "衢江区"
                    },
                    {
                        "id": 13798,
                        "code": "330822",
                        "name": "常山县"
                    },
                    {
                        "id": 13800,
                        "code": "330824",
                        "name": "开化县"
                    },
                    {
                        "id": 13802,
                        "code": "330825",
                        "name": "龙游县"
                    },
                    {
                        "id": 13799,
                        "code": "330881",
                        "name": "江山市"
                    }
                ]
            },
            {
                "id": 1167,
                "code": "330900",
                "name": "舟山",
                "children": [
                    {
                        "id": 13832,
                        "code": "330902",
                        "name": "定海区"
                    },
                    {
                        "id": 13888,
                        "code": "330903",
                        "name": "普陀区"
                    },
                    {
                        "id": 13831,
                        "code": "330921",
                        "name": "岱山县"
                    },
                    {
                        "id": 13833,
                        "code": "330922",
                        "name": "嵊泗县"
                    }
                ]
            },
            {
                "id": 1165,
                "code": "331000",
                "name": "台州",
                "children": [
                    {
                        "id": 13811,
                        "code": "331002",
                        "name": "椒江区"
                    },
                    {
                        "id": 13810,
                        "code": "331003",
                        "name": "黄岩区"
                    },
                    {
                        "id": 13813,
                        "code": "331004",
                        "name": "路桥区"
                    },
                    {
                        "id": 13814,
                        "code": "331022",
                        "name": "三门县"
                    },
                    {
                        "id": 13815,
                        "code": "331023",
                        "name": "天台县"
                    },
                    {
                        "id": 13817,
                        "code": "331024",
                        "name": "仙居县"
                    },
                    {
                        "id": 13816,
                        "code": "331081",
                        "name": "温岭市"
                    },
                    {
                        "id": 13812,
                        "code": "331082",
                        "name": "临海市"
                    },
                    {
                        "id": 13818,
                        "code": "331083",
                        "name": "玉环县"
                    }
                ]
            },
            {
                "id": 1161,
                "code": "331100",
                "name": "丽水",
                "children": [
                    {
                        "id": 13781,
                        "code": "331102",
                        "name": "莲都区"
                    },
                    {
                        "id": 13783,
                        "code": "331121",
                        "name": "青田县"
                    },
                    {
                        "id": 13779,
                        "code": "331122",
                        "name": "缙云县"
                    },
                    {
                        "id": 13786,
                        "code": "331123",
                        "name": "遂昌县"
                    },
                    {
                        "id": 13785,
                        "code": "331124",
                        "name": "松阳县"
                    },
                    {
                        "id": 13787,
                        "code": "331125",
                        "name": "云和县"
                    },
                    {
                        "id": 13784,
                        "code": "331126",
                        "name": "庆元县"
                    },
                    {
                        "id": 13780,
                        "code": "331127",
                        "name": "景宁畲族自治县"
                    },
                    {
                        "id": 13782,
                        "code": "331181",
                        "name": "龙泉市"
                    }
                ]
            }
        ]
    },
    {
        "id": 35,
        "code": "340000",
        "name": "安徽",
        "children": [
            {
                "id": 785,
                "code": "340100",
                "name": "合肥",
                "children": [
                    {
                        "id": 10887,
                        "code": "340102",
                        "name": "瑶海区"
                    },
                    {
                        "id": 10885,
                        "code": "340103",
                        "name": "庐阳区"
                    },
                    {
                        "id": 10886,
                        "code": "340104",
                        "name": "蜀山区"
                    },
                    {
                        "id": 10879,
                        "code": "340111",
                        "name": "包河区"
                    },
                    {
                        "id": 10881,
                        "code": "340121",
                        "name": "长丰县"
                    },
                    {
                        "id": 10882,
                        "code": "340122",
                        "name": "肥东县"
                    },
                    {
                        "id": 10883,
                        "code": "340123",
                        "name": "肥西县"
                    },
                    {
                        "id": 10884,
                        "code": "340124",
                        "name": "庐江县"
                    },
                    {
                        "id": 10880,
                        "code": "340181",
                        "name": "巢湖市"
                    }
                ]
            },
            {
                "id": 792,
                "code": "340200",
                "name": "芜湖",
                "children": [
                    {
                        "id": 10924,
                        "code": "340202",
                        "name": "镜湖区"
                    },
                    {
                        "id": 10929,
                        "code": "340203",
                        "name": "弋江区"
                    },
                    {
                        "id": 10925,
                        "code": "340207",
                        "name": "鸠江区"
                    },
                    {
                        "id": 10927,
                        "code": "340221",
                        "name": "湾沚区"
                    },
                    {
                        "id": 10923,
                        "code": "340222",
                        "name": "繁昌县"
                    },
                    {
                        "id": 10926,
                        "code": "340223",
                        "name": "南陵县"
                    },
                    {
                        "id": 10928,
                        "code": "340281",
                        "name": "无为市"
                    }
                ]
            },
            {
                "id": 780,
                "code": "340300",
                "name": "蚌埠",
                "children": [
                    {
                        "id": 10852,
                        "code": "340302",
                        "name": "龙子湖区"
                    },
                    {
                        "id": 10848,
                        "code": "340303",
                        "name": "蚌山区"
                    },
                    {
                        "id": 10854,
                        "code": "340304",
                        "name": "禹会区"
                    },
                    {
                        "id": 10851,
                        "code": "340311",
                        "name": "淮上区"
                    },
                    {
                        "id": 10850,
                        "code": "340321",
                        "name": "怀远县"
                    },
                    {
                        "id": 10853,
                        "code": "340322",
                        "name": "五河县"
                    },
                    {
                        "id": 10849,
                        "code": "340323",
                        "name": "固镇县"
                    }
                ]
            },
            {
                "id": 787,
                "code": "340400",
                "name": "淮南",
                "children": [
                    {
                        "id": 10893,
                        "code": "340402",
                        "name": "大通区"
                    },
                    {
                        "id": 10897,
                        "code": "340403",
                        "name": "田家庵区"
                    },
                    {
                        "id": 10898,
                        "code": "340404",
                        "name": "谢家集区"
                    },
                    {
                        "id": 10892,
                        "code": "340405",
                        "name": "八公山区"
                    },
                    {
                        "id": 10895,
                        "code": "340406",
                        "name": "潘集区"
                    },
                    {
                        "id": 10894,
                        "code": "340421",
                        "name": "凤台县"
                    },
                    {
                        "id": 10896,
                        "code": "340422",
                        "name": "寿县"
                    }
                ]
            },
            {
                "id": 790,
                "code": "340500",
                "name": "马鞍山",
                "children": [
                    {
                        "id": 10917,
                        "code": "340503",
                        "name": "花山区"
                    },
                    {
                        "id": 10918,
                        "code": "340504",
                        "name": "雨山区"
                    },
                    {
                        "id": 10913,
                        "code": "340506",
                        "name": "博望区"
                    },
                    {
                        "id": 10914,
                        "code": "340521",
                        "name": "当涂县"
                    },
                    {
                        "id": 10915,
                        "code": "340522",
                        "name": "含山县"
                    },
                    {
                        "id": 10916,
                        "code": "340523",
                        "name": "和县"
                    }
                ]
            },
            {
                "id": 786,
                "code": "340600",
                "name": "淮北",
                "children": [
                    {
                        "id": 10888,
                        "code": "340602",
                        "name": "杜集区"
                    },
                    {
                        "id": 10891,
                        "code": "340603",
                        "name": "相山区"
                    },
                    {
                        "id": 10889,
                        "code": "340604",
                        "name": "烈山区"
                    },
                    {
                        "id": 10890,
                        "code": "340621",
                        "name": "濉溪县"
                    }
                ]
            },
            {
                "id": 791,
                "code": "340700",
                "name": "铜陵",
                "children": [
                    {
                        "id": 10921,
                        "code": "340705",
                        "name": "铜官山区"
                    },
                    {
                        "id": 10922,
                        "code": "340706",
                        "name": "义安区"
                    },
                    {
                        "id": 10920,
                        "code": "340711",
                        "name": "郊区"
                    },
                    {
                        "id": 10919,
                        "code": "340722",
                        "name": "枞阳县"
                    }
                ]
            },
            {
                "id": 779,
                "code": "340800",
                "name": "安庆",
                "children": [
                    {
                        "id": 10846,
                        "code": "340802",
                        "name": "迎江区"
                    },
                    {
                        "id": 10838,
                        "code": "340803",
                        "name": "大观区"
                    },
                    {
                        "id": 10845,
                        "code": "340811",
                        "name": "宜秀区"
                    },
                    {
                        "id": 10839,
                        "code": "340822",
                        "name": "怀宁县"
                    },
                    {
                        "id": 10841,
                        "code": "340825",
                        "name": "太湖县"
                    },
                    {
                        "id": 10844,
                        "code": "340826",
                        "name": "宿松县"
                    },
                    {
                        "id": 10843,
                        "code": "340827",
                        "name": "望江县"
                    },
                    {
                        "id": 10847,
                        "code": "340828",
                        "name": "岳西县"
                    },
                    {
                        "id": 10842,
                        "code": "340881",
                        "name": "桐城市"
                    },
                    {
                        "id": 10840,
                        "code": "340882",
                        "name": "潜山县"
                    }
                ]
            },
            {
                "id": 788,
                "code": "341000",
                "name": "黄山",
                "children": [
                    {
                        "id": 10902,
                        "code": "341002",
                        "name": "屯溪区"
                    },
                    {
                        "id": 10899,
                        "code": "341003",
                        "name": "黄山区"
                    },
                    {
                        "id": 10900,
                        "code": "341004",
                        "name": "徽州区"
                    },
                    {
                        "id": 10903,
                        "code": "341021",
                        "name": "歙县"
                    },
                    {
                        "id": 10904,
                        "code": "341022",
                        "name": "休宁县"
                    },
                    {
                        "id": 10905,
                        "code": "341023",
                        "name": "黟县"
                    },
                    {
                        "id": 10901,
                        "code": "341024",
                        "name": "祁门县"
                    }
                ]
            },
            {
                "id": 783,
                "code": "341100",
                "name": "滁州",
                "children": [
                    {
                        "id": 10866,
                        "code": "341102",
                        "name": "琅琊区"
                    },
                    {
                        "id": 10868,
                        "code": "341103",
                        "name": "南谯区"
                    },
                    {
                        "id": 10865,
                        "code": "341122",
                        "name": "来安县"
                    },
                    {
                        "id": 10869,
                        "code": "341124",
                        "name": "全椒县"
                    },
                    {
                        "id": 10863,
                        "code": "341125",
                        "name": "定远县"
                    },
                    {
                        "id": 10864,
                        "code": "341126",
                        "name": "凤阳县"
                    },
                    {
                        "id": 10870,
                        "code": "341181",
                        "name": "天长市"
                    },
                    {
                        "id": 10867,
                        "code": "341182",
                        "name": "明光市"
                    }
                ]
            },
            {
                "id": 784,
                "code": "341200",
                "name": "阜阳",
                "children": [
                    {
                        "id": 10878,
                        "code": "341202",
                        "name": "颍州区"
                    },
                    {
                        "id": 10875,
                        "code": "341203",
                        "name": "颍东区"
                    },
                    {
                        "id": 10876,
                        "code": "341204",
                        "name": "颍泉区"
                    },
                    {
                        "id": 10873,
                        "code": "341221",
                        "name": "临泉县"
                    },
                    {
                        "id": 10874,
                        "code": "341222",
                        "name": "太和县"
                    },
                    {
                        "id": 10871,
                        "code": "341225",
                        "name": "阜南县"
                    },
                    {
                        "id": 10877,
                        "code": "341226",
                        "name": "颍上县"
                    },
                    {
                        "id": 10872,
                        "code": "341282",
                        "name": "界首市"
                    }
                ]
            },
            {
                "id": 793,
                "code": "341300",
                "name": "宿州",
                "children": [
                    {
                        "id": 10934,
                        "code": "341302",
                        "name": "埇桥区"
                    },
                    {
                        "id": 10930,
                        "code": "341321",
                        "name": "砀山县"
                    },
                    {
                        "id": 10933,
                        "code": "341322",
                        "name": "萧县"
                    },
                    {
                        "id": 10931,
                        "code": "341323",
                        "name": "灵璧县"
                    },
                    {
                        "id": 10932,
                        "code": "341324",
                        "name": "泗县"
                    }
                ]
            },
            {
                "id": 789,
                "code": "341500",
                "name": "六安",
                "children": [
                    {
                        "id": 10908,
                        "code": "341502",
                        "name": "金安区"
                    },
                    {
                        "id": 10912,
                        "code": "341503",
                        "name": "裕安区"
                    },
                    {
                        "id": 10911,
                        "code": "341504",
                        "name": "叶集区"
                    },
                    {
                        "id": 10906,
                        "code": "341522",
                        "name": "霍邱县"
                    },
                    {
                        "id": 10910,
                        "code": "341523",
                        "name": "舒城县"
                    },
                    {
                        "id": 10909,
                        "code": "341524",
                        "name": "金寨县"
                    },
                    {
                        "id": 10907,
                        "code": "341525",
                        "name": "霍山县"
                    }
                ]
            },
            {
                "id": 781,
                "code": "341600",
                "name": "亳州",
                "children": [
                    {
                        "id": 10857,
                        "code": "341602",
                        "name": "谯城区"
                    },
                    {
                        "id": 10858,
                        "code": "341621",
                        "name": "涡阳县"
                    },
                    {
                        "id": 10856,
                        "code": "341622",
                        "name": "蒙城县"
                    },
                    {
                        "id": 10855,
                        "code": "341623",
                        "name": "利辛县"
                    }
                ]
            },
            {
                "id": 782,
                "code": "341700",
                "name": "池州",
                "children": [
                    {
                        "id": 10860,
                        "code": "341702",
                        "name": "贵池区"
                    },
                    {
                        "id": 10859,
                        "code": "341721",
                        "name": "东至县"
                    },
                    {
                        "id": 10862,
                        "code": "341722",
                        "name": "石台县"
                    },
                    {
                        "id": 10861,
                        "code": "341723",
                        "name": "青阳县"
                    }
                ]
            },
            {
                "id": 794,
                "code": "341800",
                "name": "宣城",
                "children": [
                    {
                        "id": 10941,
                        "code": "341802",
                        "name": "宣州区"
                    },
                    {
                        "id": 10939,
                        "code": "341821",
                        "name": "郎溪县"
                    },
                    {
                        "id": 10937,
                        "code": "341823",
                        "name": "泾县"
                    },
                    {
                        "id": 10936,
                        "code": "341824",
                        "name": "绩溪县"
                    },
                    {
                        "id": 10938,
                        "code": "341825",
                        "name": "旌德县"
                    },
                    {
                        "id": 10940,
                        "code": "341881",
                        "name": "宁国市"
                    },
                    {
                        "id": 10935,
                        "code": "341882",
                        "name": "广德县"
                    }
                ]
            }
        ]
    },
    {
        "id": 39,
        "code": "350000",
        "name": "福建",
        "children": [
            {
                "id": 798,
                "code": "350100",
                "name": "福州",
                "children": [
                    {
                        "id": 11007,
                        "code": "350102",
                        "name": "鼓楼区"
                    },
                    {
                        "id": 11015,
                        "code": "350103",
                        "name": "台江区"
                    },
                    {
                        "id": 11005,
                        "code": "350104",
                        "name": "仓山区"
                    },
                    {
                        "id": 11011,
                        "code": "350105",
                        "name": "马尾区"
                    },
                    {
                        "id": 11008,
                        "code": "350111",
                        "name": "晋安区"
                    },
                    {
                        "id": 11004,
                        "code": "350112",
                        "name": "长乐市"
                    },
                    {
                        "id": 11012,
                        "code": "350121",
                        "name": "闽侯县"
                    },
                    {
                        "id": 11009,
                        "code": "350122",
                        "name": "连江县"
                    },
                    {
                        "id": 11010,
                        "code": "350123",
                        "name": "罗源县"
                    },
                    {
                        "id": 11013,
                        "code": "350124",
                        "name": "闽清县"
                    },
                    {
                        "id": 11016,
                        "code": "350125",
                        "name": "永泰县"
                    },
                    {
                        "id": 11014,
                        "code": "350128",
                        "name": "平潭县"
                    },
                    {
                        "id": 11006,
                        "code": "350181",
                        "name": "福清市"
                    }
                ]
            },
            {
                "id": 805,
                "code": "350200",
                "name": "厦门",
                "children": [
                    {
                        "id": 11075,
                        "code": "350203",
                        "name": "思明区"
                    },
                    {
                        "id": 11072,
                        "code": "350205",
                        "name": "海沧区"
                    },
                    {
                        "id": 11073,
                        "code": "350206",
                        "name": "湖里区"
                    },
                    {
                        "id": 11074,
                        "code": "350211",
                        "name": "集美区"
                    },
                    {
                        "id": 11076,
                        "code": "350212",
                        "name": "同安区"
                    },
                    {
                        "id": 11077,
                        "code": "350213",
                        "name": "翔安区"
                    }
                ]
            },
            {
                "id": 802,
                "code": "350300",
                "name": "莆田",
                "children": [
                    {
                        "id": 11043,
                        "code": "350302",
                        "name": "城厢区"
                    },
                    {
                        "id": 11044,
                        "code": "350303",
                        "name": "涵江区"
                    },
                    {
                        "id": 11045,
                        "code": "350304",
                        "name": "荔城区"
                    },
                    {
                        "id": 11047,
                        "code": "350305",
                        "name": "秀屿区"
                    },
                    {
                        "id": 11046,
                        "code": "350322",
                        "name": "仙游县"
                    }
                ]
            },
            {
                "id": 804,
                "code": "350400",
                "name": "三明",
                "children": [
                    {
                        "id": 11063,
                        "code": "350402",
                        "name": "梅列区"
                    },
                    {
                        "id": 11067,
                        "code": "350403",
                        "name": "三元区"
                    },
                    {
                        "id": 11064,
                        "code": "350421",
                        "name": "明溪县"
                    },
                    {
                        "id": 11066,
                        "code": "350423",
                        "name": "清流县"
                    },
                    {
                        "id": 11065,
                        "code": "350424",
                        "name": "宁化县"
                    },
                    {
                        "id": 11060,
                        "code": "350425",
                        "name": "大田县"
                    },
                    {
                        "id": 11071,
                        "code": "350426",
                        "name": "尤溪县"
                    },
                    {
                        "id": 11068,
                        "code": "350427",
                        "name": "沙县"
                    },
                    {
                        "id": 11062,
                        "code": "350428",
                        "name": "将乐县"
                    },
                    {
                        "id": 11069,
                        "code": "350429",
                        "name": "泰宁县"
                    },
                    {
                        "id": 11061,
                        "code": "350430",
                        "name": "建宁县"
                    },
                    {
                        "id": 11070,
                        "code": "350481",
                        "name": "永安市"
                    }
                ]
            },
            {
                "id": 803,
                "code": "350500",
                "name": "泉州",
                "children": [
                    {
                        "id": 11054,
                        "code": "350502",
                        "name": "鲤城区"
                    },
                    {
                        "id": 11050,
                        "code": "350503",
                        "name": "丰泽区"
                    },
                    {
                        "id": 11055,
                        "code": "350504",
                        "name": "洛江区"
                    },
                    {
                        "id": 11057,
                        "code": "350505",
                        "name": "泉港区"
                    },
                    {
                        "id": 11051,
                        "code": "350521",
                        "name": "惠安县"
                    },
                    {
                        "id": 11048,
                        "code": "350524",
                        "name": "安溪县"
                    },
                    {
                        "id": 11059,
                        "code": "350525",
                        "name": "永春县"
                    },
                    {
                        "id": 11049,
                        "code": "350526",
                        "name": "德化县"
                    },
                    {
                        "id": 11052,
                        "code": "350527",
                        "name": "金门县"
                    },
                    {
                        "id": 11058,
                        "code": "350581",
                        "name": "石狮市"
                    },
                    {
                        "id": 11053,
                        "code": "350582",
                        "name": "晋江市"
                    },
                    {
                        "id": 11056,
                        "code": "350583",
                        "name": "南安市"
                    }
                ]
            },
            {
                "id": 806,
                "code": "350600",
                "name": "漳州",
                "children": [
                    {
                        "id": 11084,
                        "code": "350602",
                        "name": "芗城区"
                    },
                    {
                        "id": 11081,
                        "code": "350603",
                        "name": "龙文区"
                    },
                    {
                        "id": 11085,
                        "code": "350622",
                        "name": "云霄县"
                    },
                    {
                        "id": 11086,
                        "code": "350623",
                        "name": "漳浦县"
                    },
                    {
                        "id": 11088,
                        "code": "350624",
                        "name": "诏安县"
                    },
                    {
                        "id": 11087,
                        "code": "350625",
                        "name": "长泰县"
                    },
                    {
                        "id": 11078,
                        "code": "350626",
                        "name": "东山县"
                    },
                    {
                        "id": 11082,
                        "code": "350627",
                        "name": "南靖县"
                    },
                    {
                        "id": 11083,
                        "code": "350628",
                        "name": "平和县"
                    },
                    {
                        "id": 11079,
                        "code": "350629",
                        "name": "华安县"
                    },
                    {
                        "id": 11080,
                        "code": "350681",
                        "name": "龙海市"
                    }
                ]
            },
            {
                "id": 800,
                "code": "350700",
                "name": "南平",
                "children": [
                    {
                        "id": 11032,
                        "code": "350702",
                        "name": "延平区"
                    },
                    {
                        "id": 11026,
                        "code": "350703",
                        "name": "建阳市"
                    },
                    {
                        "id": 11029,
                        "code": "350721",
                        "name": "顺昌县"
                    },
                    {
                        "id": 11027,
                        "code": "350722",
                        "name": "浦城县"
                    },
                    {
                        "id": 11024,
                        "code": "350723",
                        "name": "光泽县"
                    },
                    {
                        "id": 11030,
                        "code": "350724",
                        "name": "松溪县"
                    },
                    {
                        "id": 11033,
                        "code": "350725",
                        "name": "政和县"
                    },
                    {
                        "id": 11028,
                        "code": "350781",
                        "name": "邵武市"
                    },
                    {
                        "id": 11031,
                        "code": "350782",
                        "name": "武夷山市"
                    },
                    {
                        "id": 11025,
                        "code": "350783",
                        "name": "建瓯市"
                    }
                ]
            },
            {
                "id": 799,
                "code": "350800",
                "name": "龙岩",
                "children": [
                    {
                        "id": 11020,
                        "code": "350802",
                        "name": "新罗区"
                    },
                    {
                        "id": 11021,
                        "code": "350803",
                        "name": "永定县"
                    },
                    {
                        "id": 11023,
                        "code": "350821",
                        "name": "长汀县"
                    },
                    {
                        "id": 11018,
                        "code": "350823",
                        "name": "上杭县"
                    },
                    {
                        "id": 11019,
                        "code": "350824",
                        "name": "武平县"
                    },
                    {
                        "id": 11017,
                        "code": "350825",
                        "name": "连城县"
                    },
                    {
                        "id": 11022,
                        "code": "350881",
                        "name": "漳平市"
                    }
                ]
            },
            {
                "id": 801,
                "code": "350900",
                "name": "宁德",
                "children": [
                    {
                        "id": 11037,
                        "code": "350902",
                        "name": "蕉城区"
                    },
                    {
                        "id": 11040,
                        "code": "350921",
                        "name": "霞浦县"
                    },
                    {
                        "id": 11036,
                        "code": "350922",
                        "name": "古田县"
                    },
                    {
                        "id": 11038,
                        "code": "350923",
                        "name": "屏南县"
                    },
                    {
                        "id": 11039,
                        "code": "350924",
                        "name": "寿宁县"
                    },
                    {
                        "id": 11042,
                        "code": "350925",
                        "name": "周宁县"
                    },
                    {
                        "id": 11041,
                        "code": "350926",
                        "name": "柘荣县"
                    },
                    {
                        "id": 11034,
                        "code": "350981",
                        "name": "福安市"
                    },
                    {
                        "id": 11035,
                        "code": "350982",
                        "name": "福鼎市"
                    }
                ]
            }
        ]
    },
    {
        "id": 51,
        "code": "360000",
        "name": "江西",
        "children": [
            {
                "id": 984,
                "code": "360100",
                "name": "南昌",
                "children": [
                    {
                        "id": 12402,
                        "code": "360102",
                        "name": "东湖区"
                    },
                    {
                        "id": 12408,
                        "code": "360103",
                        "name": "西湖区"
                    },
                    {
                        "id": 12407,
                        "code": "360104",
                        "name": "青云谱区"
                    },
                    {
                        "id": 12406,
                        "code": "360111",
                        "name": "青山湖区"
                    },
                    {
                        "id": 12409,
                        "code": "360112",
                        "name": "新建县"
                    },
                    {
                        "id": 12403,
                        "code": "360113",
                        "name": "红谷滩区"
                    },
                    {
                        "id": 12405,
                        "code": "360121",
                        "name": "南昌县"
                    },
                    {
                        "id": 12401,
                        "code": "360123",
                        "name": "安义县"
                    },
                    {
                        "id": 12404,
                        "code": "360124",
                        "name": "进贤县"
                    }
                ]
            },
            {
                "id": 982,
                "code": "360200",
                "name": "景德镇",
                "children": [
                    {
                        "id": 12384,
                        "code": "360202",
                        "name": "昌江区"
                    },
                    {
                        "id": 12387,
                        "code": "360203",
                        "name": "珠山区"
                    },
                    {
                        "id": 12385,
                        "code": "360222",
                        "name": "浮梁县"
                    },
                    {
                        "id": 12386,
                        "code": "360281",
                        "name": "乐平市"
                    }
                ]
            },
            {
                "id": 985,
                "code": "360300",
                "name": "萍乡",
                "children": [
                    {
                        "id": 12410,
                        "code": "360302",
                        "name": "安源区"
                    },
                    {
                        "id": 12414,
                        "code": "360313",
                        "name": "湘东区"
                    },
                    {
                        "id": 12411,
                        "code": "360321",
                        "name": "莲花县"
                    },
                    {
                        "id": 12413,
                        "code": "360322",
                        "name": "上栗县"
                    },
                    {
                        "id": 12412,
                        "code": "360323",
                        "name": "芦溪县"
                    }
                ]
            },
            {
                "id": 983,
                "code": "360400",
                "name": "九江",
                "children": [
                    {
                        "id": 12393,
                        "code": "360402",
                        "name": "濂溪区"
                    },
                    {
                        "id": 12399,
                        "code": "360403",
                        "name": "浔阳区"
                    },
                    {
                        "id": 12388,
                        "code": "360404",
                        "name": "柴桑区"
                    },
                    {
                        "id": 12397,
                        "code": "360423",
                        "name": "武宁县"
                    },
                    {
                        "id": 12398,
                        "code": "360424",
                        "name": "修水县"
                    },
                    {
                        "id": 12400,
                        "code": "360425",
                        "name": "永修县"
                    },
                    {
                        "id": 12389,
                        "code": "360426",
                        "name": "德安县"
                    },
                    {
                        "id": 12390,
                        "code": "360428",
                        "name": "都昌县"
                    },
                    {
                        "id": 12392,
                        "code": "360429",
                        "name": "湖口县"
                    },
                    {
                        "id": 12395,
                        "code": "360430",
                        "name": "彭泽县"
                    },
                    {
                        "id": 12396,
                        "code": "360481",
                        "name": "瑞昌市"
                    },
                    {
                        "id": 12391,
                        "code": "360482",
                        "name": "共青城市"
                    },
                    {
                        "id": 12394,
                        "code": "360483",
                        "name": "庐山市"
                    }
                ]
            },
            {
                "id": 987,
                "code": "360500",
                "name": "新余",
                "children": [
                    {
                        "id": 12428,
                        "code": "360502",
                        "name": "渝水区"
                    },
                    {
                        "id": 12427,
                        "code": "360521",
                        "name": "分宜县"
                    }
                ]
            },
            {
                "id": 989,
                "code": "360600",
                "name": "鹰潭",
                "children": [
                    {
                        "id": 12441,
                        "code": "360602",
                        "name": "月湖区"
                    },
                    {
                        "id": 12440,
                        "code": "360603",
                        "name": "余江县"
                    },
                    {
                        "id": 12439,
                        "code": "360681",
                        "name": "贵溪市"
                    }
                ]
            },
            {
                "id": 980,
                "code": "360700",
                "name": "赣州",
                "children": [
                    {
                        "id": 12370,
                        "code": "360702",
                        "name": "章贡区"
                    },
                    {
                        "id": 12360,
                        "code": "360703",
                        "name": "南康市"
                    },
                    {
                        "id": 12357,
                        "code": "360704",
                        "name": "赣县"
                    },
                    {
                        "id": 12366,
                        "code": "360722",
                        "name": "信丰县"
                    },
                    {
                        "id": 12355,
                        "code": "360723",
                        "name": "大余县"
                    },
                    {
                        "id": 12364,
                        "code": "360724",
                        "name": "上犹县"
                    },
                    {
                        "id": 12354,
                        "code": "360725",
                        "name": "崇义县"
                    },
                    {
                        "id": 12353,
                        "code": "360726",
                        "name": "安远县"
                    },
                    {
                        "id": 12356,
                        "code": "360728",
                        "name": "定南县"
                    },
                    {
                        "id": 12362,
                        "code": "360729",
                        "name": "全南县"
                    },
                    {
                        "id": 12361,
                        "code": "360730",
                        "name": "宁都县"
                    },
                    {
                        "id": 12369,
                        "code": "360731",
                        "name": "于都县"
                    },
                    {
                        "id": 12367,
                        "code": "360732",
                        "name": "兴国县"
                    },
                    {
                        "id": 12358,
                        "code": "360733",
                        "name": "会昌县"
                    },
                    {
                        "id": 12368,
                        "code": "360734",
                        "name": "寻乌县"
                    },
                    {
                        "id": 12365,
                        "code": "360735",
                        "name": "石城县"
                    },
                    {
                        "id": 12363,
                        "code": "360781",
                        "name": "瑞金市"
                    },
                    {
                        "id": 12359,
                        "code": "360783",
                        "name": "龙南县"
                    }
                ]
            },
            {
                "id": 981,
                "code": "360800",
                "name": "吉安",
                "children": [
                    {
                        "id": 12374,
                        "code": "360802",
                        "name": "吉州区"
                    },
                    {
                        "id": 12376,
                        "code": "360803",
                        "name": "青原区"
                    },
                    {
                        "id": 12372,
                        "code": "360821",
                        "name": "吉安县"
                    },
                    {
                        "id": 12373,
                        "code": "360822",
                        "name": "吉水县"
                    },
                    {
                        "id": 12380,
                        "code": "360823",
                        "name": "峡江县"
                    },
                    {
                        "id": 12381,
                        "code": "360824",
                        "name": "新干县"
                    },
                    {
                        "id": 12382,
                        "code": "360825",
                        "name": "永丰县"
                    },
                    {
                        "id": 12378,
                        "code": "360826",
                        "name": "泰和县"
                    },
                    {
                        "id": 12377,
                        "code": "360827",
                        "name": "遂川县"
                    },
                    {
                        "id": 12379,
                        "code": "360828",
                        "name": "万安县"
                    },
                    {
                        "id": 12371,
                        "code": "360829",
                        "name": "安福县"
                    },
                    {
                        "id": 12383,
                        "code": "360830",
                        "name": "永新县"
                    },
                    {
                        "id": 12375,
                        "code": "360881",
                        "name": "井冈山市"
                    }
                ]
            },
            {
                "id": 988,
                "code": "360900",
                "name": "宜春",
                "children": [
                    {
                        "id": 12437,
                        "code": "360902",
                        "name": "袁州区"
                    },
                    {
                        "id": 12430,
                        "code": "360921",
                        "name": "奉新县"
                    },
                    {
                        "id": 12435,
                        "code": "360922",
                        "name": "万载县"
                    },
                    {
                        "id": 12433,
                        "code": "360923",
                        "name": "上高县"
                    },
                    {
                        "id": 12436,
                        "code": "360924",
                        "name": "宜丰县"
                    },
                    {
                        "id": 12432,
                        "code": "360925",
                        "name": "靖安县"
                    },
                    {
                        "id": 12434,
                        "code": "360926",
                        "name": "铜鼓县"
                    },
                    {
                        "id": 12429,
                        "code": "360981",
                        "name": "丰城市"
                    },
                    {
                        "id": 12438,
                        "code": "360982",
                        "name": "樟树市"
                    },
                    {
                        "id": 12431,
                        "code": "360983",
                        "name": "高安市"
                    }
                ]
            },
            {
                "id": 979,
                "code": "361000",
                "name": "抚州",
                "children": [
                    {
                        "id": 12348,
                        "code": "361002",
                        "name": "临川区"
                    },
                    {
                        "id": 12343,
                        "code": "361003",
                        "name": "东乡县"
                    },
                    {
                        "id": 12349,
                        "code": "361021",
                        "name": "南城县"
                    },
                    {
                        "id": 12347,
                        "code": "361022",
                        "name": "黎川县"
                    },
                    {
                        "id": 12350,
                        "code": "361023",
                        "name": "南丰县"
                    },
                    {
                        "id": 12342,
                        "code": "361024",
                        "name": "崇仁县"
                    },
                    {
                        "id": 12346,
                        "code": "361025",
                        "name": "乐安县"
                    },
                    {
                        "id": 12351,
                        "code": "361026",
                        "name": "宜黄县"
                    },
                    {
                        "id": 12345,
                        "code": "361027",
                        "name": "金溪县"
                    },
                    {
                        "id": 12352,
                        "code": "361028",
                        "name": "资溪县"
                    },
                    {
                        "id": 12344,
                        "code": "361030",
                        "name": "广昌县"
                    }
                ]
            },
            {
                "id": 986,
                "code": "361100",
                "name": "上饶",
                "children": [
                    {
                        "id": 12423,
                        "code": "361102",
                        "name": "信州区"
                    },
                    {
                        "id": 12416,
                        "code": "361103",
                        "name": "广丰县"
                    },
                    {
                        "id": 12417,
                        "code": "361104",
                        "name": "广信区"
                    },
                    {
                        "id": 12426,
                        "code": "361123",
                        "name": "玉山县"
                    },
                    {
                        "id": 12420,
                        "code": "361124",
                        "name": "铅山县"
                    },
                    {
                        "id": 12418,
                        "code": "361125",
                        "name": "横峰县"
                    },
                    {
                        "id": 12424,
                        "code": "361126",
                        "name": "弋阳县"
                    },
                    {
                        "id": 12425,
                        "code": "361127",
                        "name": "余干县"
                    },
                    {
                        "id": 12419,
                        "code": "361128",
                        "name": "鄱阳县"
                    },
                    {
                        "id": 12421,
                        "code": "361129",
                        "name": "万年县"
                    },
                    {
                        "id": 12422,
                        "code": "361130",
                        "name": "婺源县"
                    },
                    {
                        "id": 12415,
                        "code": "361181",
                        "name": "德兴市"
                    }
                ]
            }
        ]
    },
    {
        "id": 57,
        "code": "370000",
        "name": "山东",
        "children": [
            {
                "id": 1033,
                "code": "370100",
                "name": "济南",
                "children": [
                    {
                        "id": 12743,
                        "code": "370102",
                        "name": "历下区"
                    },
                    {
                        "id": 12746,
                        "code": "370103",
                        "name": "市中区"
                    },
                    {
                        "id": 12739,
                        "code": "370104",
                        "name": "槐荫区"
                    },
                    {
                        "id": 12747,
                        "code": "370105",
                        "name": "天桥区"
                    },
                    {
                        "id": 12742,
                        "code": "370112",
                        "name": "历城区"
                    },
                    {
                        "id": 12749,
                        "code": "370113",
                        "name": "长清区"
                    },
                    {
                        "id": 12748,
                        "code": "370114",
                        "name": "章丘市"
                    },
                    {
                        "id": 12740,
                        "code": "370115",
                        "name": "济阳县"
                    },
                    {
                        "id": 12741,
                        "code": "370116",
                        "name": "莱芜区"
                    },
                    {
                        "id": 12738,
                        "code": "370117",
                        "name": "钢城区"
                    },
                    {
                        "id": 12744,
                        "code": "370124",
                        "name": "平阴县"
                    },
                    {
                        "id": 12745,
                        "code": "370126",
                        "name": "商河县"
                    }
                ]
            },
            {
                "id": 1037,
                "code": "370200",
                "name": "青岛",
                "children": [
                    {
                        "id": 12790,
                        "code": "370202",
                        "name": "市南区"
                    },
                    {
                        "id": 12789,
                        "code": "370203",
                        "name": "市北区"
                    },
                    {
                        "id": 12782,
                        "code": "370211",
                        "name": "黄岛区"
                    },
                    {
                        "id": 12786,
                        "code": "370212",
                        "name": "崂山区"
                    },
                    {
                        "id": 12787,
                        "code": "370213",
                        "name": "李沧区"
                    },
                    {
                        "id": 12781,
                        "code": "370214",
                        "name": "城阳区"
                    },
                    {
                        "id": 12783,
                        "code": "370215",
                        "name": "即墨市"
                    },
                    {
                        "id": 12784,
                        "code": "370281",
                        "name": "胶州市"
                    },
                    {
                        "id": 12788,
                        "code": "370283",
                        "name": "平度市"
                    },
                    {
                        "id": 12785,
                        "code": "370285",
                        "name": "莱西市"
                    }
                ]
            },
            {
                "id": 1044,
                "code": "370300",
                "name": "淄博",
                "children": [
                    {
                        "id": 12840,
                        "code": "370302",
                        "name": "淄川区"
                    },
                    {
                        "id": 12838,
                        "code": "370303",
                        "name": "张店区"
                    },
                    {
                        "id": 12833,
                        "code": "370304",
                        "name": "博山区"
                    },
                    {
                        "id": 12836,
                        "code": "370305",
                        "name": "临淄区"
                    },
                    {
                        "id": 12839,
                        "code": "370306",
                        "name": "周村区"
                    },
                    {
                        "id": 12835,
                        "code": "370321",
                        "name": "桓台县"
                    },
                    {
                        "id": 12834,
                        "code": "370322",
                        "name": "高青县"
                    },
                    {
                        "id": 12837,
                        "code": "370323",
                        "name": "沂源县"
                    }
                ]
            },
            {
                "id": 1043,
                "code": "370400",
                "name": "枣庄",
                "children": [
                    {
                        "id": 13853,
                        "code": "370402",
                        "name": "市中区"
                    },
                    {
                        "id": 12831,
                        "code": "370403",
                        "name": "薛城区"
                    },
                    {
                        "id": 12832,
                        "code": "370404",
                        "name": "峄城区"
                    },
                    {
                        "id": 12829,
                        "code": "370405",
                        "name": "台儿庄区"
                    },
                    {
                        "id": 12828,
                        "code": "370406",
                        "name": "山亭区"
                    },
                    {
                        "id": 12830,
                        "code": "370481",
                        "name": "滕州市"
                    }
                ]
            },
            {
                "id": 1031,
                "code": "370500",
                "name": "东营",
                "children": [
                    {
                        "id": 12724,
                        "code": "370502",
                        "name": "东营区"
                    },
                    {
                        "id": 12726,
                        "code": "370503",
                        "name": "河口区"
                    },
                    {
                        "id": 12727,
                        "code": "370505",
                        "name": "垦利县"
                    },
                    {
                        "id": 12728,
                        "code": "370522",
                        "name": "利津县"
                    },
                    {
                        "id": 12725,
                        "code": "370523",
                        "name": "广饶县"
                    }
                ]
            },
            {
                "id": 1042,
                "code": "370600",
                "name": "烟台",
                "children": [
                    {
                        "id": 12827,
                        "code": "370602",
                        "name": "芝罘区"
                    },
                    {
                        "id": 12817,
                        "code": "370611",
                        "name": "福山区"
                    },
                    {
                        "id": 12823,
                        "code": "370612",
                        "name": "牟平区"
                    },
                    {
                        "id": 12819,
                        "code": "370613",
                        "name": "莱山区"
                    },
                    {
                        "id": 12824,
                        "code": "370614",
                        "name": "蓬莱市"
                    },
                    {
                        "id": 12822,
                        "code": "370681",
                        "name": "龙口市"
                    },
                    {
                        "id": 12820,
                        "code": "370682",
                        "name": "莱阳市"
                    },
                    {
                        "id": 12821,
                        "code": "370683",
                        "name": "莱州市"
                    },
                    {
                        "id": 12826,
                        "code": "370685",
                        "name": "招远市"
                    },
                    {
                        "id": 12825,
                        "code": "370686",
                        "name": "栖霞市"
                    },
                    {
                        "id": 12818,
                        "code": "370687",
                        "name": "海阳市"
                    }
                ]
            },
            {
                "id": 1041,
                "code": "370700",
                "name": "潍坊",
                "children": [
                    {
                        "id": 12815,
                        "code": "370702",
                        "name": "潍城区"
                    },
                    {
                        "id": 12810,
                        "code": "370703",
                        "name": "寒亭区"
                    },
                    {
                        "id": 12808,
                        "code": "370704",
                        "name": "坊子区"
                    },
                    {
                        "id": 12811,
                        "code": "370705",
                        "name": "奎文区"
                    },
                    {
                        "id": 12812,
                        "code": "370724",
                        "name": "临朐县"
                    },
                    {
                        "id": 12806,
                        "code": "370725",
                        "name": "昌乐县"
                    },
                    {
                        "id": 12813,
                        "code": "370781",
                        "name": "青州市"
                    },
                    {
                        "id": 12816,
                        "code": "370782",
                        "name": "诸城市"
                    },
                    {
                        "id": 12814,
                        "code": "370783",
                        "name": "寿光市"
                    },
                    {
                        "id": 12805,
                        "code": "370784",
                        "name": "安丘市"
                    },
                    {
                        "id": 12809,
                        "code": "370785",
                        "name": "高密市"
                    },
                    {
                        "id": 12807,
                        "code": "370786",
                        "name": "昌邑市"
                    }
                ]
            },
            {
                "id": 1034,
                "code": "370800",
                "name": "济宁",
                "children": [
                    {
                        "id": 12754,
                        "code": "370811",
                        "name": "任城区"
                    },
                    {
                        "id": 12758,
                        "code": "370812",
                        "name": "兖州市"
                    },
                    {
                        "id": 12756,
                        "code": "370826",
                        "name": "微山县"
                    },
                    {
                        "id": 12759,
                        "code": "370827",
                        "name": "鱼台县"
                    },
                    {
                        "id": 12751,
                        "code": "370828",
                        "name": "金乡县"
                    },
                    {
                        "id": 12750,
                        "code": "370829",
                        "name": "嘉祥县"
                    },
                    {
                        "id": 12757,
                        "code": "370830",
                        "name": "汶上县"
                    },
                    {
                        "id": 12755,
                        "code": "370831",
                        "name": "泗水县"
                    },
                    {
                        "id": 12752,
                        "code": "370832",
                        "name": "梁山县"
                    },
                    {
                        "id": 12753,
                        "code": "370881",
                        "name": "曲阜市"
                    },
                    {
                        "id": 12760,
                        "code": "370883",
                        "name": "邹城市"
                    }
                ]
            },
            {
                "id": 1039,
                "code": "370900",
                "name": "泰安",
                "children": [
                    {
                        "id": 12799,
                        "code": "370902",
                        "name": "泰山区"
                    },
                    {
                        "id": 12795,
                        "code": "370911",
                        "name": "岱岳区"
                    },
                    {
                        "id": 12798,
                        "code": "370921",
                        "name": "宁阳县"
                    },
                    {
                        "id": 12796,
                        "code": "370923",
                        "name": "东平县"
                    },
                    {
                        "id": 12800,
                        "code": "370982",
                        "name": "新泰市"
                    },
                    {
                        "id": 12797,
                        "code": "370983",
                        "name": "肥城市"
                    }
                ]
            },
            {
                "id": 1040,
                "code": "371000",
                "name": "威海",
                "children": [
                    {
                        "id": 12801,
                        "code": "371002",
                        "name": "环翠区"
                    },
                    {
                        "id": 12804,
                        "code": "371003",
                        "name": "文登市"
                    },
                    {
                        "id": 12802,
                        "code": "371082",
                        "name": "荣成市"
                    },
                    {
                        "id": 12803,
                        "code": "371083",
                        "name": "乳山市"
                    }
                ]
            },
            {
                "id": 1038,
                "code": "371100",
                "name": "日照",
                "children": [
                    {
                        "id": 12791,
                        "code": "371102",
                        "name": "东港区"
                    },
                    {
                        "id": 12793,
                        "code": "371103",
                        "name": "岚山区"
                    },
                    {
                        "id": 12794,
                        "code": "371121",
                        "name": "五莲县"
                    },
                    {
                        "id": 12792,
                        "code": "371122",
                        "name": "莒县"
                    }
                ]
            },
            {
                "id": 1036,
                "code": "371300",
                "name": "临沂",
                "children": [
                    {
                        "id": 12773,
                        "code": "371302",
                        "name": "兰山区"
                    },
                    {
                        "id": 12775,
                        "code": "371311",
                        "name": "罗庄区"
                    },
                    {
                        "id": 12770,
                        "code": "371312",
                        "name": "河东区"
                    },
                    {
                        "id": 12779,
                        "code": "371321",
                        "name": "沂南县"
                    },
                    {
                        "id": 12778,
                        "code": "371322",
                        "name": "郯城县"
                    },
                    {
                        "id": 12780,
                        "code": "371323",
                        "name": "沂水县"
                    },
                    {
                        "id": 12772,
                        "code": "371324",
                        "name": "兰陵县"
                    },
                    {
                        "id": 12769,
                        "code": "371325",
                        "name": "费县"
                    },
                    {
                        "id": 12777,
                        "code": "371326",
                        "name": "平邑县"
                    },
                    {
                        "id": 12771,
                        "code": "371327",
                        "name": "莒南县"
                    },
                    {
                        "id": 12776,
                        "code": "371328",
                        "name": "蒙阴县"
                    },
                    {
                        "id": 12774,
                        "code": "371329",
                        "name": "临沭县"
                    }
                ]
            },
            {
                "id": 1030,
                "code": "371400",
                "name": "德州",
                "children": [
                    {
                        "id": 12713,
                        "code": "371402",
                        "name": "德城区"
                    },
                    {
                        "id": 12716,
                        "code": "371403",
                        "name": "陵城区"
                    },
                    {
                        "id": 12717,
                        "code": "371422",
                        "name": "宁津县"
                    },
                    {
                        "id": 12720,
                        "code": "371423",
                        "name": "庆云县"
                    },
                    {
                        "id": 12715,
                        "code": "371424",
                        "name": "临邑县"
                    },
                    {
                        "id": 12719,
                        "code": "371425",
                        "name": "齐河县"
                    },
                    {
                        "id": 12718,
                        "code": "371426",
                        "name": "平原县"
                    },
                    {
                        "id": 12722,
                        "code": "371427",
                        "name": "夏津县"
                    },
                    {
                        "id": 12721,
                        "code": "371428",
                        "name": "武城县"
                    },
                    {
                        "id": 12714,
                        "code": "371481",
                        "name": "乐陵市"
                    },
                    {
                        "id": 12723,
                        "code": "371482",
                        "name": "禹城市"
                    }
                ]
            },
            {
                "id": 1035,
                "code": "371500",
                "name": "聊城",
                "children": [
                    {
                        "id": 12763,
                        "code": "371502",
                        "name": "东昌府区"
                    },
                    {
                        "id": 12761,
                        "code": "371503",
                        "name": "茌平县"
                    },
                    {
                        "id": 12768,
                        "code": "371521",
                        "name": "阳谷县"
                    },
                    {
                        "id": 12767,
                        "code": "371522",
                        "name": "莘县"
                    },
                    {
                        "id": 12762,
                        "code": "371524",
                        "name": "东阿县"
                    },
                    {
                        "id": 12765,
                        "code": "371525",
                        "name": "冠县"
                    },
                    {
                        "id": 12764,
                        "code": "371526",
                        "name": "高唐县"
                    },
                    {
                        "id": 12766,
                        "code": "371581",
                        "name": "临清市"
                    }
                ]
            },
            {
                "id": 1029,
                "code": "371600",
                "name": "滨州",
                "children": [
                    {
                        "id": 12706,
                        "code": "371602",
                        "name": "滨城区"
                    },
                    {
                        "id": 12711,
                        "code": "371603",
                        "name": "沾化县"
                    },
                    {
                        "id": 12708,
                        "code": "371621",
                        "name": "惠民县"
                    },
                    {
                        "id": 12710,
                        "code": "371622",
                        "name": "阳信县"
                    },
                    {
                        "id": 12709,
                        "code": "371623",
                        "name": "无棣县"
                    },
                    {
                        "id": 12707,
                        "code": "371625",
                        "name": "博兴县"
                    },
                    {
                        "id": 12712,
                        "code": "371681",
                        "name": "邹平县"
                    }
                ]
            },
            {
                "id": 1032,
                "code": "371700",
                "name": "菏泽",
                "children": [
                    {
                        "id": 12736,
                        "code": "371702",
                        "name": "牡丹区"
                    },
                    {
                        "id": 12732,
                        "code": "371703",
                        "name": "定陶县"
                    },
                    {
                        "id": 12729,
                        "code": "371721",
                        "name": "曹县"
                    },
                    {
                        "id": 12731,
                        "code": "371722",
                        "name": "单县"
                    },
                    {
                        "id": 12730,
                        "code": "371723",
                        "name": "成武县"
                    },
                    {
                        "id": 12734,
                        "code": "371724",
                        "name": "巨野县"
                    },
                    {
                        "id": 12737,
                        "code": "371725",
                        "name": "郓城县"
                    },
                    {
                        "id": 12735,
                        "code": "371726",
                        "name": "鄄城县"
                    },
                    {
                        "id": 12733,
                        "code": "371728",
                        "name": "东明县"
                    }
                ]
            }
        ]
    },
    {
        "id": 47,
        "code": "410000",
        "name": "河南",
        "children": [
            {
                "id": 910,
                "code": "410100",
                "name": "郑州",
                "children": [
                    {
                        "id": 11823,
                        "code": "410102",
                        "name": "中原区"
                    },
                    {
                        "id": 11813,
                        "code": "410103",
                        "name": "二七区"
                    },
                    {
                        "id": 11815,
                        "code": "410104",
                        "name": "管城回族区"
                    },
                    {
                        "id": 11817,
                        "code": "410105",
                        "name": "金水区"
                    },
                    {
                        "id": 11818,
                        "code": "410106",
                        "name": "上街区"
                    },
                    {
                        "id": 11816,
                        "code": "410108",
                        "name": "惠济区"
                    },
                    {
                        "id": 11822,
                        "code": "410122",
                        "name": "中牟县"
                    },
                    {
                        "id": 11814,
                        "code": "410181",
                        "name": "巩义市"
                    },
                    {
                        "id": 11821,
                        "code": "410182",
                        "name": "荥阳市"
                    },
                    {
                        "id": 11819,
                        "code": "410183",
                        "name": "新密市"
                    },
                    {
                        "id": 11820,
                        "code": "410184",
                        "name": "新郑市"
                    },
                    {
                        "id": 11812,
                        "code": "410185",
                        "name": "登封市"
                    }
                ]
            },
            {
                "id": 899,
                "code": "410200",
                "name": "开封",
                "children": [
                    {
                        "id": 11714,
                        "code": "410202",
                        "name": "龙亭区"
                    },
                    {
                        "id": 11716,
                        "code": "410203",
                        "name": "顺河回族区"
                    },
                    {
                        "id": 13838,
                        "code": "410204",
                        "name": "鼓楼区"
                    },
                    {
                        "id": 11720,
                        "code": "410205",
                        "name": "禹王台区"
                    },
                    {
                        "id": 11719,
                        "code": "410212",
                        "name": "祥符区"
                    },
                    {
                        "id": 11715,
                        "code": "410221",
                        "name": "杞县"
                    },
                    {
                        "id": 11717,
                        "code": "410222",
                        "name": "通许县"
                    },
                    {
                        "id": 11718,
                        "code": "410223",
                        "name": "尉氏县"
                    },
                    {
                        "id": 11713,
                        "code": "410225",
                        "name": "兰考县"
                    }
                ]
            },
            {
                "id": 900,
                "code": "410300",
                "name": "洛阳",
                "children": [
                    {
                        "id": 11724,
                        "code": "410302",
                        "name": "老城区"
                    },
                    {
                        "id": 11731,
                        "code": "410303",
                        "name": "西工区"
                    },
                    {
                        "id": 11721,
                        "code": "410304",
                        "name": "瀍河回族区"
                    },
                    {
                        "id": 11723,
                        "code": "410305",
                        "name": "涧西区"
                    },
                    {
                        "id": 11722,
                        "code": "410306",
                        "name": "吉利区"
                    },
                    {
                        "id": 11726,
                        "code": "410311",
                        "name": "洛龙区"
                    },
                    {
                        "id": 11728,
                        "code": "410322",
                        "name": "孟津县"
                    },
                    {
                        "id": 11732,
                        "code": "410323",
                        "name": "新安县"
                    },
                    {
                        "id": 11725,
                        "code": "410324",
                        "name": "栾川县"
                    },
                    {
                        "id": 11730,
                        "code": "410325",
                        "name": "嵩县"
                    },
                    {
                        "id": 11729,
                        "code": "410326",
                        "name": "汝阳县"
                    },
                    {
                        "id": 11735,
                        "code": "410327",
                        "name": "宜阳县"
                    },
                    {
                        "id": 11727,
                        "code": "410328",
                        "name": "洛宁县"
                    },
                    {
                        "id": 11734,
                        "code": "410329",
                        "name": "伊川县"
                    },
                    {
                        "id": 11733,
                        "code": "410381",
                        "name": "偃师市"
                    }
                ]
            },
            {
                "id": 903,
                "code": "410400",
                "name": "平顶山",
                "children": [
                    {
                        "id": 13839,
                        "code": "410402",
                        "name": "新华区"
                    },
                    {
                        "id": 11759,
                        "code": "410403",
                        "name": "卫东区"
                    },
                    {
                        "id": 11758,
                        "code": "410404",
                        "name": "石龙区"
                    },
                    {
                        "id": 11762,
                        "code": "410411",
                        "name": "湛河区"
                    },
                    {
                        "id": 11754,
                        "code": "410421",
                        "name": "宝丰县"
                    },
                    {
                        "id": 11761,
                        "code": "410422",
                        "name": "叶县"
                    },
                    {
                        "id": 11756,
                        "code": "410423",
                        "name": "鲁山县"
                    },
                    {
                        "id": 11755,
                        "code": "410425",
                        "name": "郏县"
                    },
                    {
                        "id": 11760,
                        "code": "410481",
                        "name": "舞钢市"
                    },
                    {
                        "id": 11757,
                        "code": "410482",
                        "name": "汝州市"
                    }
                ]
            },
            {
                "id": 895,
                "code": "410500",
                "name": "安阳",
                "children": [
                    {
                        "id": 11695,
                        "code": "410502",
                        "name": "文峰区"
                    },
                    {
                        "id": 11689,
                        "code": "410503",
                        "name": "北关区"
                    },
                    {
                        "id": 11696,
                        "code": "410505",
                        "name": "殷都区"
                    },
                    {
                        "id": 11692,
                        "code": "410506",
                        "name": "龙安区"
                    },
                    {
                        "id": 11688,
                        "code": "410522",
                        "name": "安阳县"
                    },
                    {
                        "id": 11694,
                        "code": "410523",
                        "name": "汤阴县"
                    },
                    {
                        "id": 11690,
                        "code": "410526",
                        "name": "滑县"
                    },
                    {
                        "id": 11693,
                        "code": "410527",
                        "name": "内黄县"
                    },
                    {
                        "id": 11691,
                        "code": "410581",
                        "name": "林州市"
                    }
                ]
            },
            {
                "id": 896,
                "code": "410600",
                "name": "鹤壁",
                "children": [
                    {
                        "id": 11697,
                        "code": "410602",
                        "name": "鹤山区"
                    },
                    {
                        "id": 11701,
                        "code": "410603",
                        "name": "山城区"
                    },
                    {
                        "id": 11699,
                        "code": "410611",
                        "name": "淇滨区"
                    },
                    {
                        "id": 11698,
                        "code": "410621",
                        "name": "浚县"
                    },
                    {
                        "id": 11700,
                        "code": "410622",
                        "name": "淇县"
                    }
                ]
            },
            {
                "id": 907,
                "code": "410700",
                "name": "新乡",
                "children": [
                    {
                        "id": 11786,
                        "code": "410702",
                        "name": "红旗区"
                    },
                    {
                        "id": 11790,
                        "code": "410703",
                        "name": "卫滨区"
                    },
                    {
                        "id": 11785,
                        "code": "410704",
                        "name": "凤泉区"
                    },
                    {
                        "id": 11789,
                        "code": "410711",
                        "name": "牧野区"
                    },
                    {
                        "id": 11792,
                        "code": "410721",
                        "name": "新乡县"
                    },
                    {
                        "id": 11788,
                        "code": "410724",
                        "name": "获嘉县"
                    },
                    {
                        "id": 11794,
                        "code": "410725",
                        "name": "原阳县"
                    },
                    {
                        "id": 11793,
                        "code": "410726",
                        "name": "延津县"
                    },
                    {
                        "id": 11784,
                        "code": "410727",
                        "name": "封丘县"
                    },
                    {
                        "id": 11791,
                        "code": "410781",
                        "name": "卫辉市"
                    },
                    {
                        "id": 11787,
                        "code": "410782",
                        "name": "辉县市"
                    },
                    {
                        "id": 11795,
                        "code": "410783",
                        "name": "长垣县"
                    }
                ]
            },
            {
                "id": 898,
                "code": "410800",
                "name": "焦作",
                "children": [
                    {
                        "id": 11704,
                        "code": "410802",
                        "name": "解放区"
                    },
                    {
                        "id": 11712,
                        "code": "410803",
                        "name": "中站区"
                    },
                    {
                        "id": 11705,
                        "code": "410804",
                        "name": "马村区"
                    },
                    {
                        "id": 11708,
                        "code": "410811",
                        "name": "山阳区"
                    },
                    {
                        "id": 11711,
                        "code": "410821",
                        "name": "修武县"
                    },
                    {
                        "id": 11703,
                        "code": "410822",
                        "name": "博爱县"
                    },
                    {
                        "id": 11710,
                        "code": "410823",
                        "name": "武陟县"
                    },
                    {
                        "id": 11709,
                        "code": "410825",
                        "name": "温县"
                    },
                    {
                        "id": 11707,
                        "code": "410882",
                        "name": "沁阳市"
                    },
                    {
                        "id": 11706,
                        "code": "410883",
                        "name": "孟州市"
                    }
                ]
            },
            {
                "id": 904,
                "code": "410900",
                "name": "濮阳",
                "children": [
                    {
                        "id": 11764,
                        "code": "410902",
                        "name": "华龙区"
                    },
                    {
                        "id": 11767,
                        "code": "410922",
                        "name": "清丰县"
                    },
                    {
                        "id": 11765,
                        "code": "410923",
                        "name": "南乐县"
                    },
                    {
                        "id": 11763,
                        "code": "410926",
                        "name": "范县"
                    },
                    {
                        "id": 11768,
                        "code": "410927",
                        "name": "台前县"
                    },
                    {
                        "id": 11766,
                        "code": "410928",
                        "name": "濮阳县"
                    }
                ]
            },
            {
                "id": 909,
                "code": "411000",
                "name": "许昌",
                "children": [
                    {
                        "id": 11807,
                        "code": "411002",
                        "name": "魏都区"
                    },
                    {
                        "id": 11806,
                        "code": "411003",
                        "name": "建安区"
                    },
                    {
                        "id": 11809,
                        "code": "411024",
                        "name": "鄢陵县"
                    },
                    {
                        "id": 11808,
                        "code": "411025",
                        "name": "襄城县"
                    },
                    {
                        "id": 11810,
                        "code": "411081",
                        "name": "禹州市"
                    },
                    {
                        "id": 11811,
                        "code": "411082",
                        "name": "长葛市"
                    }
                ]
            },
            {
                "id": 901,
                "code": "411100",
                "name": "漯河",
                "children": [
                    {
                        "id": 11739,
                        "code": "411102",
                        "name": "源汇区"
                    },
                    {
                        "id": 11738,
                        "code": "411103",
                        "name": "郾城区"
                    },
                    {
                        "id": 11740,
                        "code": "411104",
                        "name": "召陵区"
                    },
                    {
                        "id": 11737,
                        "code": "411121",
                        "name": "舞阳县"
                    },
                    {
                        "id": 11736,
                        "code": "411122",
                        "name": "临颍县"
                    }
                ]
            },
            {
                "id": 905,
                "code": "411200",
                "name": "三门峡",
                "children": [
                    {
                        "id": 11769,
                        "code": "411202",
                        "name": "湖滨区"
                    },
                    {
                        "id": 11773,
                        "code": "411203",
                        "name": "陕州区"
                    },
                    {
                        "id": 11772,
                        "code": "411221",
                        "name": "渑池县"
                    },
                    {
                        "id": 11771,
                        "code": "411224",
                        "name": "卢氏县"
                    },
                    {
                        "id": 11774,
                        "code": "411281",
                        "name": "义马市"
                    },
                    {
                        "id": 11770,
                        "code": "411282",
                        "name": "灵宝市"
                    }
                ]
            },
            {
                "id": 902,
                "code": "411300",
                "name": "南阳",
                "children": [
                    {
                        "id": 11748,
                        "code": "411302",
                        "name": "宛城区"
                    },
                    {
                        "id": 11749,
                        "code": "411303",
                        "name": "卧龙区"
                    },
                    {
                        "id": 11743,
                        "code": "411321",
                        "name": "南召县"
                    },
                    {
                        "id": 11742,
                        "code": "411322",
                        "name": "方城县"
                    },
                    {
                        "id": 11750,
                        "code": "411323",
                        "name": "西峡县"
                    },
                    {
                        "id": 11753,
                        "code": "411324",
                        "name": "镇平县"
                    },
                    {
                        "id": 11744,
                        "code": "411325",
                        "name": "内乡县"
                    },
                    {
                        "id": 11751,
                        "code": "411326",
                        "name": "淅川县"
                    },
                    {
                        "id": 11745,
                        "code": "411327",
                        "name": "社旗县"
                    },
                    {
                        "id": 11746,
                        "code": "411328",
                        "name": "唐河县"
                    },
                    {
                        "id": 11752,
                        "code": "411329",
                        "name": "新野县"
                    },
                    {
                        "id": 11747,
                        "code": "411330",
                        "name": "桐柏县"
                    },
                    {
                        "id": 11741,
                        "code": "411381",
                        "name": "邓州市"
                    }
                ]
            },
            {
                "id": 906,
                "code": "411400",
                "name": "商丘",
                "children": [
                    {
                        "id": 11775,
                        "code": "411402",
                        "name": "梁园区"
                    },
                    {
                        "id": 11779,
                        "code": "411403",
                        "name": "睢阳区"
                    },
                    {
                        "id": 11776,
                        "code": "411421",
                        "name": "民权县"
                    },
                    {
                        "id": 11778,
                        "code": "411422",
                        "name": "睢县"
                    },
                    {
                        "id": 11777,
                        "code": "411423",
                        "name": "宁陵县"
                    },
                    {
                        "id": 11783,
                        "code": "411424",
                        "name": "柘城县"
                    },
                    {
                        "id": 11782,
                        "code": "411425",
                        "name": "虞城县"
                    },
                    {
                        "id": 11780,
                        "code": "411426",
                        "name": "夏邑县"
                    },
                    {
                        "id": 11781,
                        "code": "411481",
                        "name": "永城市"
                    }
                ]
            },
            {
                "id": 908,
                "code": "411500",
                "name": "信阳",
                "children": [
                    {
                        "id": 11803,
                        "code": "411502",
                        "name": "浉河区"
                    },
                    {
                        "id": 11801,
                        "code": "411503",
                        "name": "平桥区"
                    },
                    {
                        "id": 11800,
                        "code": "411521",
                        "name": "罗山县"
                    },
                    {
                        "id": 11797,
                        "code": "411522",
                        "name": "光山县"
                    },
                    {
                        "id": 11805,
                        "code": "411523",
                        "name": "新县"
                    },
                    {
                        "id": 11802,
                        "code": "411524",
                        "name": "商城县"
                    },
                    {
                        "id": 11796,
                        "code": "411525",
                        "name": "固始县"
                    },
                    {
                        "id": 11799,
                        "code": "411526",
                        "name": "潢川县"
                    },
                    {
                        "id": 11798,
                        "code": "411527",
                        "name": "淮滨县"
                    },
                    {
                        "id": 11804,
                        "code": "411528",
                        "name": "息县"
                    }
                ]
            },
            {
                "id": 911,
                "code": "411600",
                "name": "周口",
                "children": [
                    {
                        "id": 11824,
                        "code": "411602",
                        "name": "川汇区"
                    },
                    {
                        "id": 11827,
                        "code": "411603",
                        "name": "淮阳县"
                    },
                    {
                        "id": 11826,
                        "code": "411621",
                        "name": "扶沟县"
                    },
                    {
                        "id": 11832,
                        "code": "411622",
                        "name": "西华县"
                    },
                    {
                        "id": 11829,
                        "code": "411623",
                        "name": "商水县"
                    },
                    {
                        "id": 11830,
                        "code": "411624",
                        "name": "沈丘县"
                    },
                    {
                        "id": 11825,
                        "code": "411625",
                        "name": "郸城县"
                    },
                    {
                        "id": 11831,
                        "code": "411627",
                        "name": "太康县"
                    },
                    {
                        "id": 11828,
                        "code": "411628",
                        "name": "鹿邑县"
                    },
                    {
                        "id": 11833,
                        "code": "411681",
                        "name": "项城市"
                    }
                ]
            },
            {
                "id": 912,
                "code": "411700",
                "name": "驻马店",
                "children": [
                    {
                        "id": 11842,
                        "code": "411702",
                        "name": "驿城区"
                    },
                    {
                        "id": 11840,
                        "code": "411721",
                        "name": "西平县"
                    },
                    {
                        "id": 11838,
                        "code": "411722",
                        "name": "上蔡县"
                    },
                    {
                        "id": 11835,
                        "code": "411723",
                        "name": "平舆县"
                    },
                    {
                        "id": 11843,
                        "code": "411724",
                        "name": "正阳县"
                    },
                    {
                        "id": 11836,
                        "code": "411725",
                        "name": "确山县"
                    },
                    {
                        "id": 11834,
                        "code": "411726",
                        "name": "泌阳县"
                    },
                    {
                        "id": 11837,
                        "code": "411727",
                        "name": "汝南县"
                    },
                    {
                        "id": 11839,
                        "code": "411728",
                        "name": "遂平县"
                    },
                    {
                        "id": 11841,
                        "code": "411729",
                        "name": "新蔡县"
                    }
                ]
            },
            {
                "id": 897,
                "code": "419001",
                "name": "济源",
                "children": [
                    {
                        "id": 11702,
                        "code": "419001",
                        "name": "济源"
                    }
                ]
            }
        ]
    },
    {
        "id": 48,
        "code": "420000",
        "name": "湖北",
        "children": [
            {
                "id": 937,
                "code": "420100",
                "name": "武汉",
                "children": [
                    {
                        "id": 12025,
                        "code": "420102",
                        "name": "江岸区"
                    },
                    {
                        "id": 12026,
                        "code": "420103",
                        "name": "江汉区"
                    },
                    {
                        "id": 12028,
                        "code": "420104",
                        "name": "硚口区"
                    },
                    {
                        "id": 12022,
                        "code": "420105",
                        "name": "汉阳区"
                    },
                    {
                        "id": 12030,
                        "code": "420106",
                        "name": "武昌区"
                    },
                    {
                        "id": 12029,
                        "code": "420107",
                        "name": "青山区"
                    },
                    {
                        "id": 12023,
                        "code": "420111",
                        "name": "洪山区"
                    },
                    {
                        "id": 12020,
                        "code": "420112",
                        "name": "东西湖区"
                    },
                    {
                        "id": 12021,
                        "code": "420113",
                        "name": "汉南区"
                    },
                    {
                        "id": 12019,
                        "code": "420114",
                        "name": "蔡甸区"
                    },
                    {
                        "id": 12027,
                        "code": "420115",
                        "name": "江夏区"
                    },
                    {
                        "id": 12024,
                        "code": "420116",
                        "name": "黄陂区"
                    },
                    {
                        "id": 12031,
                        "code": "420117",
                        "name": "新洲区"
                    }
                ]
            },
            {
                "id": 929,
                "code": "420200",
                "name": "黄石",
                "children": [
                    {
                        "id": 11987,
                        "code": "420202",
                        "name": "黄石港区"
                    },
                    {
                        "id": 11989,
                        "code": "420203",
                        "name": "西塞山区"
                    },
                    {
                        "id": 11990,
                        "code": "420204",
                        "name": "下陆区"
                    },
                    {
                        "id": 11988,
                        "code": "420205",
                        "name": "铁山区"
                    },
                    {
                        "id": 11991,
                        "code": "420222",
                        "name": "阳新县"
                    },
                    {
                        "id": 11986,
                        "code": "420281",
                        "name": "大冶市"
                    }
                ]
            },
            {
                "id": 934,
                "code": "420300",
                "name": "十堰",
                "children": [
                    {
                        "id": 12009,
                        "code": "420302",
                        "name": "茅箭区"
                    },
                    {
                        "id": 12012,
                        "code": "420303",
                        "name": "张湾区"
                    },
                    {
                        "id": 12011,
                        "code": "420304",
                        "name": "郧阳区"
                    },
                    {
                        "id": 12010,
                        "code": "420322",
                        "name": "郧西县"
                    },
                    {
                        "id": 12013,
                        "code": "420323",
                        "name": "竹山县"
                    },
                    {
                        "id": 12014,
                        "code": "420324",
                        "name": "竹溪县"
                    },
                    {
                        "id": 12008,
                        "code": "420325",
                        "name": "房县"
                    },
                    {
                        "id": 12007,
                        "code": "420381",
                        "name": "丹江口市"
                    }
                ]
            },
            {
                "id": 942,
                "code": "420500",
                "name": "宜昌",
                "children": [
                    {
                        "id": 12059,
                        "code": "420502",
                        "name": "西陵区"
                    },
                    {
                        "id": 12058,
                        "code": "420503",
                        "name": "伍家岗区"
                    },
                    {
                        "id": 12056,
                        "code": "420504",
                        "name": "点军区"
                    },
                    {
                        "id": 12060,
                        "code": "420505",
                        "name": "猇亭区"
                    },
                    {
                        "id": 12062,
                        "code": "420506",
                        "name": "夷陵区"
                    },
                    {
                        "id": 12064,
                        "code": "420525",
                        "name": "远安县"
                    },
                    {
                        "id": 12061,
                        "code": "420526",
                        "name": "兴山县"
                    },
                    {
                        "id": 12067,
                        "code": "420527",
                        "name": "秭归县"
                    },
                    {
                        "id": 12065,
                        "code": "420528",
                        "name": "长阳土家族自治县"
                    },
                    {
                        "id": 12057,
                        "code": "420529",
                        "name": "五峰土家族自治县"
                    },
                    {
                        "id": 12063,
                        "code": "420581",
                        "name": "宜都市"
                    },
                    {
                        "id": 12055,
                        "code": "420582",
                        "name": "当阳市"
                    },
                    {
                        "id": 12066,
                        "code": "420583",
                        "name": "枝江市"
                    }
                ]
            },
            {
                "id": 940,
                "code": "420600",
                "name": "襄阳",
                "children": [
                    {
                        "id": 12044,
                        "code": "420602",
                        "name": "襄城区"
                    },
                    {
                        "id": 12040,
                        "code": "420606",
                        "name": "樊城区"
                    },
                    {
                        "id": 12045,
                        "code": "420607",
                        "name": "襄州区"
                    },
                    {
                        "id": 12043,
                        "code": "420624",
                        "name": "南漳县"
                    },
                    {
                        "id": 12041,
                        "code": "420625",
                        "name": "谷城县"
                    },
                    {
                        "id": 12039,
                        "code": "420626",
                        "name": "保康县"
                    },
                    {
                        "id": 12042,
                        "code": "420682",
                        "name": "老河口市"
                    },
                    {
                        "id": 12047,
                        "code": "420683",
                        "name": "枣阳市"
                    },
                    {
                        "id": 12046,
                        "code": "420684",
                        "name": "宜城市"
                    }
                ]
            },
            {
                "id": 926,
                "code": "420700",
                "name": "鄂州",
                "children": [
                    {
                        "id": 11967,
                        "code": "420702",
                        "name": "梁子湖区"
                    },
                    {
                        "id": 11966,
                        "code": "420703",
                        "name": "华容区"
                    },
                    {
                        "id": 11965,
                        "code": "420704",
                        "name": "鄂城区"
                    }
                ]
            },
            {
                "id": 930,
                "code": "420800",
                "name": "荆门",
                "children": [
                    {
                        "id": 11992,
                        "code": "420802",
                        "name": "东宝区"
                    },
                    {
                        "id": 11993,
                        "code": "420804",
                        "name": "掇刀区"
                    },
                    {
                        "id": 11995,
                        "code": "420822",
                        "name": "沙洋县"
                    },
                    {
                        "id": 11996,
                        "code": "420881",
                        "name": "钟祥市"
                    },
                    {
                        "id": 11994,
                        "code": "420882",
                        "name": "京山县"
                    }
                ]
            },
            {
                "id": 941,
                "code": "420900",
                "name": "孝感",
                "children": [
                    {
                        "id": 12052,
                        "code": "420902",
                        "name": "孝南区"
                    },
                    {
                        "id": 12051,
                        "code": "420921",
                        "name": "孝昌县"
                    },
                    {
                        "id": 12049,
                        "code": "420922",
                        "name": "大悟县"
                    },
                    {
                        "id": 12054,
                        "code": "420923",
                        "name": "云梦县"
                    },
                    {
                        "id": 12053,
                        "code": "420981",
                        "name": "应城市"
                    },
                    {
                        "id": 12048,
                        "code": "420982",
                        "name": "安陆市"
                    },
                    {
                        "id": 12050,
                        "code": "420984",
                        "name": "汉川市"
                    }
                ]
            },
            {
                "id": 931,
                "code": "421000",
                "name": "荆州",
                "children": [
                    {
                        "id": 12002,
                        "code": "421002",
                        "name": "沙市区"
                    },
                    {
                        "id": 12001,
                        "code": "421003",
                        "name": "荆州区"
                    },
                    {
                        "id": 11997,
                        "code": "421022",
                        "name": "公安县"
                    },
                    {
                        "id": 11999,
                        "code": "421023",
                        "name": "监利县"
                    },
                    {
                        "id": 12000,
                        "code": "421024",
                        "name": "江陵县"
                    },
                    {
                        "id": 12003,
                        "code": "421081",
                        "name": "石首市"
                    },
                    {
                        "id": 11998,
                        "code": "421083",
                        "name": "洪湖市"
                    },
                    {
                        "id": 12004,
                        "code": "421087",
                        "name": "松滋市"
                    }
                ]
            },
            {
                "id": 928,
                "code": "421100",
                "name": "黄冈",
                "children": [
                    {
                        "id": 11978,
                        "code": "421102",
                        "name": "黄州区"
                    },
                    {
                        "id": 11982,
                        "code": "421121",
                        "name": "团风县"
                    },
                    {
                        "id": 11976,
                        "code": "421122",
                        "name": "红安县"
                    },
                    {
                        "id": 11979,
                        "code": "421123",
                        "name": "罗田县"
                    },
                    {
                        "id": 11985,
                        "code": "421124",
                        "name": "英山县"
                    },
                    {
                        "id": 11984,
                        "code": "421125",
                        "name": "浠水县"
                    },
                    {
                        "id": 11981,
                        "code": "421126",
                        "name": "蕲春县"
                    },
                    {
                        "id": 11977,
                        "code": "421127",
                        "name": "黄梅县"
                    },
                    {
                        "id": 11980,
                        "code": "421181",
                        "name": "麻城市"
                    },
                    {
                        "id": 11983,
                        "code": "421182",
                        "name": "武穴市"
                    }
                ]
            },
            {
                "id": 939,
                "code": "421200",
                "name": "咸宁",
                "children": [
                    {
                        "id": 12038,
                        "code": "421202",
                        "name": "咸安区"
                    },
                    {
                        "id": 12035,
                        "code": "421221",
                        "name": "嘉鱼县"
                    },
                    {
                        "id": 12036,
                        "code": "421222",
                        "name": "通城县"
                    },
                    {
                        "id": 12034,
                        "code": "421223",
                        "name": "崇阳县"
                    },
                    {
                        "id": 12037,
                        "code": "421224",
                        "name": "通山县"
                    },
                    {
                        "id": 12033,
                        "code": "421281",
                        "name": "赤壁市"
                    }
                ]
            },
            {
                "id": 935,
                "code": "421300",
                "name": "随州",
                "children": [
                    {
                        "id": 12015,
                        "code": "421303",
                        "name": "曾都区"
                    },
                    {
                        "id": 12017,
                        "code": "421321",
                        "name": "随县"
                    },
                    {
                        "id": 12016,
                        "code": "421381",
                        "name": "广水市"
                    }
                ]
            },
            {
                "id": 927,
                "code": "422800",
                "name": "恩施",
                "children": [
                    {
                        "id": 11969,
                        "code": "422801",
                        "name": "恩施市"
                    },
                    {
                        "id": 11973,
                        "code": "422802",
                        "name": "利川市"
                    },
                    {
                        "id": 11971,
                        "code": "422822",
                        "name": "建始县"
                    },
                    {
                        "id": 11968,
                        "code": "422823",
                        "name": "巴东县"
                    },
                    {
                        "id": 11975,
                        "code": "422825",
                        "name": "宣恩县"
                    },
                    {
                        "id": 11974,
                        "code": "422826",
                        "name": "咸丰县"
                    },
                    {
                        "id": 11972,
                        "code": "422827",
                        "name": "来凤县"
                    },
                    {
                        "id": 11970,
                        "code": "422828",
                        "name": "鹤峰县"
                    }
                ]
            },
            {
                "id": 938,
                "code": "429004",
                "name": "仙桃",
                "children": [
                    {
                        "id": 12032,
                        "code": "429004",
                        "name": "仙桃市"
                    }
                ]
            },
            {
                "id": 932,
                "code": "429005",
                "name": "潜江",
                "children": [
                    {
                        "id": 12005,
                        "code": "429005",
                        "name": "潜江市"
                    }
                ]
            },
            {
                "id": 936,
                "code": "429006",
                "name": "天门",
                "children": [
                    {
                        "id": 12018,
                        "code": "429006",
                        "name": "天门市"
                    }
                ]
            },
            {
                "id": 933,
                "code": "429021",
                "name": "神农架",
                "children": [
                    {
                        "id": 12006,
                        "code": "429021",
                        "name": "神农架林区"
                    }
                ]
            }
        ]
    },
    {
        "id": 49,
        "code": "430000",
        "name": "湖南",
        "children": [
            {
                "id": 955,
                "code": "430100",
                "name": "长沙",
                "children": [
                    {
                        "id": 12172,
                        "code": "430102",
                        "name": "芙蓉区"
                    },
                    {
                        "id": 12176,
                        "code": "430103",
                        "name": "天心区"
                    },
                    {
                        "id": 12179,
                        "code": "430104",
                        "name": "岳麓区"
                    },
                    {
                        "id": 12173,
                        "code": "430105",
                        "name": "开福区"
                    },
                    {
                        "id": 12178,
                        "code": "430111",
                        "name": "雨花区"
                    },
                    {
                        "id": 12177,
                        "code": "430112",
                        "name": "望城县"
                    },
                    {
                        "id": 12180,
                        "code": "430121",
                        "name": "长沙县"
                    },
                    {
                        "id": 12174,
                        "code": "430181",
                        "name": "浏阳市"
                    },
                    {
                        "id": 12175,
                        "code": "430182",
                        "name": "宁乡县"
                    }
                ]
            },
            {
                "id": 956,
                "code": "430200",
                "name": "株洲",
                "children": [
                    {
                        "id": 12182,
                        "code": "430202",
                        "name": "荷塘区"
                    },
                    {
                        "id": 12184,
                        "code": "430203",
                        "name": "芦淞区"
                    },
                    {
                        "id": 12186,
                        "code": "430204",
                        "name": "石峰区"
                    },
                    {
                        "id": 12187,
                        "code": "430211",
                        "name": "天元区"
                    },
                    {
                        "id": 12185,
                        "code": "430212",
                        "name": "渌口区"
                    },
                    {
                        "id": 12189,
                        "code": "430223",
                        "name": "攸县"
                    },
                    {
                        "id": 12181,
                        "code": "430224",
                        "name": "茶陵县"
                    },
                    {
                        "id": 12188,
                        "code": "430225",
                        "name": "炎陵县"
                    },
                    {
                        "id": 12183,
                        "code": "430281",
                        "name": "醴陵市"
                    }
                ]
            },
            {
                "id": 949,
                "code": "430300",
                "name": "湘潭",
                "children": [
                    {
                        "id": 12132,
                        "code": "430302",
                        "name": "雨湖区"
                    },
                    {
                        "id": 12133,
                        "code": "430304",
                        "name": "岳塘区"
                    },
                    {
                        "id": 12130,
                        "code": "430321",
                        "name": "湘潭县"
                    },
                    {
                        "id": 12131,
                        "code": "430381",
                        "name": "湘乡市"
                    },
                    {
                        "id": 12129,
                        "code": "430382",
                        "name": "韶山市"
                    }
                ]
            },
            {
                "id": 945,
                "code": "430400",
                "name": "衡阳",
                "children": [
                    {
                        "id": 12099,
                        "code": "430405",
                        "name": "珠晖区"
                    },
                    {
                        "id": 12097,
                        "code": "430406",
                        "name": "雁峰区"
                    },
                    {
                        "id": 12096,
                        "code": "430407",
                        "name": "石鼓区"
                    },
                    {
                        "id": 12098,
                        "code": "430408",
                        "name": "蒸湘区"
                    },
                    {
                        "id": 12094,
                        "code": "430412",
                        "name": "南岳区"
                    },
                    {
                        "id": 12092,
                        "code": "430421",
                        "name": "衡阳县"
                    },
                    {
                        "id": 12090,
                        "code": "430422",
                        "name": "衡南县"
                    },
                    {
                        "id": 12091,
                        "code": "430423",
                        "name": "衡山县"
                    },
                    {
                        "id": 12089,
                        "code": "430424",
                        "name": "衡东县"
                    },
                    {
                        "id": 12095,
                        "code": "430426",
                        "name": "祁东县"
                    },
                    {
                        "id": 12093,
                        "code": "430481",
                        "name": "耒阳市"
                    },
                    {
                        "id": 12088,
                        "code": "430482",
                        "name": "常宁市"
                    }
                ]
            },
            {
                "id": 948,
                "code": "430500",
                "name": "邵阳",
                "children": [
                    {
                        "id": 12124,
                        "code": "430502",
                        "name": "双清区"
                    },
                    {
                        "id": 12119,
                        "code": "430503",
                        "name": "大祥区"
                    },
                    {
                        "id": 12117,
                        "code": "430511",
                        "name": "北塔区"
                    },
                    {
                        "id": 12128,
                        "code": "430522",
                        "name": "新邵县"
                    },
                    {
                        "id": 12123,
                        "code": "430523",
                        "name": "邵阳县"
                    },
                    {
                        "id": 12121,
                        "code": "430524",
                        "name": "隆回县"
                    },
                    {
                        "id": 12120,
                        "code": "430525",
                        "name": "洞口县"
                    },
                    {
                        "id": 12125,
                        "code": "430527",
                        "name": "绥宁县"
                    },
                    {
                        "id": 12127,
                        "code": "430528",
                        "name": "新宁县"
                    },
                    {
                        "id": 12118,
                        "code": "430529",
                        "name": "城步苗族自治县"
                    },
                    {
                        "id": 12126,
                        "code": "430581",
                        "name": "武冈市"
                    },
                    {
                        "id": 12122,
                        "code": "430582",
                        "name": "邵东县"
                    }
                ]
            },
            {
                "id": 953,
                "code": "430600",
                "name": "岳阳",
                "children": [
                    {
                        "id": 12165,
                        "code": "430602",
                        "name": "岳阳楼区"
                    },
                    {
                        "id": 12167,
                        "code": "430603",
                        "name": "云溪区"
                    },
                    {
                        "id": 12160,
                        "code": "430611",
                        "name": "君山区"
                    },
                    {
                        "id": 12166,
                        "code": "430621",
                        "name": "岳阳县"
                    },
                    {
                        "id": 12159,
                        "code": "430623",
                        "name": "华容县"
                    },
                    {
                        "id": 12164,
                        "code": "430624",
                        "name": "湘阴县"
                    },
                    {
                        "id": 12163,
                        "code": "430626",
                        "name": "平江县"
                    },
                    {
                        "id": 12162,
                        "code": "430681",
                        "name": "汨罗市"
                    },
                    {
                        "id": 12161,
                        "code": "430682",
                        "name": "临湘市"
                    }
                ]
            },
            {
                "id": 943,
                "code": "430700",
                "name": "常德",
                "children": [
                    {
                        "id": 12076,
                        "code": "430702",
                        "name": "武陵区"
                    },
                    {
                        "id": 12069,
                        "code": "430703",
                        "name": "鼎城区"
                    },
                    {
                        "id": 12068,
                        "code": "430721",
                        "name": "安乡县"
                    },
                    {
                        "id": 12070,
                        "code": "430722",
                        "name": "汉寿县"
                    },
                    {
                        "id": 12072,
                        "code": "430723",
                        "name": "澧县"
                    },
                    {
                        "id": 12073,
                        "code": "430724",
                        "name": "临澧县"
                    },
                    {
                        "id": 12075,
                        "code": "430725",
                        "name": "桃源县"
                    },
                    {
                        "id": 12074,
                        "code": "430726",
                        "name": "石门县"
                    },
                    {
                        "id": 12071,
                        "code": "430781",
                        "name": "津市市"
                    }
                ]
            },
            {
                "id": 954,
                "code": "430800",
                "name": "张家界",
                "children": [
                    {
                        "id": 12171,
                        "code": "430802",
                        "name": "永定区"
                    },
                    {
                        "id": 12170,
                        "code": "430811",
                        "name": "武陵源区"
                    },
                    {
                        "id": 12168,
                        "code": "430821",
                        "name": "慈利县"
                    },
                    {
                        "id": 12169,
                        "code": "430822",
                        "name": "桑植县"
                    }
                ]
            },
            {
                "id": 951,
                "code": "430900",
                "name": "益阳",
                "children": [
                    {
                        "id": 12147,
                        "code": "430902",
                        "name": "资阳区"
                    },
                    {
                        "id": 12143,
                        "code": "430903",
                        "name": "赫山区"
                    },
                    {
                        "id": 12144,
                        "code": "430921",
                        "name": "南县"
                    },
                    {
                        "id": 12145,
                        "code": "430922",
                        "name": "桃江县"
                    },
                    {
                        "id": 12142,
                        "code": "430923",
                        "name": "安化县"
                    },
                    {
                        "id": 12146,
                        "code": "430981",
                        "name": "沅江市"
                    }
                ]
            },
            {
                "id": 944,
                "code": "431000",
                "name": "郴州",
                "children": [
                    {
                        "id": 12078,
                        "code": "431002",
                        "name": "北湖区"
                    },
                    {
                        "id": 12084,
                        "code": "431003",
                        "name": "苏仙区"
                    },
                    {
                        "id": 12080,
                        "code": "431021",
                        "name": "桂阳县"
                    },
                    {
                        "id": 12085,
                        "code": "431022",
                        "name": "宜章县"
                    },
                    {
                        "id": 12086,
                        "code": "431023",
                        "name": "永兴县"
                    },
                    {
                        "id": 12081,
                        "code": "431024",
                        "name": "嘉禾县"
                    },
                    {
                        "id": 12082,
                        "code": "431025",
                        "name": "临武县"
                    },
                    {
                        "id": 12083,
                        "code": "431026",
                        "name": "汝城县"
                    },
                    {
                        "id": 12079,
                        "code": "431027",
                        "name": "桂东县"
                    },
                    {
                        "id": 12077,
                        "code": "431028",
                        "name": "安仁县"
                    },
                    {
                        "id": 12087,
                        "code": "431081",
                        "name": "资兴市"
                    }
                ]
            },
            {
                "id": 952,
                "code": "431100",
                "name": "永州",
                "children": [
                    {
                        "id": 12154,
                        "code": "431102",
                        "name": "零陵区"
                    },
                    {
                        "id": 12153,
                        "code": "431103",
                        "name": "冷水滩区"
                    },
                    {
                        "id": 12156,
                        "code": "431121",
                        "name": "祁阳县"
                    },
                    {
                        "id": 12149,
                        "code": "431122",
                        "name": "东安县"
                    },
                    {
                        "id": 12157,
                        "code": "431123",
                        "name": "双牌县"
                    },
                    {
                        "id": 12148,
                        "code": "431124",
                        "name": "道县"
                    },
                    {
                        "id": 12151,
                        "code": "431125",
                        "name": "江永县"
                    },
                    {
                        "id": 12155,
                        "code": "431126",
                        "name": "宁远县"
                    },
                    {
                        "id": 12152,
                        "code": "431127",
                        "name": "蓝山县"
                    },
                    {
                        "id": 12158,
                        "code": "431128",
                        "name": "新田县"
                    },
                    {
                        "id": 12150,
                        "code": "431129",
                        "name": "江华瑶族自治县"
                    }
                ]
            },
            {
                "id": 946,
                "code": "431200",
                "name": "怀化",
                "children": [
                    {
                        "id": 12101,
                        "code": "431202",
                        "name": "鹤城区"
                    },
                    {
                        "id": 12111,
                        "code": "431221",
                        "name": "中方县"
                    },
                    {
                        "id": 12109,
                        "code": "431222",
                        "name": "沅陵县"
                    },
                    {
                        "id": 12100,
                        "code": "431223",
                        "name": "辰溪县"
                    },
                    {
                        "id": 12108,
                        "code": "431224",
                        "name": "溆浦县"
                    },
                    {
                        "id": 12103,
                        "code": "431225",
                        "name": "会同县"
                    },
                    {
                        "id": 12105,
                        "code": "431226",
                        "name": "麻阳苗族自治县"
                    },
                    {
                        "id": 12107,
                        "code": "431227",
                        "name": "新晃侗族自治县"
                    },
                    {
                        "id": 12110,
                        "code": "431228",
                        "name": "芷江侗族自治县"
                    },
                    {
                        "id": 12104,
                        "code": "431229",
                        "name": "靖州苗族侗族自治县"
                    },
                    {
                        "id": 12106,
                        "code": "431230",
                        "name": "通道侗族自治县"
                    },
                    {
                        "id": 12102,
                        "code": "431281",
                        "name": "洪江市"
                    }
                ]
            },
            {
                "id": 947,
                "code": "431300",
                "name": "娄底",
                "children": [
                    {
                        "id": 12114,
                        "code": "431302",
                        "name": "娄星区"
                    },
                    {
                        "id": 12115,
                        "code": "431321",
                        "name": "双峰县"
                    },
                    {
                        "id": 12116,
                        "code": "431322",
                        "name": "新化县"
                    },
                    {
                        "id": 12112,
                        "code": "431381",
                        "name": "冷水江市"
                    },
                    {
                        "id": 12113,
                        "code": "431382",
                        "name": "涟源市"
                    }
                ]
            },
            {
                "id": 950,
                "code": "433100",
                "name": "湘西",
                "children": [
                    {
                        "id": 12138,
                        "code": "433101",
                        "name": "吉首市"
                    },
                    {
                        "id": 12140,
                        "code": "433122",
                        "name": "泸溪县"
                    },
                    {
                        "id": 12135,
                        "code": "433123",
                        "name": "凤凰县"
                    },
                    {
                        "id": 12137,
                        "code": "433124",
                        "name": "花垣县"
                    },
                    {
                        "id": 12134,
                        "code": "433125",
                        "name": "保靖县"
                    },
                    {
                        "id": 12136,
                        "code": "433126",
                        "name": "古丈县"
                    },
                    {
                        "id": 12141,
                        "code": "433127",
                        "name": "永顺县"
                    },
                    {
                        "id": 12139,
                        "code": "433130",
                        "name": "龙山县"
                    }
                ]
            }
        ]
    },
    {
        "id": 41,
        "code": "440000",
        "name": "广东",
        "children": [
            {
                "id": 824,
                "code": "440100",
                "name": "广州",
                "children": [
                    {
                        "id": 11191,
                        "code": "440103",
                        "name": "荔湾区"
                    },
                    {
                        "id": 11194,
                        "code": "440104",
                        "name": "越秀区"
                    },
                    {
                        "id": 11188,
                        "code": "440105",
                        "name": "海珠区"
                    },
                    {
                        "id": 11193,
                        "code": "440106",
                        "name": "天河区"
                    },
                    {
                        "id": 11185,
                        "code": "440111",
                        "name": "白云区"
                    },
                    {
                        "id": 11190,
                        "code": "440112",
                        "name": "黄埔区"
                    },
                    {
                        "id": 11187,
                        "code": "440113",
                        "name": "番禺区"
                    },
                    {
                        "id": 11189,
                        "code": "440114",
                        "name": "花都区"
                    },
                    {
                        "id": 11192,
                        "code": "440115",
                        "name": "南沙区"
                    },
                    {
                        "id": 11186,
                        "code": "440117",
                        "name": "从化市"
                    },
                    {
                        "id": 11195,
                        "code": "440118",
                        "name": "增城市"
                    }
                ]
            },
            {
                "id": 834,
                "code": "440200",
                "name": "韶关",
                "children": [
                    {
                        "id": 11259,
                        "code": "440203",
                        "name": "武江区"
                    },
                    {
                        "id": 11261,
                        "code": "440204",
                        "name": "浈江区"
                    },
                    {
                        "id": 11254,
                        "code": "440205",
                        "name": "曲江区"
                    },
                    {
                        "id": 11257,
                        "code": "440222",
                        "name": "始兴县"
                    },
                    {
                        "id": 11255,
                        "code": "440224",
                        "name": "仁化县"
                    },
                    {
                        "id": 11258,
                        "code": "440229",
                        "name": "翁源县"
                    },
                    {
                        "id": 11256,
                        "code": "440232",
                        "name": "乳源瑶族自治县"
                    },
                    {
                        "id": 11260,
                        "code": "440233",
                        "name": "新丰县"
                    },
                    {
                        "id": 11252,
                        "code": "440281",
                        "name": "乐昌市"
                    },
                    {
                        "id": 11253,
                        "code": "440282",
                        "name": "南雄市"
                    }
                ]
            },
            {
                "id": 835,
                "code": "440300",
                "name": "深圳",
                "children": [
                    {
                        "id": 11267,
                        "code": "440303",
                        "name": "罗湖区"
                    },
                    {
                        "id": 11263,
                        "code": "440304",
                        "name": "福田区"
                    },
                    {
                        "id": 11268,
                        "code": "440305",
                        "name": "南山区"
                    },
                    {
                        "id": 11262,
                        "code": "440306",
                        "name": "宝安区"
                    },
                    {
                        "id": 11265,
                        "code": "440307",
                        "name": "龙岗区"
                    },
                    {
                        "id": 11270,
                        "code": "440308",
                        "name": "盐田区"
                    },
                    {
                        "id": 11266,
                        "code": "440309",
                        "name": "龙华区"
                    },
                    {
                        "id": 11269,
                        "code": "440310",
                        "name": "坪山区"
                    },
                    {
                        "id": 11264,
                        "code": "440311",
                        "name": "光明区"
                    }
                ]
            },
            {
                "id": 841,
                "code": "440400",
                "name": "珠海",
                "children": [
                    {
                        "id": 11300,
                        "code": "440402",
                        "name": "香洲区"
                    },
                    {
                        "id": 11298,
                        "code": "440403",
                        "name": "斗门区"
                    },
                    {
                        "id": 11299,
                        "code": "440404",
                        "name": "金湾区"
                    }
                ]
            },
            {
                "id": 832,
                "code": "440500",
                "name": "汕头",
                "children": [
                    {
                        "id": 11245,
                        "code": "440507",
                        "name": "龙湖区"
                    },
                    {
                        "id": 11244,
                        "code": "440511",
                        "name": "金平区"
                    },
                    {
                        "id": 11243,
                        "code": "440512",
                        "name": "濠江区"
                    },
                    {
                        "id": 11241,
                        "code": "440513",
                        "name": "潮阳区"
                    },
                    {
                        "id": 11240,
                        "code": "440514",
                        "name": "潮南区"
                    },
                    {
                        "id": 11242,
                        "code": "440515",
                        "name": "澄海区"
                    },
                    {
                        "id": 11246,
                        "code": "440523",
                        "name": "南澳县"
                    }
                ]
            },
            {
                "id": 823,
                "code": "440600",
                "name": "佛山",
                "children": [
                    {
                        "id": 11180,
                        "code": "440604",
                        "name": "禅城区"
                    },
                    {
                        "id": 11182,
                        "code": "440605",
                        "name": "南海区"
                    },
                    {
                        "id": 11184,
                        "code": "440606",
                        "name": "顺德区"
                    },
                    {
                        "id": 11183,
                        "code": "440607",
                        "name": "三水区"
                    },
                    {
                        "id": 11181,
                        "code": "440608",
                        "name": "高明区"
                    }
                ]
            },
            {
                "id": 827,
                "code": "440700",
                "name": "江门",
                "children": [
                    {
                        "id": 11211,
                        "code": "440703",
                        "name": "蓬江区"
                    },
                    {
                        "id": 11209,
                        "code": "440704",
                        "name": "江海区"
                    },
                    {
                        "id": 11213,
                        "code": "440705",
                        "name": "新会区"
                    },
                    {
                        "id": 11212,
                        "code": "440781",
                        "name": "台山市"
                    },
                    {
                        "id": 11210,
                        "code": "440783",
                        "name": "开平市"
                    },
                    {
                        "id": 11208,
                        "code": "440784",
                        "name": "鹤山市"
                    },
                    {
                        "id": 11207,
                        "code": "440785",
                        "name": "恩平市"
                    }
                ]
            },
            {
                "id": 838,
                "code": "440800",
                "name": "湛江",
                "children": [
                    {
                        "id": 11280,
                        "code": "440802",
                        "name": "赤坎区"
                    },
                    {
                        "id": 11287,
                        "code": "440803",
                        "name": "霞山区"
                    },
                    {
                        "id": 11284,
                        "code": "440804",
                        "name": "坡头区"
                    },
                    {
                        "id": 11283,
                        "code": "440811",
                        "name": "麻章区"
                    },
                    {
                        "id": 11285,
                        "code": "440823",
                        "name": "遂溪县"
                    },
                    {
                        "id": 11288,
                        "code": "440825",
                        "name": "徐闻县"
                    },
                    {
                        "id": 11282,
                        "code": "440881",
                        "name": "廉江市"
                    },
                    {
                        "id": 11281,
                        "code": "440882",
                        "name": "雷州市"
                    },
                    {
                        "id": 11286,
                        "code": "440883",
                        "name": "吴川市"
                    }
                ]
            },
            {
                "id": 829,
                "code": "440900",
                "name": "茂名",
                "children": [
                    {
                        "id": 11222,
                        "code": "440902",
                        "name": "茂南区"
                    },
                    {
                        "id": 11219,
                        "code": "440904",
                        "name": "电白县"
                    },
                    {
                        "id": 11220,
                        "code": "440981",
                        "name": "高州市"
                    },
                    {
                        "id": 11221,
                        "code": "440982",
                        "name": "化州市"
                    },
                    {
                        "id": 11223,
                        "code": "440983",
                        "name": "信宜市"
                    }
                ]
            },
            {
                "id": 839,
                "code": "441200",
                "name": "肇庆",
                "children": [
                    {
                        "id": 11291,
                        "code": "441202",
                        "name": "端州区"
                    },
                    {
                        "id": 11290,
                        "code": "441203",
                        "name": "鼎湖区"
                    },
                    {
                        "id": 11293,
                        "code": "441204",
                        "name": "高要市"
                    },
                    {
                        "id": 11294,
                        "code": "441223",
                        "name": "广宁县"
                    },
                    {
                        "id": 11295,
                        "code": "441224",
                        "name": "怀集县"
                    },
                    {
                        "id": 11292,
                        "code": "441225",
                        "name": "封开县"
                    },
                    {
                        "id": 11289,
                        "code": "441226",
                        "name": "德庆县"
                    },
                    {
                        "id": 11296,
                        "code": "441284",
                        "name": "四会市"
                    }
                ]
            },
            {
                "id": 826,
                "code": "441300",
                "name": "惠州",
                "children": [
                    {
                        "id": 11203,
                        "code": "441302",
                        "name": "惠城区"
                    },
                    {
                        "id": 11205,
                        "code": "441303",
                        "name": "惠阳区"
                    },
                    {
                        "id": 11202,
                        "code": "441322",
                        "name": "博罗县"
                    },
                    {
                        "id": 11204,
                        "code": "441323",
                        "name": "惠东县"
                    },
                    {
                        "id": 11206,
                        "code": "441324",
                        "name": "龙门县"
                    }
                ]
            },
            {
                "id": 830,
                "code": "441400",
                "name": "梅州",
                "children": [
                    {
                        "id": 11227,
                        "code": "441402",
                        "name": "梅江区"
                    },
                    {
                        "id": 11228,
                        "code": "441403",
                        "name": "梅县"
                    },
                    {
                        "id": 11224,
                        "code": "441422",
                        "name": "大埔县"
                    },
                    {
                        "id": 11225,
                        "code": "441423",
                        "name": "丰顺县"
                    },
                    {
                        "id": 11230,
                        "code": "441424",
                        "name": "五华县"
                    },
                    {
                        "id": 11229,
                        "code": "441426",
                        "name": "平远县"
                    },
                    {
                        "id": 11226,
                        "code": "441427",
                        "name": "蕉岭县"
                    },
                    {
                        "id": 11231,
                        "code": "441481",
                        "name": "兴宁市"
                    }
                ]
            },
            {
                "id": 833,
                "code": "441500",
                "name": "汕尾",
                "children": [
                    {
                        "id": 11251,
                        "code": "441500",
                        "name": "汕尾市"
                    },
                    {
                        "id": 11247,
                        "code": "441502",
                        "name": "城区"
                    },
                    {
                        "id": 11248,
                        "code": "441521",
                        "name": "海丰县"
                    },
                    {
                        "id": 11250,
                        "code": "441523",
                        "name": "陆河县"
                    },
                    {
                        "id": 11249,
                        "code": "441581",
                        "name": "陆丰市"
                    }
                ]
            },
            {
                "id": 825,
                "code": "441600",
                "name": "河源",
                "children": [
                    {
                        "id": 11200,
                        "code": "441602",
                        "name": "源城区"
                    },
                    {
                        "id": 11201,
                        "code": "441621",
                        "name": "紫金县"
                    },
                    {
                        "id": 11199,
                        "code": "441622",
                        "name": "龙川县"
                    },
                    {
                        "id": 11198,
                        "code": "441623",
                        "name": "连平县"
                    },
                    {
                        "id": 11197,
                        "code": "441624",
                        "name": "和平县"
                    },
                    {
                        "id": 11196,
                        "code": "441625",
                        "name": "东源县"
                    }
                ]
            },
            {
                "id": 836,
                "code": "441700",
                "name": "阳江",
                "children": [
                    {
                        "id": 11271,
                        "code": "441702",
                        "name": "江城区"
                    },
                    {
                        "id": 11273,
                        "code": "441704",
                        "name": "阳东县"
                    },
                    {
                        "id": 11274,
                        "code": "441721",
                        "name": "阳西县"
                    },
                    {
                        "id": 11272,
                        "code": "441781",
                        "name": "阳春市"
                    }
                ]
            },
            {
                "id": 831,
                "code": "441800",
                "name": "清远",
                "children": [
                    {
                        "id": 11236,
                        "code": "441802",
                        "name": "清城区"
                    },
                    {
                        "id": 11237,
                        "code": "441803",
                        "name": "清新县"
                    },
                    {
                        "id": 11232,
                        "code": "441821",
                        "name": "佛冈县"
                    },
                    {
                        "id": 11238,
                        "code": "441823",
                        "name": "阳山县"
                    },
                    {
                        "id": 11234,
                        "code": "441825",
                        "name": "连山壮族瑶族自治县"
                    },
                    {
                        "id": 11233,
                        "code": "441826",
                        "name": "连南瑶族自治县"
                    },
                    {
                        "id": 11239,
                        "code": "441881",
                        "name": "英德市"
                    },
                    {
                        "id": 11235,
                        "code": "441882",
                        "name": "连州市"
                    }
                ]
            },
            {
                "id": 822,
                "code": "441900",
                "name": "东莞",
                "children": [
                    {
                        "id": 11179,
                        "code": "441900",
                        "name": "东莞市"
                    }
                ]
            },
            {
                "id": 840,
                "code": "442000",
                "name": "中山",
                "children": [
                    {
                        "id": 11297,
                        "code": "442000",
                        "name": "中山市"
                    }
                ]
            },
            {
                "id": 821,
                "code": "445100",
                "name": "潮州",
                "children": [
                    {
                        "id": 11178,
                        "code": "445102",
                        "name": "湘桥区"
                    },
                    {
                        "id": 11176,
                        "code": "445103",
                        "name": "潮安县"
                    },
                    {
                        "id": 11177,
                        "code": "445122",
                        "name": "饶平县"
                    }
                ]
            },
            {
                "id": 828,
                "code": "445200",
                "name": "揭阳",
                "children": [
                    {
                        "id": 11218,
                        "code": "445202",
                        "name": "榕城区"
                    },
                    {
                        "id": 11215,
                        "code": "445203",
                        "name": "揭东县"
                    },
                    {
                        "id": 11216,
                        "code": "445222",
                        "name": "揭西县"
                    },
                    {
                        "id": 11214,
                        "code": "445224",
                        "name": "惠来县"
                    },
                    {
                        "id": 11217,
                        "code": "445281",
                        "name": "普宁市"
                    }
                ]
            },
            {
                "id": 837,
                "code": "445300",
                "name": "云浮",
                "children": [
                    {
                        "id": 11279,
                        "code": "445302",
                        "name": "云城区"
                    },
                    {
                        "id": 11278,
                        "code": "445303",
                        "name": "云安县"
                    },
                    {
                        "id": 11276,
                        "code": "445321",
                        "name": "新兴县"
                    },
                    {
                        "id": 11277,
                        "code": "445322",
                        "name": "郁南县"
                    },
                    {
                        "id": 11275,
                        "code": "445381",
                        "name": "罗定市"
                    }
                ]
            }
        ]
    },
    {
        "id": 42,
        "code": "450000",
        "name": "广西",
        "children": [
            {
                "id": 852,
                "code": "450100",
                "name": "南宁",
                "children": [
                    {
                        "id": 11392,
                        "code": "450102",
                        "name": "兴宁区"
                    },
                    {
                        "id": 11388,
                        "code": "450103",
                        "name": "青秀区"
                    },
                    {
                        "id": 11384,
                        "code": "450105",
                        "name": "江南区"
                    },
                    {
                        "id": 11391,
                        "code": "450107",
                        "name": "西乡塘区"
                    },
                    {
                        "id": 11385,
                        "code": "450108",
                        "name": "良庆区"
                    },
                    {
                        "id": 11393,
                        "code": "450109",
                        "name": "邕宁区"
                    },
                    {
                        "id": 11390,
                        "code": "450110",
                        "name": "武鸣县"
                    },
                    {
                        "id": 11386,
                        "code": "450123",
                        "name": "隆安县"
                    },
                    {
                        "id": 11387,
                        "code": "450124",
                        "name": "马山县"
                    },
                    {
                        "id": 11389,
                        "code": "450125",
                        "name": "上林县"
                    },
                    {
                        "id": 11382,
                        "code": "450126",
                        "name": "宾阳县"
                    },
                    {
                        "id": 11383,
                        "code": "450127",
                        "name": "横县"
                    }
                ]
            },
            {
                "id": 851,
                "code": "450200",
                "name": "柳州",
                "children": [
                    {
                        "id": 11372,
                        "code": "450202",
                        "name": "城中区"
                    },
                    {
                        "id": 11381,
                        "code": "450203",
                        "name": "鱼峰区"
                    },
                    {
                        "id": 11376,
                        "code": "450204",
                        "name": "柳南区"
                    },
                    {
                        "id": 11373,
                        "code": "450205",
                        "name": "柳北区"
                    },
                    {
                        "id": 11375,
                        "code": "450206",
                        "name": "柳江县"
                    },
                    {
                        "id": 11374,
                        "code": "450222",
                        "name": "柳城县"
                    },
                    {
                        "id": 11377,
                        "code": "450223",
                        "name": "鹿寨县"
                    },
                    {
                        "id": 11378,
                        "code": "450224",
                        "name": "融安县"
                    },
                    {
                        "id": 11379,
                        "code": "450225",
                        "name": "融水苗族自治县"
                    },
                    {
                        "id": 11380,
                        "code": "450226",
                        "name": "三江侗族自治县"
                    }
                ]
            },
            {
                "id": 847,
                "code": "450300",
                "name": "桂林",
                "children": [
                    {
                        "id": 11345,
                        "code": "450302",
                        "name": "秀峰区"
                    },
                    {
                        "id": 11333,
                        "code": "450303",
                        "name": "叠彩区"
                    },
                    {
                        "id": 11343,
                        "code": "450304",
                        "name": "象山区"
                    },
                    {
                        "id": 11341,
                        "code": "450305",
                        "name": "七星区"
                    },
                    {
                        "id": 11346,
                        "code": "450311",
                        "name": "雁山区"
                    },
                    {
                        "id": 11337,
                        "code": "450312",
                        "name": "临桂县"
                    },
                    {
                        "id": 11347,
                        "code": "450321",
                        "name": "阳朔县"
                    },
                    {
                        "id": 11338,
                        "code": "450323",
                        "name": "灵川县"
                    },
                    {
                        "id": 11342,
                        "code": "450324",
                        "name": "全州县"
                    },
                    {
                        "id": 11344,
                        "code": "450325",
                        "name": "兴安县"
                    },
                    {
                        "id": 11348,
                        "code": "450326",
                        "name": "永福县"
                    },
                    {
                        "id": 11335,
                        "code": "450327",
                        "name": "灌阳县"
                    },
                    {
                        "id": 11339,
                        "code": "450328",
                        "name": "龙胜各族自治县"
                    },
                    {
                        "id": 11349,
                        "code": "450329",
                        "name": "资源县"
                    },
                    {
                        "id": 11340,
                        "code": "450330",
                        "name": "平乐县"
                    },
                    {
                        "id": 11334,
                        "code": "450332",
                        "name": "恭城瑶族自治县"
                    },
                    {
                        "id": 11336,
                        "code": "450381",
                        "name": "荔浦市"
                    }
                ]
            },
            {
                "id": 854,
                "code": "450400",
                "name": "梧州",
                "children": [
                    {
                        "id": 11403,
                        "code": "450403",
                        "name": "万秀区"
                    },
                    {
                        "id": 11404,
                        "code": "450405",
                        "name": "长洲区"
                    },
                    {
                        "id": 11400,
                        "code": "450406",
                        "name": "龙圩区"
                    },
                    {
                        "id": 11398,
                        "code": "450421",
                        "name": "苍梧县"
                    },
                    {
                        "id": 11402,
                        "code": "450422",
                        "name": "藤县"
                    },
                    {
                        "id": 11401,
                        "code": "450423",
                        "name": "蒙山县"
                    },
                    {
                        "id": 11399,
                        "code": "450481",
                        "name": "岑溪市"
                    }
                ]
            },
            {
                "id": 843,
                "code": "450500",
                "name": "北海",
                "children": [
                    {
                        "id": 11313,
                        "code": "450502",
                        "name": "海城区"
                    },
                    {
                        "id": 11316,
                        "code": "450503",
                        "name": "银海区"
                    },
                    {
                        "id": 11315,
                        "code": "450512",
                        "name": "铁山港区"
                    },
                    {
                        "id": 11314,
                        "code": "450521",
                        "name": "合浦县"
                    }
                ]
            },
            {
                "id": 845,
                "code": "450600",
                "name": "防城港",
                "children": [
                    {
                        "id": 11326,
                        "code": "450602",
                        "name": "港口区"
                    },
                    {
                        "id": 11325,
                        "code": "450603",
                        "name": "防城区"
                    },
                    {
                        "id": 11327,
                        "code": "450621",
                        "name": "上思县"
                    },
                    {
                        "id": 11324,
                        "code": "450681",
                        "name": "东兴市"
                    }
                ]
            },
            {
                "id": 853,
                "code": "450700",
                "name": "钦州",
                "children": [
                    {
                        "id": 11397,
                        "code": "450702",
                        "name": "钦南区"
                    },
                    {
                        "id": 11396,
                        "code": "450703",
                        "name": "钦北区"
                    },
                    {
                        "id": 11394,
                        "code": "450721",
                        "name": "灵山县"
                    },
                    {
                        "id": 11395,
                        "code": "450722",
                        "name": "浦北县"
                    }
                ]
            },
            {
                "id": 846,
                "code": "450800",
                "name": "贵港",
                "children": [
                    {
                        "id": 11328,
                        "code": "450802",
                        "name": "港北区"
                    },
                    {
                        "id": 11329,
                        "code": "450803",
                        "name": "港南区"
                    },
                    {
                        "id": 11332,
                        "code": "450804",
                        "name": "覃塘区"
                    },
                    {
                        "id": 11331,
                        "code": "450821",
                        "name": "平南县"
                    },
                    {
                        "id": 11330,
                        "code": "450881",
                        "name": "桂平市"
                    }
                ]
            },
            {
                "id": 855,
                "code": "450900",
                "name": "玉林",
                "children": [
                    {
                        "id": 11411,
                        "code": "450902",
                        "name": "玉州区"
                    },
                    {
                        "id": 11407,
                        "code": "450903",
                        "name": "福绵区"
                    },
                    {
                        "id": 11409,
                        "code": "450921",
                        "name": "容县"
                    },
                    {
                        "id": 11408,
                        "code": "450922",
                        "name": "陆川县"
                    },
                    {
                        "id": 11406,
                        "code": "450923",
                        "name": "博白县"
                    },
                    {
                        "id": 11410,
                        "code": "450924",
                        "name": "兴业县"
                    },
                    {
                        "id": 11405,
                        "code": "450981",
                        "name": "北流市"
                    }
                ]
            },
            {
                "id": 842,
                "code": "451000",
                "name": "百色",
                "children": [
                    {
                        "id": 11312,
                        "code": "451002",
                        "name": "右江区"
                    },
                    {
                        "id": 11310,
                        "code": "451003",
                        "name": "田阳县"
                    },
                    {
                        "id": 11308,
                        "code": "451022",
                        "name": "田东县"
                    },
                    {
                        "id": 11301,
                        "code": "451024",
                        "name": "德保县"
                    },
                    {
                        "id": 11306,
                        "code": "451026",
                        "name": "那坡县"
                    },
                    {
                        "id": 11304,
                        "code": "451027",
                        "name": "凌云县"
                    },
                    {
                        "id": 11303,
                        "code": "451028",
                        "name": "乐业县"
                    },
                    {
                        "id": 11309,
                        "code": "451029",
                        "name": "田林县"
                    },
                    {
                        "id": 11311,
                        "code": "451030",
                        "name": "西林县"
                    },
                    {
                        "id": 11305,
                        "code": "451031",
                        "name": "隆林各族自治县"
                    },
                    {
                        "id": 11302,
                        "code": "451081",
                        "name": "靖西县"
                    },
                    {
                        "id": 11307,
                        "code": "451082",
                        "name": "平果县"
                    }
                ]
            },
            {
                "id": 849,
                "code": "451100",
                "name": "贺州",
                "children": [
                    {
                        "id": 11361,
                        "code": "451102",
                        "name": "八步区"
                    },
                    {
                        "id": 11363,
                        "code": "451103",
                        "name": "平桂区"
                    },
                    {
                        "id": 11364,
                        "code": "451121",
                        "name": "昭平县"
                    },
                    {
                        "id": 11365,
                        "code": "451122",
                        "name": "钟山县"
                    },
                    {
                        "id": 11362,
                        "code": "451123",
                        "name": "富川瑶族自治县"
                    }
                ]
            },
            {
                "id": 848,
                "code": "451200",
                "name": "河池",
                "children": [
                    {
                        "id": 11356,
                        "code": "451202",
                        "name": "金城江区"
                    },
                    {
                        "id": 11360,
                        "code": "451203",
                        "name": "宜州市"
                    },
                    {
                        "id": 11358,
                        "code": "451221",
                        "name": "南丹县"
                    },
                    {
                        "id": 11359,
                        "code": "451222",
                        "name": "天峨县"
                    },
                    {
                        "id": 11354,
                        "code": "451223",
                        "name": "凤山县"
                    },
                    {
                        "id": 11352,
                        "code": "451224",
                        "name": "东兰县"
                    },
                    {
                        "id": 11357,
                        "code": "451225",
                        "name": "罗城仫佬族自治县"
                    },
                    {
                        "id": 11355,
                        "code": "451226",
                        "name": "环江毛南族自治县"
                    },
                    {
                        "id": 11350,
                        "code": "451227",
                        "name": "巴马瑶族自治县"
                    },
                    {
                        "id": 11353,
                        "code": "451228",
                        "name": "都安瑶族自治县"
                    },
                    {
                        "id": 11351,
                        "code": "451229",
                        "name": "大化瑶族自治县"
                    }
                ]
            },
            {
                "id": 850,
                "code": "451300",
                "name": "来宾",
                "children": [
                    {
                        "id": 11371,
                        "code": "451302",
                        "name": "兴宾区"
                    },
                    {
                        "id": 11370,
                        "code": "451321",
                        "name": "忻城县"
                    },
                    {
                        "id": 11369,
                        "code": "451322",
                        "name": "象州县"
                    },
                    {
                        "id": 11368,
                        "code": "451323",
                        "name": "武宣县"
                    },
                    {
                        "id": 11367,
                        "code": "451324",
                        "name": "金秀瑶族自治县"
                    },
                    {
                        "id": 11366,
                        "code": "451381",
                        "name": "合山市"
                    }
                ]
            },
            {
                "id": 844,
                "code": "451400",
                "name": "崇左",
                "children": [
                    {
                        "id": 11319,
                        "code": "451402",
                        "name": "江州区"
                    },
                    {
                        "id": 11318,
                        "code": "451421",
                        "name": "扶绥县"
                    },
                    {
                        "id": 11321,
                        "code": "451422",
                        "name": "宁明县"
                    },
                    {
                        "id": 11320,
                        "code": "451423",
                        "name": "龙州县"
                    },
                    {
                        "id": 11317,
                        "code": "451424",
                        "name": "大新县"
                    },
                    {
                        "id": 11323,
                        "code": "451425",
                        "name": "天等县"
                    },
                    {
                        "id": 11322,
                        "code": "451481",
                        "name": "凭祥市"
                    }
                ]
            }
        ]
    },
    {
        "id": 44,
        "code": "460000",
        "name": "海南",
        "children": [
            {
                "id": 872,
                "code": "460100",
                "name": "海口",
                "children": [
                    {
                        "id": 11508,
                        "code": "460105",
                        "name": "秀英区"
                    },
                    {
                        "id": 13835,
                        "code": "460106",
                        "name": "龙华区"
                    },
                    {
                        "id": 11507,
                        "code": "460107",
                        "name": "琼山区"
                    },
                    {
                        "id": 11506,
                        "code": "460108",
                        "name": "美兰区"
                    }
                ]
            },
            {
                "id": 879,
                "code": "460200",
                "name": "三亚",
                "children": [
                    {
                        "id": 11515,
                        "code": "460202",
                        "name": "海棠区"
                    },
                    {
                        "id": 11516,
                        "code": "460203",
                        "name": "吉阳区"
                    },
                    {
                        "id": 11517,
                        "code": "460204",
                        "name": "天涯区"
                    },
                    {
                        "id": 11518,
                        "code": "460205",
                        "name": "崖州区"
                    }
                ]
            },
            {
                "id": 878,
                "code": "460300",
                "name": "三沙市",
                "children": [
                    {
                        "id": 11514,
                        "code": "460300",
                        "name": "三沙市"
                    }
                ]
            },
            {
                "id": 869,
                "code": "460400",
                "name": "儋州",
                "children": [
                    {
                        "id": 11503,
                        "code": "460400",
                        "name": "儋州"
                    }
                ]
            },
            {
                "id": 883,
                "code": "469001",
                "name": "五指山",
                "children": [
                    {
                        "id": 11522,
                        "code": "469001",
                        "name": "五指山"
                    }
                ]
            },
            {
                "id": 876,
                "code": "469002",
                "name": "琼海",
                "children": [
                    {
                        "id": 11512,
                        "code": "469002",
                        "name": "琼海"
                    }
                ]
            },
            {
                "id": 882,
                "code": "469005",
                "name": "文昌",
                "children": [
                    {
                        "id": 11521,
                        "code": "469005",
                        "name": "文昌市"
                    }
                ]
            },
            {
                "id": 881,
                "code": "469006",
                "name": "万宁",
                "children": [
                    {
                        "id": 11520,
                        "code": "469006",
                        "name": "万宁市"
                    }
                ]
            },
            {
                "id": 871,
                "code": "469007",
                "name": "东方",
                "children": [
                    {
                        "id": 11505,
                        "code": "469007",
                        "name": "东方市"
                    }
                ]
            },
            {
                "id": 870,
                "code": "469021",
                "name": "定安县",
                "children": [
                    {
                        "id": 11504,
                        "code": "469021",
                        "name": "定安县"
                    }
                ]
            },
            {
                "id": 880,
                "code": "469022",
                "name": "屯昌县",
                "children": [
                    {
                        "id": 11519,
                        "code": "469022",
                        "name": "屯昌县"
                    }
                ]
            },
            {
                "id": 868,
                "code": "469023",
                "name": "澄迈县",
                "children": [
                    {
                        "id": 11502,
                        "code": "469023",
                        "name": "澄迈县"
                    }
                ]
            },
            {
                "id": 874,
                "code": "469024",
                "name": "临高县",
                "children": [
                    {
                        "id": 11510,
                        "code": "469024",
                        "name": "临高县"
                    }
                ]
            },
            {
                "id": 865,
                "code": "469025",
                "name": "白沙黎族自治县",
                "children": [
                    {
                        "id": 11499,
                        "code": "469025",
                        "name": "白沙黎族自治县"
                    }
                ]
            },
            {
                "id": 867,
                "code": "469026",
                "name": "昌江黎族自治县",
                "children": [
                    {
                        "id": 11501,
                        "code": "469026",
                        "name": "昌江黎族自治县"
                    }
                ]
            },
            {
                "id": 873,
                "code": "469027",
                "name": "乐东黎族自治县",
                "children": [
                    {
                        "id": 11509,
                        "code": "469027",
                        "name": "乐东黎族自治县"
                    }
                ]
            },
            {
                "id": 875,
                "code": "469028",
                "name": "陵水黎族自治县",
                "children": [
                    {
                        "id": 11511,
                        "code": "469028",
                        "name": "陵水黎族自治县"
                    }
                ]
            },
            {
                "id": 866,
                "code": "469029",
                "name": "保亭黎族苗族自治县",
                "children": [
                    {
                        "id": 11500,
                        "code": "469029",
                        "name": "保亭黎族苗族自治县"
                    }
                ]
            },
            {
                "id": 877,
                "code": "469030",
                "name": "琼中黎族苗族自治县",
                "children": [
                    {
                        "id": 11513,
                        "code": "469030",
                        "name": "琼中黎族苗族自治县"
                    }
                ]
            }
        ]
    },
    {
        "id": 38,
        "code": "500000",
        "name": "重庆",
        "children": [
            {
                "id": 797,
                "code": "500100",
                "name": "重庆",
                "children": [
                    {
                        "id": 10986,
                        "code": "500101",
                        "name": "万州区"
                    },
                    {
                        "id": 10969,
                        "code": "500102",
                        "name": "涪陵区"
                    },
                    {
                        "id": 10995,
                        "code": "500103",
                        "name": "渝中区"
                    },
                    {
                        "id": 11000,
                        "code": "500104",
                        "name": "大渡口区"
                    },
                    {
                        "id": 13889,
                        "code": "500105",
                        "name": "江北区"
                    },
                    {
                        "id": 10982,
                        "code": "500106",
                        "name": "沙坪坝区"
                    },
                    {
                        "id": 10972,
                        "code": "500107",
                        "name": "九龙坡区"
                    },
                    {
                        "id": 10975,
                        "code": "500108",
                        "name": "南岸区"
                    },
                    {
                        "id": 10989,
                        "code": "500109",
                        "name": "北碚区"
                    },
                    {
                        "id": 10979,
                        "code": "500110",
                        "name": "綦江县"
                    },
                    {
                        "id": 11001,
                        "code": "500111",
                        "name": "大足县"
                    },
                    {
                        "id": 10994,
                        "code": "500112",
                        "name": "渝北区"
                    },
                    {
                        "id": 10978,
                        "code": "500113",
                        "name": "巴南区"
                    },
                    {
                        "id": 10980,
                        "code": "500114",
                        "name": "黔江区"
                    },
                    {
                        "id": 10968,
                        "code": "500115",
                        "name": "长寿区"
                    },
                    {
                        "id": 10971,
                        "code": "500116",
                        "name": "江津区"
                    },
                    {
                        "id": 10970,
                        "code": "500117",
                        "name": "合川区"
                    },
                    {
                        "id": 10992,
                        "code": "500118",
                        "name": "永川区"
                    },
                    {
                        "id": 10976,
                        "code": "500119",
                        "name": "南川区"
                    },
                    {
                        "id": 10998,
                        "code": "500120",
                        "name": "璧山区"
                    },
                    {
                        "id": 10984,
                        "code": "500151",
                        "name": "铜梁县"
                    },
                    {
                        "id": 10985,
                        "code": "500152",
                        "name": "潼南县"
                    },
                    {
                        "id": 10981,
                        "code": "500153",
                        "name": "荣昌县"
                    },
                    {
                        "id": 10973,
                        "code": "500154",
                        "name": "开州区"
                    },
                    {
                        "id": 10974,
                        "code": "500155",
                        "name": "梁平县"
                    },
                    {
                        "id": 10990,
                        "code": "500156",
                        "name": "武隆县"
                    },
                    {
                        "id": 10999,
                        "code": "500229",
                        "name": "城口县"
                    },
                    {
                        "id": 11003,
                        "code": "500230",
                        "name": "丰都县"
                    },
                    {
                        "id": 11002,
                        "code": "500231",
                        "name": "垫江县"
                    },
                    {
                        "id": 10997,
                        "code": "500233",
                        "name": "忠县"
                    },
                    {
                        "id": 10996,
                        "code": "500235",
                        "name": "云阳县"
                    },
                    {
                        "id": 10967,
                        "code": "500236",
                        "name": "奉节县"
                    },
                    {
                        "id": 10987,
                        "code": "500237",
                        "name": "巫山县"
                    },
                    {
                        "id": 10988,
                        "code": "500238",
                        "name": "巫溪县"
                    },
                    {
                        "id": 10983,
                        "code": "500240",
                        "name": "石柱土家族自治县"
                    },
                    {
                        "id": 10991,
                        "code": "500241",
                        "name": "秀山土家族苗族自治县"
                    },
                    {
                        "id": 10993,
                        "code": "500242",
                        "name": "酉阳土家族苗族自治县"
                    },
                    {
                        "id": 10977,
                        "code": "500243",
                        "name": "彭水苗族土家族自治县"
                    }
                ]
            }
        ]
    },
    {
        "id": 61,
        "code": "510000",
        "name": "四川",
        "children": [
            {
                "id": 1069,
                "code": "510100",
                "name": "成都",
                "children": [
                    {
                        "id": 13100,
                        "code": "510104",
                        "name": "锦江区"
                    },
                    {
                        "id": 13106,
                        "code": "510105",
                        "name": "青羊区"
                    },
                    {
                        "id": 13098,
                        "code": "510106",
                        "name": "金牛区"
                    },
                    {
                        "id": 13110,
                        "code": "510107",
                        "name": "武侯区"
                    },
                    {
                        "id": 13093,
                        "code": "510108",
                        "name": "成华区"
                    },
                    {
                        "id": 13101,
                        "code": "510112",
                        "name": "龙泉驿区"
                    },
                    {
                        "id": 13105,
                        "code": "510113",
                        "name": "青白江区"
                    },
                    {
                        "id": 13111,
                        "code": "510114",
                        "name": "新都区"
                    },
                    {
                        "id": 13109,
                        "code": "510115",
                        "name": "温江区"
                    },
                    {
                        "id": 13108,
                        "code": "510116",
                        "name": "双流县"
                    },
                    {
                        "id": 13103,
                        "code": "510117",
                        "name": "郫都区"
                    },
                    {
                        "id": 13112,
                        "code": "510118",
                        "name": "新津县"
                    },
                    {
                        "id": 13099,
                        "code": "510121",
                        "name": "金堂县"
                    },
                    {
                        "id": 13095,
                        "code": "510129",
                        "name": "大邑县"
                    },
                    {
                        "id": 13104,
                        "code": "510131",
                        "name": "蒲江县"
                    },
                    {
                        "id": 13096,
                        "code": "510181",
                        "name": "都江堰市"
                    },
                    {
                        "id": 13102,
                        "code": "510182",
                        "name": "彭州市"
                    },
                    {
                        "id": 13107,
                        "code": "510183",
                        "name": "邛崃市"
                    },
                    {
                        "id": 13094,
                        "code": "510184",
                        "name": "崇州市"
                    },
                    {
                        "id": 13097,
                        "code": "510185",
                        "name": "简阳市"
                    }
                ]
            },
            {
                "id": 1087,
                "code": "510300",
                "name": "自贡",
                "children": [
                    {
                        "id": 13255,
                        "code": "510302",
                        "name": "自流井区"
                    },
                    {
                        "id": 13252,
                        "code": "510303",
                        "name": "贡井区"
                    },
                    {
                        "id": 13250,
                        "code": "510304",
                        "name": "大安区"
                    },
                    {
                        "id": 13254,
                        "code": "510311",
                        "name": "沿滩区"
                    },
                    {
                        "id": 13253,
                        "code": "510321",
                        "name": "荣县"
                    },
                    {
                        "id": 13251,
                        "code": "510322",
                        "name": "富顺县"
                    }
                ]
            },
            {
                "id": 1082,
                "code": "510400",
                "name": "攀枝花",
                "children": [
                    {
                        "id": 13219,
                        "code": "510402",
                        "name": "东区"
                    },
                    {
                        "id": 13222,
                        "code": "510403",
                        "name": "西区"
                    },
                    {
                        "id": 13221,
                        "code": "510411",
                        "name": "仁和区"
                    },
                    {
                        "id": 13220,
                        "code": "510421",
                        "name": "米易县"
                    },
                    {
                        "id": 13223,
                        "code": "510422",
                        "name": "盐边县"
                    }
                ]
            },
            {
                "id": 1077,
                "code": "510500",
                "name": "泸州",
                "children": [
                    {
                        "id": 13186,
                        "code": "510502",
                        "name": "江阳区"
                    },
                    {
                        "id": 13189,
                        "code": "510503",
                        "name": "纳溪区"
                    },
                    {
                        "id": 13187,
                        "code": "510504",
                        "name": "龙马潭区"
                    },
                    {
                        "id": 13188,
                        "code": "510521",
                        "name": "泸县"
                    },
                    {
                        "id": 13185,
                        "code": "510522",
                        "name": "合江县"
                    },
                    {
                        "id": 13190,
                        "code": "510524",
                        "name": "叙永县"
                    },
                    {
                        "id": 13184,
                        "code": "510525",
                        "name": "古蔺县"
                    }
                ]
            },
            {
                "id": 1071,
                "code": "510600",
                "name": "德阳",
                "children": [
                    {
                        "id": 13121,
                        "code": "510603",
                        "name": "旌阳区"
                    },
                    {
                        "id": 13122,
                        "code": "510604",
                        "name": "罗江县"
                    },
                    {
                        "id": 13125,
                        "code": "510623",
                        "name": "中江县"
                    },
                    {
                        "id": 13120,
                        "code": "510681",
                        "name": "广汉市"
                    },
                    {
                        "id": 13124,
                        "code": "510682",
                        "name": "什邡市"
                    },
                    {
                        "id": 13123,
                        "code": "510683",
                        "name": "绵竹市"
                    }
                ]
            },
            {
                "id": 1079,
                "code": "510700",
                "name": "绵阳",
                "children": [
                    {
                        "id": 13199,
                        "code": "510703",
                        "name": "涪城区"
                    },
                    {
                        "id": 13204,
                        "code": "510704",
                        "name": "游仙区"
                    },
                    {
                        "id": 13197,
                        "code": "510705",
                        "name": "安州区"
                    },
                    {
                        "id": 13202,
                        "code": "510722",
                        "name": "三台县"
                    },
                    {
                        "id": 13203,
                        "code": "510723",
                        "name": "盐亭县"
                    },
                    {
                        "id": 13205,
                        "code": "510725",
                        "name": "梓潼县"
                    },
                    {
                        "id": 13198,
                        "code": "510726",
                        "name": "北川羌族自治县"
                    },
                    {
                        "id": 13201,
                        "code": "510727",
                        "name": "平武县"
                    },
                    {
                        "id": 13200,
                        "code": "510781",
                        "name": "江油市"
                    }
                ]
            },
            {
                "id": 1074,
                "code": "510800",
                "name": "广元",
                "children": [
                    {
                        "id": 13153,
                        "code": "510802",
                        "name": "利州区"
                    },
                    {
                        "id": 13156,
                        "code": "510811",
                        "name": "昭化区"
                    },
                    {
                        "id": 13151,
                        "code": "510812",
                        "name": "朝天区"
                    },
                    {
                        "id": 13155,
                        "code": "510821",
                        "name": "旺苍县"
                    },
                    {
                        "id": 13154,
                        "code": "510822",
                        "name": "青川县"
                    },
                    {
                        "id": 13152,
                        "code": "510823",
                        "name": "剑阁县"
                    },
                    {
                        "id": 13150,
                        "code": "510824",
                        "name": "苍溪县"
                    }
                ]
            },
            {
                "id": 1083,
                "code": "510900",
                "name": "遂宁",
                "children": [
                    {
                        "id": 13225,
                        "code": "510903",
                        "name": "船山区"
                    },
                    {
                        "id": 13224,
                        "code": "510904",
                        "name": "&gt;安居区"
                    },
                    {
                        "id": 13227,
                        "code": "510921",
                        "name": "&gt;蓬溪县"
                    },
                    {
                        "id": 13226,
                        "code": "510923",
                        "name": "&gt;大英县"
                    },
                    {
                        "id": 13228,
                        "code": "510981",
                        "name": "&gt;射洪县"
                    }
                ]
            },
            {
                "id": 1081,
                "code": "511000",
                "name": "内江",
                "children": [
                    {
                        "id": 13861,
                        "code": "511002",
                        "name": "市中区"
                    },
                    {
                        "id": 13215,
                        "code": "511011",
                        "name": "东兴区"
                    },
                    {
                        "id": 13217,
                        "code": "511024",
                        "name": "威远县"
                    },
                    {
                        "id": 13218,
                        "code": "511025",
                        "name": "资中县"
                    },
                    {
                        "id": 13216,
                        "code": "511083",
                        "name": "隆昌县"
                    }
                ]
            },
            {
                "id": 1075,
                "code": "511100",
                "name": "乐山",
                "children": [
                    {
                        "id": 13860,
                        "code": "511102",
                        "name": "市中区"
                    },
                    {
                        "id": 13165,
                        "code": "511111",
                        "name": "沙湾区"
                    },
                    {
                        "id": 13166,
                        "code": "511112",
                        "name": "五通桥区"
                    },
                    {
                        "id": 13161,
                        "code": "511113",
                        "name": "金口河区"
                    },
                    {
                        "id": 13160,
                        "code": "511123",
                        "name": "犍为县"
                    },
                    {
                        "id": 13162,
                        "code": "511124",
                        "name": "井研县"
                    },
                    {
                        "id": 13159,
                        "code": "511126",
                        "name": "夹江县"
                    },
                    {
                        "id": 13164,
                        "code": "511129",
                        "name": "沐川县"
                    },
                    {
                        "id": 13157,
                        "code": "511132",
                        "name": "峨边彝族自治县"
                    },
                    {
                        "id": 13163,
                        "code": "511133",
                        "name": "马边彝族自治县"
                    },
                    {
                        "id": 13158,
                        "code": "511181",
                        "name": "峨眉山市"
                    }
                ]
            },
            {
                "id": 1080,
                "code": "511300",
                "name": "南充",
                "children": [
                    {
                        "id": 13211,
                        "code": "511302",
                        "name": "顺庆区"
                    },
                    {
                        "id": 13206,
                        "code": "511303",
                        "name": "高坪区"
                    },
                    {
                        "id": 13207,
                        "code": "511304",
                        "name": "嘉陵区"
                    },
                    {
                        "id": 13209,
                        "code": "511321",
                        "name": "南部县"
                    },
                    {
                        "id": 13214,
                        "code": "511322",
                        "name": "营山县"
                    },
                    {
                        "id": 13210,
                        "code": "511323",
                        "name": "蓬安县"
                    },
                    {
                        "id": 13213,
                        "code": "511324",
                        "name": "仪陇县"
                    },
                    {
                        "id": 13212,
                        "code": "511325",
                        "name": "西充县"
                    },
                    {
                        "id": 13208,
                        "code": "511381",
                        "name": "阆中市"
                    }
                ]
            },
            {
                "id": 1078,
                "code": "511400",
                "name": "眉山",
                "children": [
                    {
                        "id": 13192,
                        "code": "511402",
                        "name": "东坡区"
                    },
                    {
                        "id": 13194,
                        "code": "511403",
                        "name": "彭山县"
                    },
                    {
                        "id": 13196,
                        "code": "511421",
                        "name": "仁寿县"
                    },
                    {
                        "id": 13193,
                        "code": "511423",
                        "name": "洪雅县"
                    },
                    {
                        "id": 13191,
                        "code": "511424",
                        "name": "丹棱县"
                    },
                    {
                        "id": 13195,
                        "code": "511425",
                        "name": "青神县"
                    }
                ]
            },
            {
                "id": 1085,
                "code": "511500",
                "name": "宜宾",
                "children": [
                    {
                        "id": 13238,
                        "code": "511502",
                        "name": "翠屏区"
                    },
                    {
                        "id": 13243,
                        "code": "511503",
                        "name": "南溪县"
                    },
                    {
                        "id": 13246,
                        "code": "511504",
                        "name": "叙州区"
                    },
                    {
                        "id": 13241,
                        "code": "511523",
                        "name": "江安县"
                    },
                    {
                        "id": 13237,
                        "code": "511524",
                        "name": "长宁县"
                    },
                    {
                        "id": 13239,
                        "code": "511525",
                        "name": "高县"
                    },
                    {
                        "id": 13240,
                        "code": "511526",
                        "name": "珙县"
                    },
                    {
                        "id": 13242,
                        "code": "511527",
                        "name": "筠连县"
                    },
                    {
                        "id": 13245,
                        "code": "511528",
                        "name": "兴文县"
                    },
                    {
                        "id": 13244,
                        "code": "511529",
                        "name": "屏山县"
                    }
                ]
            },
            {
                "id": 1073,
                "code": "511600",
                "name": "广安",
                "children": [
                    {
                        "id": 13144,
                        "code": "511602",
                        "name": "广安区"
                    },
                    {
                        "id": 13147,
                        "code": "511603",
                        "name": "前锋区"
                    },
                    {
                        "id": 13149,
                        "code": "511621",
                        "name": "岳池县"
                    },
                    {
                        "id": 13148,
                        "code": "511622",
                        "name": "武胜县"
                    },
                    {
                        "id": 13146,
                        "code": "511623",
                        "name": "邻水县"
                    },
                    {
                        "id": 13145,
                        "code": "511681",
                        "name": "华蓥市"
                    }
                ]
            },
            {
                "id": 1070,
                "code": "511700",
                "name": "达州",
                "children": [
                    {
                        "id": 13117,
                        "code": "511702",
                        "name": "通川区"
                    },
                    {
                        "id": 13113,
                        "code": "511703",
                        "name": "达川区"
                    },
                    {
                        "id": 13119,
                        "code": "511722",
                        "name": "宣汉县"
                    },
                    {
                        "id": 13115,
                        "code": "511723",
                        "name": "开江县"
                    },
                    {
                        "id": 13114,
                        "code": "511724",
                        "name": "大竹县"
                    },
                    {
                        "id": 13116,
                        "code": "511725",
                        "name": "渠县"
                    },
                    {
                        "id": 13118,
                        "code": "511781",
                        "name": "万源市"
                    }
                ]
            },
            {
                "id": 1084,
                "code": "511800",
                "name": "雅安",
                "children": [
                    {
                        "id": 13236,
                        "code": "511802",
                        "name": "雨城区"
                    },
                    {
                        "id": 13232,
                        "code": "511803",
                        "name": "名山县"
                    },
                    {
                        "id": 13235,
                        "code": "511822",
                        "name": "荥经县"
                    },
                    {
                        "id": 13230,
                        "code": "511823",
                        "name": "汉源县"
                    },
                    {
                        "id": 13233,
                        "code": "511824",
                        "name": "石棉县"
                    },
                    {
                        "id": 13234,
                        "code": "511825",
                        "name": "天全县"
                    },
                    {
                        "id": 13231,
                        "code": "511826",
                        "name": "芦山县"
                    },
                    {
                        "id": 13229,
                        "code": "511827",
                        "name": "宝兴县"
                    }
                ]
            },
            {
                "id": 1068,
                "code": "511900",
                "name": "巴中",
                "children": [
                    {
                        "id": 13088,
                        "code": "511902",
                        "name": "巴州区"
                    },
                    {
                        "id": 13089,
                        "code": "511903",
                        "name": "恩阳区"
                    },
                    {
                        "id": 13092,
                        "code": "511921",
                        "name": "通江县"
                    },
                    {
                        "id": 13090,
                        "code": "511922",
                        "name": "南江县"
                    },
                    {
                        "id": 13091,
                        "code": "511923",
                        "name": "平昌县"
                    }
                ]
            },
            {
                "id": 1086,
                "code": "512000",
                "name": "资阳",
                "children": [
                    {
                        "id": 13249,
                        "code": "512002",
                        "name": "雁江区"
                    },
                    {
                        "id": 13247,
                        "code": "512021",
                        "name": "安岳县"
                    },
                    {
                        "id": 13248,
                        "code": "512022",
                        "name": "乐至县"
                    }
                ]
            },
            {
                "id": 1067,
                "code": "513200",
                "name": "阿坝",
                "children": [
                    {
                        "id": 13081,
                        "code": "513201",
                        "name": "马尔康县"
                    },
                    {
                        "id": 13086,
                        "code": "513221",
                        "name": "汶川县"
                    },
                    {
                        "id": 13080,
                        "code": "513222",
                        "name": "理县"
                    },
                    {
                        "id": 13082,
                        "code": "513223",
                        "name": "茂县"
                    },
                    {
                        "id": 13085,
                        "code": "513224",
                        "name": "松潘县"
                    },
                    {
                        "id": 13079,
                        "code": "513225",
                        "name": "九寨沟县"
                    },
                    {
                        "id": 13078,
                        "code": "513226",
                        "name": "金川县"
                    },
                    {
                        "id": 13087,
                        "code": "513227",
                        "name": "小金县"
                    },
                    {
                        "id": 13076,
                        "code": "513228",
                        "name": "黑水县"
                    },
                    {
                        "id": 13083,
                        "code": "513230",
                        "name": "壤塘县"
                    },
                    {
                        "id": 13075,
                        "code": "513231",
                        "name": "阿坝县"
                    },
                    {
                        "id": 13084,
                        "code": "513232",
                        "name": "若尔盖县"
                    },
                    {
                        "id": 13077,
                        "code": "513233",
                        "name": "红原县"
                    }
                ]
            },
            {
                "id": 1072,
                "code": "513300",
                "name": "甘孜",
                "children": [
                    {
                        "id": 13135,
                        "code": "513301",
                        "name": "康定县"
                    },
                    {
                        "id": 13138,
                        "code": "513322",
                        "name": "泸定县"
                    },
                    {
                        "id": 13128,
                        "code": "513323",
                        "name": "丹巴县"
                    },
                    {
                        "id": 13134,
                        "code": "513324",
                        "name": "九龙县"
                    },
                    {
                        "id": 13143,
                        "code": "513325",
                        "name": "雅江县"
                    },
                    {
                        "id": 13129,
                        "code": "513326",
                        "name": "道孚县"
                    },
                    {
                        "id": 13137,
                        "code": "513327",
                        "name": "炉霍县"
                    },
                    {
                        "id": 13133,
                        "code": "513328",
                        "name": "甘孜县"
                    },
                    {
                        "id": 13142,
                        "code": "513329",
                        "name": "新龙县"
                    },
                    {
                        "id": 13132,
                        "code": "513330",
                        "name": "德格县"
                    },
                    {
                        "id": 13127,
                        "code": "513331",
                        "name": "白玉县"
                    },
                    {
                        "id": 13140,
                        "code": "513332",
                        "name": "石渠县"
                    },
                    {
                        "id": 13139,
                        "code": "513333",
                        "name": "色达县"
                    },
                    {
                        "id": 13136,
                        "code": "513334",
                        "name": "理塘县"
                    },
                    {
                        "id": 13126,
                        "code": "513335",
                        "name": "巴塘县"
                    },
                    {
                        "id": 13141,
                        "code": "513336",
                        "name": "乡城县"
                    },
                    {
                        "id": 13130,
                        "code": "513337",
                        "name": "稻城县"
                    },
                    {
                        "id": 13131,
                        "code": "513338",
                        "name": "得荣县"
                    }
                ]
            },
            {
                "id": 1076,
                "code": "513400",
                "name": "凉山",
                "children": [
                    {
                        "id": 13179,
                        "code": "513401",
                        "name": "西昌市"
                    },
                    {
                        "id": 13176,
                        "code": "513422",
                        "name": "木里藏族自治县"
                    },
                    {
                        "id": 13181,
                        "code": "513423",
                        "name": "盐源县"
                    },
                    {
                        "id": 13168,
                        "code": "513424",
                        "name": "德昌县"
                    },
                    {
                        "id": 13171,
                        "code": "513425",
                        "name": "会理县"
                    },
                    {
                        "id": 13170,
                        "code": "513426",
                        "name": "会东县"
                    },
                    {
                        "id": 13177,
                        "code": "513427",
                        "name": "宁南县"
                    },
                    {
                        "id": 13178,
                        "code": "513428",
                        "name": "普格县"
                    },
                    {
                        "id": 13167,
                        "code": "513429",
                        "name": "布拖县"
                    },
                    {
                        "id": 13172,
                        "code": "513430",
                        "name": "金阳县"
                    },
                    {
                        "id": 13183,
                        "code": "513431",
                        "name": "昭觉县"
                    },
                    {
                        "id": 13180,
                        "code": "513432",
                        "name": "喜德县"
                    },
                    {
                        "id": 13175,
                        "code": "513433",
                        "name": "冕宁县"
                    },
                    {
                        "id": 13182,
                        "code": "513434",
                        "name": "越西县"
                    },
                    {
                        "id": 13169,
                        "code": "513435",
                        "name": "甘洛县"
                    },
                    {
                        "id": 13174,
                        "code": "513436",
                        "name": "美姑县"
                    },
                    {
                        "id": 13173,
                        "code": "513437",
                        "name": "雷波县"
                    }
                ]
            }
        ]
    },
    {
        "id": 43,
        "code": "520000",
        "name": "贵州",
        "children": [
            {
                "id": 858,
                "code": "520100",
                "name": "贵阳",
                "children": [
                    {
                        "id": 11429,
                        "code": "520102",
                        "name": "南明区"
                    },
                    {
                        "id": 11434,
                        "code": "520103",
                        "name": "云岩区"
                    },
                    {
                        "id": 11427,
                        "code": "520111",
                        "name": "花溪区"
                    },
                    {
                        "id": 11431,
                        "code": "520112",
                        "name": "乌当区"
                    },
                    {
                        "id": 13834,
                        "code": "520113",
                        "name": "白云区"
                    },
                    {
                        "id": 11426,
                        "code": "520115",
                        "name": "观山湖区"
                    },
                    {
                        "id": 11428,
                        "code": "520121",
                        "name": "开阳县"
                    },
                    {
                        "id": 11432,
                        "code": "520122",
                        "name": "息烽县"
                    },
                    {
                        "id": 11433,
                        "code": "520123",
                        "name": "修文县"
                    },
                    {
                        "id": 11430,
                        "code": "520181",
                        "name": "清镇市"
                    }
                ]
            },
            {
                "id": 859,
                "code": "520200",
                "name": "六盘水",
                "children": [
                    {
                        "id": 11438,
                        "code": "520201",
                        "name": "钟山区"
                    },
                    {
                        "id": 11435,
                        "code": "520203",
                        "name": "六枝特区"
                    },
                    {
                        "id": 11437,
                        "code": "520221",
                        "name": "水城县"
                    },
                    {
                        "id": 11436,
                        "code": "520281",
                        "name": "盘州市"
                    }
                ]
            },
            {
                "id": 864,
                "code": "520300",
                "name": "遵义",
                "children": [
                    {
                        "id": 11489,
                        "code": "520302",
                        "name": "红花岗区"
                    },
                    {
                        "id": 11490,
                        "code": "520303",
                        "name": "汇川区"
                    },
                    {
                        "id": 11485,
                        "code": "520304",
                        "name": "播州区"
                    },
                    {
                        "id": 11494,
                        "code": "520322",
                        "name": "桐梓县"
                    },
                    {
                        "id": 11493,
                        "code": "520323",
                        "name": "绥阳县"
                    },
                    {
                        "id": 11498,
                        "code": "520324",
                        "name": "正安县"
                    },
                    {
                        "id": 11487,
                        "code": "520325",
                        "name": "道真仡佬族苗族自治县"
                    },
                    {
                        "id": 11495,
                        "code": "520326",
                        "name": "务川仡佬族苗族自治县"
                    },
                    {
                        "id": 11488,
                        "code": "520327",
                        "name": "凤冈县"
                    },
                    {
                        "id": 11491,
                        "code": "520328",
                        "name": "湄潭县"
                    },
                    {
                        "id": 11497,
                        "code": "520329",
                        "name": "余庆县"
                    },
                    {
                        "id": 11496,
                        "code": "520330",
                        "name": "习水县"
                    },
                    {
                        "id": 11486,
                        "code": "520381",
                        "name": "赤水市"
                    },
                    {
                        "id": 11492,
                        "code": "520382",
                        "name": "仁怀市"
                    }
                ]
            },
            {
                "id": 856,
                "code": "520400",
                "name": "安顺",
                "children": [
                    {
                        "id": 11415,
                        "code": "520402",
                        "name": "西秀区"
                    },
                    {
                        "id": 11413,
                        "code": "520403",
                        "name": "平坝县"
                    },
                    {
                        "id": 11414,
                        "code": "520422",
                        "name": "普定县"
                    },
                    {
                        "id": 11416,
                        "code": "520423",
                        "name": "镇宁布依族苗族自治县"
                    },
                    {
                        "id": 11412,
                        "code": "520424",
                        "name": "关岭布依族苗族自治县"
                    },
                    {
                        "id": 11417,
                        "code": "520425",
                        "name": "紫云苗族布依族自治县"
                    }
                ]
            },
            {
                "id": 857,
                "code": "520500",
                "name": "毕节",
                "children": [
                    {
                        "id": 11422,
                        "code": "520502",
                        "name": "七星关区"
                    },
                    {
                        "id": 11418,
                        "code": "520521",
                        "name": "大方县"
                    },
                    {
                        "id": 11423,
                        "code": "520522",
                        "name": "黔西县"
                    },
                    {
                        "id": 11420,
                        "code": "520523",
                        "name": "金沙县"
                    },
                    {
                        "id": 11425,
                        "code": "520524",
                        "name": "织金县"
                    },
                    {
                        "id": 11421,
                        "code": "520525",
                        "name": "纳雍县"
                    },
                    {
                        "id": 11424,
                        "code": "520526",
                        "name": "威宁彝族回族苗族自治县"
                    },
                    {
                        "id": 11419,
                        "code": "520527",
                        "name": "赫章县"
                    }
                ]
            },
            {
                "id": 863,
                "code": "520600",
                "name": "铜仁",
                "children": [
                    {
                        "id": 11475,
                        "code": "520602",
                        "name": "碧江区"
                    },
                    {
                        "id": 11481,
                        "code": "520603",
                        "name": "万山区"
                    },
                    {
                        "id": 11477,
                        "code": "520621",
                        "name": "江口县"
                    },
                    {
                        "id": 11484,
                        "code": "520622",
                        "name": "玉屏侗族自治县"
                    },
                    {
                        "id": 11478,
                        "code": "520623",
                        "name": "石阡县"
                    },
                    {
                        "id": 11479,
                        "code": "520624",
                        "name": "思南县"
                    },
                    {
                        "id": 11483,
                        "code": "520625",
                        "name": "印江土家族苗族自治县"
                    },
                    {
                        "id": 11476,
                        "code": "520626",
                        "name": "德江县"
                    },
                    {
                        "id": 11482,
                        "code": "520627",
                        "name": "沿河土家族自治县"
                    },
                    {
                        "id": 11480,
                        "code": "520628",
                        "name": "松桃苗族自治县"
                    }
                ]
            },
            {
                "id": 862,
                "code": "522300",
                "name": "黔西南",
                "children": [
                    {
                        "id": 11473,
                        "code": "522301",
                        "name": "兴义市"
                    },
                    {
                        "id": 11472,
                        "code": "522302",
                        "name": "兴仁县"
                    },
                    {
                        "id": 11469,
                        "code": "522323",
                        "name": "普安县"
                    },
                    {
                        "id": 11470,
                        "code": "522324",
                        "name": "晴隆县"
                    },
                    {
                        "id": 11474,
                        "code": "522325",
                        "name": "贞丰县"
                    },
                    {
                        "id": 11471,
                        "code": "522326",
                        "name": "望谟县"
                    },
                    {
                        "id": 11468,
                        "code": "522327",
                        "name": "册亨县"
                    },
                    {
                        "id": 11467,
                        "code": "522328",
                        "name": "安龙县"
                    }
                ]
            },
            {
                "id": 860,
                "code": "522600",
                "name": "黔东南",
                "children": [
                    {
                        "id": 11445,
                        "code": "522601",
                        "name": "凯里市"
                    },
                    {
                        "id": 11442,
                        "code": "522622",
                        "name": "黄平县"
                    },
                    {
                        "id": 11451,
                        "code": "522623",
                        "name": "施秉县"
                    },
                    {
                        "id": 11450,
                        "code": "522624",
                        "name": "三穗县"
                    },
                    {
                        "id": 11454,
                        "code": "522625",
                        "name": "镇远县"
                    },
                    {
                        "id": 11439,
                        "code": "522626",
                        "name": "岑巩县"
                    },
                    {
                        "id": 11453,
                        "code": "522627",
                        "name": "天柱县"
                    },
                    {
                        "id": 11444,
                        "code": "522628",
                        "name": "锦屏县"
                    },
                    {
                        "id": 11443,
                        "code": "522629",
                        "name": "剑河县"
                    },
                    {
                        "id": 11452,
                        "code": "522630",
                        "name": "台江县"
                    },
                    {
                        "id": 11447,
                        "code": "522631",
                        "name": "黎平县"
                    },
                    {
                        "id": 11449,
                        "code": "522632",
                        "name": "榕江县"
                    },
                    {
                        "id": 11440,
                        "code": "522633",
                        "name": "从江县"
                    },
                    {
                        "id": 11446,
                        "code": "522634",
                        "name": "雷山县"
                    },
                    {
                        "id": 11448,
                        "code": "522635",
                        "name": "麻江县"
                    },
                    {
                        "id": 11441,
                        "code": "522636",
                        "name": "丹寨县"
                    }
                ]
            },
            {
                "id": 861,
                "code": "522700",
                "name": "黔南",
                "children": [
                    {
                        "id": 11455,
                        "code": "522701",
                        "name": "都匀市"
                    },
                    {
                        "id": 11457,
                        "code": "522702",
                        "name": "福泉市"
                    },
                    {
                        "id": 11460,
                        "code": "522722",
                        "name": "荔波县"
                    },
                    {
                        "id": 11458,
                        "code": "522723",
                        "name": "贵定县"
                    },
                    {
                        "id": 11465,
                        "code": "522725",
                        "name": "瓮安县"
                    },
                    {
                        "id": 11456,
                        "code": "522726",
                        "name": "独山县"
                    },
                    {
                        "id": 11463,
                        "code": "522727",
                        "name": "平塘县"
                    },
                    {
                        "id": 11462,
                        "code": "522728",
                        "name": "罗甸县"
                    },
                    {
                        "id": 11466,
                        "code": "522729",
                        "name": "长顺县"
                    },
                    {
                        "id": 11461,
                        "code": "522730",
                        "name": "龙里县"
                    },
                    {
                        "id": 11459,
                        "code": "522731",
                        "name": "惠水县"
                    },
                    {
                        "id": 11464,
                        "code": "522732",
                        "name": "三都水族自治县"
                    }
                ]
            }
        ]
    },
    {
        "id": 67,
        "code": "530000",
        "name": "云南",
        "children": [
            {
                "id": 1147,
                "code": "530100",
                "name": "昆明",
                "children": [
                    {
                        "id": 13675,
                        "code": "530102",
                        "name": "五华区"
                    },
                    {
                        "id": 13672,
                        "code": "530103",
                        "name": "盘龙区"
                    },
                    {
                        "id": 13669,
                        "code": "530111",
                        "name": "官渡区"
                    },
                    {
                        "id": 13676,
                        "code": "530112",
                        "name": "西山区"
                    },
                    {
                        "id": 13667,
                        "code": "530113",
                        "name": "东川区"
                    },
                    {
                        "id": 13666,
                        "code": "530114",
                        "name": "呈贡县"
                    },
                    {
                        "id": 13670,
                        "code": "530115",
                        "name": "晋宁县"
                    },
                    {
                        "id": 13668,
                        "code": "530124",
                        "name": "富民县"
                    },
                    {
                        "id": 13678,
                        "code": "530125",
                        "name": "宜良县"
                    },
                    {
                        "id": 13673,
                        "code": "530126",
                        "name": "石林彝族自治县"
                    },
                    {
                        "id": 13674,
                        "code": "530127",
                        "name": "嵩明县"
                    },
                    {
                        "id": 13671,
                        "code": "530128",
                        "name": "禄劝彝族苗族自治县"
                    },
                    {
                        "id": 13677,
                        "code": "530129",
                        "name": "寻甸回族彝族自治县"
                    },
                    {
                        "id": 13665,
                        "code": "530181",
                        "name": "安宁市"
                    }
                ]
            },
            {
                "id": 1152,
                "code": "530300",
                "name": "曲靖",
                "children": [
                    {
                        "id": 13711,
                        "code": "530302",
                        "name": "麒麟区"
                    },
                    {
                        "id": 13714,
                        "code": "530303",
                        "name": "沾益县"
                    },
                    {
                        "id": 13710,
                        "code": "530304",
                        "name": "马龙县"
                    },
                    {
                        "id": 13708,
                        "code": "530322",
                        "name": "陆良县"
                    },
                    {
                        "id": 13712,
                        "code": "530323",
                        "name": "师宗县"
                    },
                    {
                        "id": 13709,
                        "code": "530324",
                        "name": "罗平县"
                    },
                    {
                        "id": 13706,
                        "code": "530325",
                        "name": "富源县"
                    },
                    {
                        "id": 13707,
                        "code": "530326",
                        "name": "会泽县"
                    },
                    {
                        "id": 13713,
                        "code": "530381",
                        "name": "宣威市"
                    }
                ]
            },
            {
                "id": 1155,
                "code": "530400",
                "name": "玉溪",
                "children": [
                    {
                        "id": 13728,
                        "code": "530402",
                        "name": "红塔区"
                    },
                    {
                        "id": 13730,
                        "code": "530403",
                        "name": "江川县"
                    },
                    {
                        "id": 13731,
                        "code": "530423",
                        "name": "通海县"
                    },
                    {
                        "id": 13729,
                        "code": "530424",
                        "name": "华宁县"
                    },
                    {
                        "id": 13733,
                        "code": "530425",
                        "name": "易门县"
                    },
                    {
                        "id": 13727,
                        "code": "530426",
                        "name": "峨山彝族自治县"
                    },
                    {
                        "id": 13732,
                        "code": "530427",
                        "name": "新平彝族傣族自治县"
                    },
                    {
                        "id": 13734,
                        "code": "530428",
                        "name": "元江哈尼族彝族傣族自治县"
                    },
                    {
                        "id": 13726,
                        "code": "530481",
                        "name": "澄江县"
                    }
                ]
            },
            {
                "id": 1141,
                "code": "530500",
                "name": "保山",
                "children": [
                    {
                        "id": 13619,
                        "code": "530502",
                        "name": "隆阳区"
                    },
                    {
                        "id": 13620,
                        "code": "530521",
                        "name": "施甸县"
                    },
                    {
                        "id": 13618,
                        "code": "530523",
                        "name": "龙陵县"
                    },
                    {
                        "id": 13617,
                        "code": "530524",
                        "name": "昌宁县"
                    },
                    {
                        "id": 13621,
                        "code": "530581",
                        "name": "腾冲县"
                    }
                ]
            },
            {
                "id": 1156,
                "code": "530600",
                "name": "昭通",
                "children": [
                    {
                        "id": 13744,
                        "code": "530602",
                        "name": "昭阳区"
                    },
                    {
                        "id": 13736,
                        "code": "530621",
                        "name": "鲁甸县"
                    },
                    {
                        "id": 13737,
                        "code": "530622",
                        "name": "巧家县"
                    },
                    {
                        "id": 13741,
                        "code": "530623",
                        "name": "盐津县"
                    },
                    {
                        "id": 13735,
                        "code": "530624",
                        "name": "大关县"
                    },
                    {
                        "id": 13743,
                        "code": "530625",
                        "name": "永善县"
                    },
                    {
                        "id": 13739,
                        "code": "530626",
                        "name": "绥江县"
                    },
                    {
                        "id": 13745,
                        "code": "530627",
                        "name": "镇雄县"
                    },
                    {
                        "id": 13742,
                        "code": "530628",
                        "name": "彝良县"
                    },
                    {
                        "id": 13740,
                        "code": "530629",
                        "name": "威信县"
                    },
                    {
                        "id": 13738,
                        "code": "530681",
                        "name": "水富县"
                    }
                ]
            },
            {
                "id": 1148,
                "code": "530700",
                "name": "丽江",
                "children": [
                    {
                        "id": 13679,
                        "code": "530702",
                        "name": "古城区"
                    },
                    {
                        "id": 13683,
                        "code": "530721",
                        "name": "玉龙纳西族自治县"
                    },
                    {
                        "id": 13682,
                        "code": "530722",
                        "name": "永胜县"
                    },
                    {
                        "id": 13680,
                        "code": "530723",
                        "name": "华坪县"
                    },
                    {
                        "id": 13681,
                        "code": "530724",
                        "name": "宁蒗彝族自治县"
                    }
                ]
            },
            {
                "id": 1151,
                "code": "530800",
                "name": "普洱",
                "children": [
                    {
                        "id": 13703,
                        "code": "530802",
                        "name": "思茅区"
                    },
                    {
                        "id": 13702,
                        "code": "530821",
                        "name": "宁洱哈尼族彝族自治县"
                    },
                    {
                        "id": 13701,
                        "code": "530822",
                        "name": "墨江哈尼族自治县"
                    },
                    {
                        "id": 13697,
                        "code": "530823",
                        "name": "景东彝族自治县"
                    },
                    {
                        "id": 13698,
                        "code": "530824",
                        "name": "景谷傣族彝族自治县"
                    },
                    {
                        "id": 13705,
                        "code": "530825",
                        "name": "镇沅彝族哈尼族拉祜族自治县"
                    },
                    {
                        "id": 13696,
                        "code": "530826",
                        "name": "江城哈尼族彝族自治县"
                    },
                    {
                        "id": 13700,
                        "code": "530827",
                        "name": "孟连傣族拉祜族佤族自治县"
                    },
                    {
                        "id": 13699,
                        "code": "530828",
                        "name": "澜沧拉祜族自治县"
                    },
                    {
                        "id": 13704,
                        "code": "530829",
                        "name": "西盟佤族自治县"
                    }
                ]
            },
            {
                "id": 1149,
                "code": "530900",
                "name": "临沧",
                "children": [
                    {
                        "id": 13687,
                        "code": "530902",
                        "name": "临翔区"
                    },
                    {
                        "id": 13685,
                        "code": "530921",
                        "name": "凤庆县"
                    },
                    {
                        "id": 13690,
                        "code": "530922",
                        "name": "云县"
                    },
                    {
                        "id": 13689,
                        "code": "530923",
                        "name": "永德县"
                    },
                    {
                        "id": 13691,
                        "code": "530924",
                        "name": "镇康县"
                    },
                    {
                        "id": 13688,
                        "code": "530925",
                        "name": "双江拉祜族佤族布朗族傣族自治县"
                    },
                    {
                        "id": 13686,
                        "code": "530926",
                        "name": "耿马傣族佤族自治县"
                    },
                    {
                        "id": 13684,
                        "code": "530927",
                        "name": "沧源佤族自治县"
                    }
                ]
            },
            {
                "id": 1142,
                "code": "532300",
                "name": "楚雄",
                "children": [
                    {
                        "id": 13622,
                        "code": "532301",
                        "name": "楚雄市"
                    },
                    {
                        "id": 13627,
                        "code": "532322",
                        "name": "双柏县"
                    },
                    {
                        "id": 13625,
                        "code": "532323",
                        "name": "牟定县"
                    },
                    {
                        "id": 13626,
                        "code": "532324",
                        "name": "南华县"
                    },
                    {
                        "id": 13629,
                        "code": "532325",
                        "name": "姚安县"
                    },
                    {
                        "id": 13623,
                        "code": "532326",
                        "name": "大姚县"
                    },
                    {
                        "id": 13630,
                        "code": "532327",
                        "name": "永仁县"
                    },
                    {
                        "id": 13631,
                        "code": "532328",
                        "name": "元谋县"
                    },
                    {
                        "id": 13628,
                        "code": "532329",
                        "name": "武定县"
                    },
                    {
                        "id": 13624,
                        "code": "532331",
                        "name": "禄丰县"
                    }
                ]
            },
            {
                "id": 1146,
                "code": "532500",
                "name": "红河",
                "children": [
                    {
                        "id": 13652,
                        "code": "532501",
                        "name": "个旧市"
                    },
                    {
                        "id": 13657,
                        "code": "532502",
                        "name": "开远市"
                    },
                    {
                        "id": 13660,
                        "code": "532503",
                        "name": "蒙自县"
                    },
                    {
                        "id": 13661,
                        "code": "532504",
                        "name": "弥勒县"
                    },
                    {
                        "id": 13662,
                        "code": "532523",
                        "name": "屏边苗族自治县"
                    },
                    {
                        "id": 13655,
                        "code": "532524",
                        "name": "建水县"
                    },
                    {
                        "id": 13663,
                        "code": "532525",
                        "name": "石屏县"
                    },
                    {
                        "id": 13658,
                        "code": "532527",
                        "name": "泸西县"
                    },
                    {
                        "id": 13664,
                        "code": "532528",
                        "name": "元阳县"
                    },
                    {
                        "id": 13654,
                        "code": "532529",
                        "name": "红河县"
                    },
                    {
                        "id": 13656,
                        "code": "532530",
                        "name": "金平苗族瑶族傣族自治县"
                    },
                    {
                        "id": 13659,
                        "code": "532531",
                        "name": "绿春县"
                    },
                    {
                        "id": 13653,
                        "code": "532532",
                        "name": "河口瑶族自治县"
                    }
                ]
            },
            {
                "id": 1153,
                "code": "532600",
                "name": "文山",
                "children": [
                    {
                        "id": 13720,
                        "code": "532601",
                        "name": "文山县"
                    },
                    {
                        "id": 13722,
                        "code": "532622",
                        "name": "砚山县"
                    },
                    {
                        "id": 13721,
                        "code": "532623",
                        "name": "西畴县"
                    },
                    {
                        "id": 13717,
                        "code": "532624",
                        "name": "麻栗坡县"
                    },
                    {
                        "id": 13718,
                        "code": "532625",
                        "name": "马关县"
                    },
                    {
                        "id": 13719,
                        "code": "532626",
                        "name": "丘北县"
                    },
                    {
                        "id": 13716,
                        "code": "532627",
                        "name": "广南县"
                    },
                    {
                        "id": 13715,
                        "code": "532628",
                        "name": "富宁县"
                    }
                ]
            },
            {
                "id": 1154,
                "code": "532800",
                "name": "西双版纳",
                "children": [
                    {
                        "id": 13723,
                        "code": "532801",
                        "name": "景洪市"
                    },
                    {
                        "id": 13724,
                        "code": "532822",
                        "name": "勐海县"
                    },
                    {
                        "id": 13725,
                        "code": "532823",
                        "name": "勐腊县"
                    }
                ]
            },
            {
                "id": 1143,
                "code": "532900",
                "name": "大理",
                "children": [
                    {
                        "id": 13633,
                        "code": "532901",
                        "name": "大理市"
                    },
                    {
                        "id": 13641,
                        "code": "532922",
                        "name": "漾濞彝族自治县"
                    },
                    {
                        "id": 13640,
                        "code": "532923",
                        "name": "祥云县"
                    },
                    {
                        "id": 13632,
                        "code": "532924",
                        "name": "宾川县"
                    },
                    {
                        "id": 13637,
                        "code": "532925",
                        "name": "弥渡县"
                    },
                    {
                        "id": 13638,
                        "code": "532926",
                        "name": "南涧彝族自治县"
                    },
                    {
                        "id": 13639,
                        "code": "532927",
                        "name": "巍山彝族回族自治县"
                    },
                    {
                        "id": 13642,
                        "code": "532928",
                        "name": "永平县"
                    },
                    {
                        "id": 13643,
                        "code": "532929",
                        "name": "云龙县"
                    },
                    {
                        "id": 13634,
                        "code": "532930",
                        "name": "洱源县"
                    },
                    {
                        "id": 13636,
                        "code": "532931",
                        "name": "剑川县"
                    },
                    {
                        "id": 13635,
                        "code": "532932",
                        "name": "鹤庆县"
                    }
                ]
            },
            {
                "id": 1144,
                "code": "533100",
                "name": "德宏",
                "children": [
                    {
                        "id": 13647,
                        "code": "533102",
                        "name": "瑞丽市"
                    },
                    {
                        "id": 13646,
                        "code": "533103",
                        "name": "芒市"
                    },
                    {
                        "id": 13644,
                        "code": "533122",
                        "name": "梁河县"
                    },
                    {
                        "id": 13648,
                        "code": "533123",
                        "name": "盈江县"
                    },
                    {
                        "id": 13645,
                        "code": "533124",
                        "name": "陇川县"
                    }
                ]
            },
            {
                "id": 1150,
                "code": "533300",
                "name": "怒江傈",
                "children": [
                    {
                        "id": 13695,
                        "code": "533301",
                        "name": "泸水县"
                    },
                    {
                        "id": 13692,
                        "code": "533323",
                        "name": "福贡县"
                    },
                    {
                        "id": 13693,
                        "code": "533324",
                        "name": "贡山独龙族怒族自治县"
                    },
                    {
                        "id": 13694,
                        "code": "533325",
                        "name": "兰坪白族普米族自治县"
                    }
                ]
            },
            {
                "id": 1145,
                "code": "533400",
                "name": "迪庆",
                "children": [
                    {
                        "id": 13651,
                        "code": "533401",
                        "name": "香格里拉县"
                    },
                    {
                        "id": 13649,
                        "code": "533422",
                        "name": "德钦县"
                    },
                    {
                        "id": 13650,
                        "code": "533423",
                        "name": "维西傈僳族自治县"
                    }
                ]
            }
        ]
    },
    {
        "id": 65,
        "code": "540000",
        "name": "西藏",
        "children": [
            {
                "id": 1111,
                "code": "540100",
                "name": "拉萨",
                "children": [
                    {
                        "id": 13881,
                        "code": "540102",
                        "name": "城关区"
                    },
                    {
                        "id": 13445,
                        "code": "540103",
                        "name": "堆龙德庆县"
                    },
                    {
                        "id": 13443,
                        "code": "540104",
                        "name": "达孜县"
                    },
                    {
                        "id": 13446,
                        "code": "540121",
                        "name": "林周县"
                    },
                    {
                        "id": 13444,
                        "code": "540122",
                        "name": "当雄县"
                    },
                    {
                        "id": 13448,
                        "code": "540123",
                        "name": "尼木县"
                    },
                    {
                        "id": 13449,
                        "code": "540124",
                        "name": "曲水县"
                    },
                    {
                        "id": 13447,
                        "code": "540127",
                        "name": "墨竹工卡县"
                    }
                ]
            },
            {
                "id": 1114,
                "code": "540200",
                "name": "日喀则",
                "children": [
                    {
                        "id": 13482,
                        "code": "540202",
                        "name": "桑珠孜区"
                    },
                    {
                        "id": 13477,
                        "code": "540221",
                        "name": "南木林县"
                    },
                    {
                        "id": 13474,
                        "code": "540222",
                        "name": "江孜县"
                    },
                    {
                        "id": 13471,
                        "code": "540223",
                        "name": "定日县"
                    },
                    {
                        "id": 13481,
                        "code": "540224",
                        "name": "萨迦县"
                    },
                    {
                        "id": 13476,
                        "code": "540225",
                        "name": "拉孜县"
                    },
                    {
                        "id": 13468,
                        "code": "540226",
                        "name": "昂仁县"
                    },
                    {
                        "id": 13483,
                        "code": "540227",
                        "name": "谢通门县"
                    },
                    {
                        "id": 13469,
                        "code": "540228",
                        "name": "白朗县"
                    },
                    {
                        "id": 13479,
                        "code": "540229",
                        "name": "仁布县"
                    },
                    {
                        "id": 13475,
                        "code": "540230",
                        "name": "康马县"
                    },
                    {
                        "id": 13470,
                        "code": "540231",
                        "name": "定结县"
                    },
                    {
                        "id": 13485,
                        "code": "540232",
                        "name": "仲巴县"
                    },
                    {
                        "id": 13484,
                        "code": "540233",
                        "name": "亚东县"
                    },
                    {
                        "id": 13473,
                        "code": "540234",
                        "name": "吉隆县"
                    },
                    {
                        "id": 13478,
                        "code": "540235",
                        "name": "聂拉木县"
                    },
                    {
                        "id": 13480,
                        "code": "540236",
                        "name": "萨嘎县"
                    },
                    {
                        "id": 13472,
                        "code": "540237",
                        "name": "岗巴县"
                    }
                ]
            },
            {
                "id": 1110,
                "code": "540300",
                "name": "昌都",
                "children": [
                    {
                        "id": 13438,
                        "code": "540302",
                        "name": "卡若区"
                    },
                    {
                        "id": 13437,
                        "code": "540321",
                        "name": "江达县"
                    },
                    {
                        "id": 13436,
                        "code": "540322",
                        "name": "贡觉县"
                    },
                    {
                        "id": 13439,
                        "code": "540323",
                        "name": "类乌齐县"
                    },
                    {
                        "id": 13435,
                        "code": "540324",
                        "name": "丁青县"
                    },
                    {
                        "id": 13434,
                        "code": "540325",
                        "name": "察雅县"
                    },
                    {
                        "id": 13432,
                        "code": "540326",
                        "name": "八宿县"
                    },
                    {
                        "id": 13442,
                        "code": "540327",
                        "name": "左贡县"
                    },
                    {
                        "id": 13441,
                        "code": "540328",
                        "name": "芒康县"
                    },
                    {
                        "id": 13440,
                        "code": "540329",
                        "name": "洛隆县"
                    },
                    {
                        "id": 13433,
                        "code": "540330",
                        "name": "边坝县"
                    }
                ]
            },
            {
                "id": 1112,
                "code": "540400",
                "name": "林芝",
                "children": [
                    {
                        "id": 13450,
                        "code": "540402",
                        "name": "巴宜区"
                    },
                    {
                        "id": 13453,
                        "code": "540421",
                        "name": "工布江达县"
                    },
                    {
                        "id": 13455,
                        "code": "540422",
                        "name": "米林县"
                    },
                    {
                        "id": 13456,
                        "code": "540423",
                        "name": "墨脱县"
                    },
                    {
                        "id": 13451,
                        "code": "540424",
                        "name": "波密县"
                    },
                    {
                        "id": 13452,
                        "code": "540425",
                        "name": "察隅县"
                    },
                    {
                        "id": 13454,
                        "code": "540426",
                        "name": "朗县"
                    }
                ]
            },
            {
                "id": 1115,
                "code": "540500",
                "name": "山南",
                "children": [
                    {
                        "id": 13493,
                        "code": "540502",
                        "name": "乃东县"
                    },
                    {
                        "id": 13497,
                        "code": "540521",
                        "name": "扎囊县"
                    },
                    {
                        "id": 13488,
                        "code": "540522",
                        "name": "贡嘎县"
                    },
                    {
                        "id": 13496,
                        "code": "540523",
                        "name": "桑日县"
                    },
                    {
                        "id": 13494,
                        "code": "540524",
                        "name": "琼结县"
                    },
                    {
                        "id": 13495,
                        "code": "540525",
                        "name": "曲松县"
                    },
                    {
                        "id": 13486,
                        "code": "540526",
                        "name": "措美县"
                    },
                    {
                        "id": 13492,
                        "code": "540527",
                        "name": "洛扎县"
                    },
                    {
                        "id": 13489,
                        "code": "540528",
                        "name": "加查县"
                    },
                    {
                        "id": 13491,
                        "code": "540529",
                        "name": "隆子县"
                    },
                    {
                        "id": 13487,
                        "code": "540530",
                        "name": "错那县"
                    },
                    {
                        "id": 13490,
                        "code": "540531",
                        "name": "浪卡子县"
                    }
                ]
            },
            {
                "id": 1113,
                "code": "540600",
                "name": "那曲",
                "children": [
                    {
                        "id": 13464,
                        "code": "540602",
                        "name": "色尼区"
                    },
                    {
                        "id": 13461,
                        "code": "540621",
                        "name": "嘉黎县"
                    },
                    {
                        "id": 13460,
                        "code": "540622",
                        "name": "比如县"
                    },
                    {
                        "id": 13463,
                        "code": "540623",
                        "name": "聂荣县"
                    },
                    {
                        "id": 13457,
                        "code": "540624",
                        "name": "安多县"
                    },
                    {
                        "id": 13465,
                        "code": "540625",
                        "name": "申扎县"
                    },
                    {
                        "id": 13467,
                        "code": "540626",
                        "name": "索县"
                    },
                    {
                        "id": 13459,
                        "code": "540627",
                        "name": "班戈县"
                    },
                    {
                        "id": 13458,
                        "code": "540628",
                        "name": "巴青县"
                    },
                    {
                        "id": 13462,
                        "code": "540629",
                        "name": "尼玛县"
                    },
                    {
                        "id": 13466,
                        "code": "540630",
                        "name": "双湖县"
                    }
                ]
            },
            {
                "id": 1109,
                "code": "542500",
                "name": "阿里",
                "children": [
                    {
                        "id": 13429,
                        "code": "542521",
                        "name": "普兰县"
                    },
                    {
                        "id": 13431,
                        "code": "542522",
                        "name": "札达县"
                    },
                    {
                        "id": 13426,
                        "code": "542523",
                        "name": "噶尔县"
                    },
                    {
                        "id": 13430,
                        "code": "542524",
                        "name": "日土县"
                    },
                    {
                        "id": 13428,
                        "code": "542525",
                        "name": "革吉县"
                    },
                    {
                        "id": 13427,
                        "code": "542526",
                        "name": "改则县"
                    },
                    {
                        "id": 13425,
                        "code": "542527",
                        "name": "措勤县"
                    }
                ]
            }
        ]
    },
    {
        "id": 60,
        "code": "610000",
        "name": "陕西",
        "children": [
            {
                "id": 1062,
                "code": "610100",
                "name": "西安",
                "children": [
                    {
                        "id": 13857,
                        "code": "610102",
                        "name": "新城区"
                    },
                    {
                        "id": 13011,
                        "code": "610103",
                        "name": "碑林区"
                    },
                    {
                        "id": 13015,
                        "code": "610104",
                        "name": "莲湖区"
                    },
                    {
                        "id": 13010,
                        "code": "610111",
                        "name": "灞桥区"
                    },
                    {
                        "id": 13017,
                        "code": "610112",
                        "name": "未央区"
                    },
                    {
                        "id": 13019,
                        "code": "610113",
                        "name": "雁塔区"
                    },
                    {
                        "id": 13018,
                        "code": "610114",
                        "name": "阎良区"
                    },
                    {
                        "id": 13016,
                        "code": "610115",
                        "name": "临潼区"
                    },
                    {
                        "id": 13858,
                        "code": "610116",
                        "name": "长安区"
                    },
                    {
                        "id": 13012,
                        "code": "610117",
                        "name": "高陵县"
                    },
                    {
                        "id": 13013,
                        "code": "610118",
                        "name": "鄠邑区"
                    },
                    {
                        "id": 13014,
                        "code": "610122",
                        "name": "蓝田县"
                    },
                    {
                        "id": 13020,
                        "code": "610124",
                        "name": "周至县"
                    }
                ]
            },
            {
                "id": 1060,
                "code": "610200",
                "name": "铜川",
                "children": [
                    {
                        "id": 12995,
                        "code": "610202",
                        "name": "王益区"
                    },
                    {
                        "id": 12998,
                        "code": "610203",
                        "name": "印台区"
                    },
                    {
                        "id": 12996,
                        "code": "610204",
                        "name": "耀州区"
                    },
                    {
                        "id": 12997,
                        "code": "610222",
                        "name": "宜君县"
                    }
                ]
            },
            {
                "id": 1057,
                "code": "610300",
                "name": "宝鸡",
                "children": [
                    {
                        "id": 12976,
                        "code": "610302",
                        "name": "渭滨区"
                    },
                    {
                        "id": 12969,
                        "code": "610303",
                        "name": "金台区"
                    },
                    {
                        "id": 12965,
                        "code": "610304",
                        "name": "陈仓区"
                    },
                    {
                        "id": 12967,
                        "code": "610322",
                        "name": "凤翔县"
                    },
                    {
                        "id": 12973,
                        "code": "610323",
                        "name": "岐山县"
                    },
                    {
                        "id": 12968,
                        "code": "610324",
                        "name": "扶风县"
                    },
                    {
                        "id": 12972,
                        "code": "610326",
                        "name": "眉县"
                    },
                    {
                        "id": 12971,
                        "code": "610327",
                        "name": "陇县"
                    },
                    {
                        "id": 12974,
                        "code": "610328",
                        "name": "千阳县"
                    },
                    {
                        "id": 12970,
                        "code": "610329",
                        "name": "麟游县"
                    },
                    {
                        "id": 12966,
                        "code": "610330",
                        "name": "凤县"
                    },
                    {
                        "id": 12975,
                        "code": "610331",
                        "name": "太白县"
                    }
                ]
            },
            {
                "id": 1063,
                "code": "610400",
                "name": "咸阳",
                "children": [
                    {
                        "id": 13027,
                        "code": "610402",
                        "name": "秦都区"
                    },
                    {
                        "id": 13033,
                        "code": "610403",
                        "name": "杨陵区"
                    },
                    {
                        "id": 13029,
                        "code": "610404",
                        "name": "渭城区"
                    },
                    {
                        "id": 13028,
                        "code": "610422",
                        "name": "三原县"
                    },
                    {
                        "id": 13024,
                        "code": "610423",
                        "name": "泾阳县"
                    },
                    {
                        "id": 13026,
                        "code": "610424",
                        "name": "乾县"
                    },
                    {
                        "id": 13025,
                        "code": "610425",
                        "name": "礼泉县"
                    },
                    {
                        "id": 13034,
                        "code": "610426",
                        "name": "永寿县"
                    },
                    {
                        "id": 13023,
                        "code": "610428",
                        "name": "长武县"
                    },
                    {
                        "id": 13032,
                        "code": "610429",
                        "name": "旬邑县"
                    },
                    {
                        "id": 13022,
                        "code": "610430",
                        "name": "淳化县"
                    },
                    {
                        "id": 13030,
                        "code": "610431",
                        "name": "武功县"
                    },
                    {
                        "id": 13031,
                        "code": "610481",
                        "name": "兴平市"
                    },
                    {
                        "id": 13021,
                        "code": "610482",
                        "name": "彬州市"
                    }
                ]
            },
            {
                "id": 1061,
                "code": "610500",
                "name": "渭南",
                "children": [
                    {
                        "id": 13007,
                        "code": "610502",
                        "name": "临渭区"
                    },
                    {
                        "id": 13006,
                        "code": "610503",
                        "name": "华州区"
                    },
                    {
                        "id": 13009,
                        "code": "610522",
                        "name": "潼关县"
                    },
                    {
                        "id": 13001,
                        "code": "610523",
                        "name": "大荔县"
                    },
                    {
                        "id": 13004,
                        "code": "610524",
                        "name": "合阳县"
                    },
                    {
                        "id": 13000,
                        "code": "610525",
                        "name": "澄城县"
                    },
                    {
                        "id": 13008,
                        "code": "610526",
                        "name": "蒲城县"
                    },
                    {
                        "id": 12999,
                        "code": "610527",
                        "name": "白水县"
                    },
                    {
                        "id": 13002,
                        "code": "610528",
                        "name": "富平县"
                    },
                    {
                        "id": 13003,
                        "code": "610581",
                        "name": "韩城市"
                    },
                    {
                        "id": 13005,
                        "code": "610582",
                        "name": "华阴市"
                    }
                ]
            },
            {
                "id": 1064,
                "code": "610600",
                "name": "延安",
                "children": [
                    {
                        "id": 13036,
                        "code": "610602",
                        "name": "宝塔区"
                    },
                    {
                        "id": 13035,
                        "code": "610603",
                        "name": "安塞县"
                    },
                    {
                        "id": 13044,
                        "code": "610621",
                        "name": "延长县"
                    },
                    {
                        "id": 13043,
                        "code": "610622",
                        "name": "延川县"
                    },
                    {
                        "id": 13046,
                        "code": "610625",
                        "name": "志丹县"
                    },
                    {
                        "id": 13042,
                        "code": "610626",
                        "name": "吴起县"
                    },
                    {
                        "id": 13038,
                        "code": "610627",
                        "name": "甘泉县"
                    },
                    {
                        "id": 13037,
                        "code": "610628",
                        "name": "富县"
                    },
                    {
                        "id": 13041,
                        "code": "610629",
                        "name": "洛川县"
                    },
                    {
                        "id": 13045,
                        "code": "610630",
                        "name": "宜川县"
                    },
                    {
                        "id": 13040,
                        "code": "610631",
                        "name": "黄龙县"
                    },
                    {
                        "id": 13039,
                        "code": "610632",
                        "name": "黄陵县"
                    },
                    {
                        "id": 13047,
                        "code": "610681",
                        "name": "子长县"
                    }
                ]
            },
            {
                "id": 1058,
                "code": "610700",
                "name": "汉中",
                "children": [
                    {
                        "id": 12979,
                        "code": "610702",
                        "name": "汉台区"
                    },
                    {
                        "id": 12983,
                        "code": "610703",
                        "name": "南郑县"
                    },
                    {
                        "id": 12977,
                        "code": "610722",
                        "name": "城固县"
                    },
                    {
                        "id": 12986,
                        "code": "610723",
                        "name": "洋县"
                    },
                    {
                        "id": 12985,
                        "code": "610724",
                        "name": "西乡县"
                    },
                    {
                        "id": 12982,
                        "code": "610725",
                        "name": "勉县"
                    },
                    {
                        "id": 12984,
                        "code": "610726",
                        "name": "宁强县"
                    },
                    {
                        "id": 12981,
                        "code": "610727",
                        "name": "略阳县"
                    },
                    {
                        "id": 12987,
                        "code": "610728",
                        "name": "镇巴县"
                    },
                    {
                        "id": 12980,
                        "code": "610729",
                        "name": "留坝县"
                    },
                    {
                        "id": 12978,
                        "code": "610730",
                        "name": "佛坪县"
                    }
                ]
            },
            {
                "id": 1065,
                "code": "610800",
                "name": "榆林",
                "children": [
                    {
                        "id": 13058,
                        "code": "610802",
                        "name": "榆阳区"
                    },
                    {
                        "id": 13050,
                        "code": "610803",
                        "name": "横山县"
                    },
                    {
                        "id": 13049,
                        "code": "610822",
                        "name": "府谷县"
                    },
                    {
                        "id": 13052,
                        "code": "610824",
                        "name": "靖边县"
                    },
                    {
                        "id": 13048,
                        "code": "610825",
                        "name": "定边县"
                    },
                    {
                        "id": 13056,
                        "code": "610826",
                        "name": "绥德县"
                    },
                    {
                        "id": 13053,
                        "code": "610827",
                        "name": "米脂县"
                    },
                    {
                        "id": 13051,
                        "code": "610828",
                        "name": "佳县"
                    },
                    {
                        "id": 13057,
                        "code": "610829",
                        "name": "吴堡县"
                    },
                    {
                        "id": 13054,
                        "code": "610830",
                        "name": "清涧县"
                    },
                    {
                        "id": 13059,
                        "code": "610831",
                        "name": "子洲县"
                    },
                    {
                        "id": 13055,
                        "code": "610881",
                        "name": "神木县"
                    }
                ]
            },
            {
                "id": 1056,
                "code": "610900",
                "name": "安康",
                "children": [
                    {
                        "id": 12956,
                        "code": "610902",
                        "name": "汉滨区"
                    },
                    {
                        "id": 12957,
                        "code": "610921",
                        "name": "汉阴县"
                    },
                    {
                        "id": 12961,
                        "code": "610922",
                        "name": "石泉县"
                    },
                    {
                        "id": 12959,
                        "code": "610923",
                        "name": "宁陕县"
                    },
                    {
                        "id": 12964,
                        "code": "610924",
                        "name": "紫阳县"
                    },
                    {
                        "id": 12958,
                        "code": "610925",
                        "name": "岚皋县"
                    },
                    {
                        "id": 12960,
                        "code": "610926",
                        "name": "平利县"
                    },
                    {
                        "id": 12963,
                        "code": "610927",
                        "name": "镇坪县"
                    },
                    {
                        "id": 12962,
                        "code": "610928",
                        "name": "旬阳县"
                    },
                    {
                        "id": 12955,
                        "code": "610929",
                        "name": "白河县"
                    }
                ]
            },
            {
                "id": 1059,
                "code": "611000",
                "name": "商洛",
                "children": [
                    {
                        "id": 12992,
                        "code": "611002",
                        "name": "商州区"
                    },
                    {
                        "id": 12989,
                        "code": "611021",
                        "name": "洛南县"
                    },
                    {
                        "id": 12988,
                        "code": "611022",
                        "name": "丹凤县"
                    },
                    {
                        "id": 12991,
                        "code": "611023",
                        "name": "商南县"
                    },
                    {
                        "id": 12990,
                        "code": "611024",
                        "name": "山阳县"
                    },
                    {
                        "id": 12994,
                        "code": "611025",
                        "name": "镇安县"
                    },
                    {
                        "id": 12993,
                        "code": "611026",
                        "name": "柞水县"
                    }
                ]
            }
        ]
    },
    {
        "id": 40,
        "code": "620000",
        "name": "甘肃",
        "children": [
            {
                "id": 813,
                "code": "620100",
                "name": "兰州",
                "children": [
                    {
                        "id": 11120,
                        "code": "620102",
                        "name": "城关区"
                    },
                    {
                        "id": 11123,
                        "code": "620103",
                        "name": "七里河区"
                    },
                    {
                        "id": 11124,
                        "code": "620104",
                        "name": "西固区"
                    },
                    {
                        "id": 11119,
                        "code": "620105",
                        "name": "安宁区"
                    },
                    {
                        "id": 11122,
                        "code": "620111",
                        "name": "红古区"
                    },
                    {
                        "id": 11125,
                        "code": "620121",
                        "name": "永登县"
                    },
                    {
                        "id": 11121,
                        "code": "620122",
                        "name": "皋兰县"
                    },
                    {
                        "id": 11126,
                        "code": "620123",
                        "name": "榆中县"
                    }
                ]
            },
            {
                "id": 810,
                "code": "620200",
                "name": "嘉峪关",
                "children": [
                    {
                        "id": 11109,
                        "code": "620200",
                        "name": "嘉峪关市"
                    }
                ]
            },
            {
                "id": 811,
                "code": "620300",
                "name": "金昌",
                "children": [
                    {
                        "id": 11110,
                        "code": "620302",
                        "name": "金川区"
                    },
                    {
                        "id": 11111,
                        "code": "620321",
                        "name": "永昌县"
                    }
                ]
            },
            {
                "id": 807,
                "code": "620400",
                "name": "白银",
                "children": [
                    {
                        "id": 11089,
                        "code": "620402",
                        "name": "白银区"
                    },
                    {
                        "id": 11093,
                        "code": "620403",
                        "name": "平川区"
                    },
                    {
                        "id": 11092,
                        "code": "620421",
                        "name": "靖远县"
                    },
                    {
                        "id": 11090,
                        "code": "620422",
                        "name": "会宁县"
                    },
                    {
                        "id": 11091,
                        "code": "620423",
                        "name": "景泰县"
                    }
                ]
            },
            {
                "id": 818,
                "code": "620500",
                "name": "天水",
                "children": [
                    {
                        "id": 11162,
                        "code": "620502",
                        "name": "秦州区"
                    },
                    {
                        "id": 11160,
                        "code": "620503",
                        "name": "麦积区"
                    },
                    {
                        "id": 11163,
                        "code": "620521",
                        "name": "清水县"
                    },
                    {
                        "id": 11161,
                        "code": "620522",
                        "name": "秦安县"
                    },
                    {
                        "id": 11159,
                        "code": "620523",
                        "name": "甘谷县"
                    },
                    {
                        "id": 11164,
                        "code": "620524",
                        "name": "武山县"
                    },
                    {
                        "id": 11165,
                        "code": "620525",
                        "name": "张家川回族自治县"
                    }
                ]
            },
            {
                "id": 819,
                "code": "620600",
                "name": "武威",
                "children": [
                    {
                        "id": 11167,
                        "code": "620602",
                        "name": "凉州区"
                    },
                    {
                        "id": 11168,
                        "code": "620621",
                        "name": "民勤县"
                    },
                    {
                        "id": 11166,
                        "code": "620622",
                        "name": "古浪县"
                    },
                    {
                        "id": 11169,
                        "code": "620623",
                        "name": "天祝藏族自治县"
                    }
                ]
            },
            {
                "id": 820,
                "code": "620700",
                "name": "张掖",
                "children": [
                    {
                        "id": 11170,
                        "code": "620702",
                        "name": "甘州区"
                    },
                    {
                        "id": 11175,
                        "code": "620721",
                        "name": "肃南裕固族自治县"
                    },
                    {
                        "id": 11173,
                        "code": "620722",
                        "name": "民乐县"
                    },
                    {
                        "id": 11172,
                        "code": "620723",
                        "name": "临泽县"
                    },
                    {
                        "id": 11171,
                        "code": "620724",
                        "name": "高台县"
                    },
                    {
                        "id": 11174,
                        "code": "620725",
                        "name": "山丹县"
                    }
                ]
            },
            {
                "id": 816,
                "code": "620800",
                "name": "平凉",
                "children": [
                    {
                        "id": 11148,
                        "code": "620802",
                        "name": "崆峒区"
                    },
                    {
                        "id": 11146,
                        "code": "620821",
                        "name": "泾川县"
                    },
                    {
                        "id": 11149,
                        "code": "620822",
                        "name": "灵台县"
                    },
                    {
                        "id": 11144,
                        "code": "620823",
                        "name": "崇信县"
                    },
                    {
                        "id": 11150,
                        "code": "620825",
                        "name": "庄浪县"
                    },
                    {
                        "id": 11147,
                        "code": "620826",
                        "name": "静宁县"
                    },
                    {
                        "id": 11145,
                        "code": "620881",
                        "name": "华亭县"
                    }
                ]
            },
            {
                "id": 812,
                "code": "620900",
                "name": "酒泉",
                "children": [
                    {
                        "id": 11117,
                        "code": "620902",
                        "name": "肃州区"
                    },
                    {
                        "id": 11115,
                        "code": "620921",
                        "name": "金塔县"
                    },
                    {
                        "id": 11114,
                        "code": "620922",
                        "name": "瓜州县"
                    },
                    {
                        "id": 11116,
                        "code": "620923",
                        "name": "肃北蒙古族自治县"
                    },
                    {
                        "id": 11112,
                        "code": "620924",
                        "name": "阿克塞哈萨克族自治县"
                    },
                    {
                        "id": 11118,
                        "code": "620981",
                        "name": "玉门市"
                    },
                    {
                        "id": 11113,
                        "code": "620982",
                        "name": "敦煌市"
                    }
                ]
            },
            {
                "id": 817,
                "code": "621000",
                "name": "庆阳",
                "children": [
                    {
                        "id": 11156,
                        "code": "621002",
                        "name": "西峰区"
                    },
                    {
                        "id": 11155,
                        "code": "621021",
                        "name": "庆城县"
                    },
                    {
                        "id": 11153,
                        "code": "621022",
                        "name": "环县"
                    },
                    {
                        "id": 11152,
                        "code": "621023",
                        "name": "华池县"
                    },
                    {
                        "id": 11151,
                        "code": "621024",
                        "name": "合水县"
                    },
                    {
                        "id": 11158,
                        "code": "621025",
                        "name": "正宁县"
                    },
                    {
                        "id": 11154,
                        "code": "621026",
                        "name": "宁县"
                    },
                    {
                        "id": 11157,
                        "code": "621027",
                        "name": "镇原县"
                    }
                ]
            },
            {
                "id": 808,
                "code": "621100",
                "name": "定西",
                "children": [
                    {
                        "id": 11094,
                        "code": "621102",
                        "name": "安定区"
                    },
                    {
                        "id": 11098,
                        "code": "621121",
                        "name": "通渭县"
                    },
                    {
                        "id": 11096,
                        "code": "621122",
                        "name": "陇西县"
                    },
                    {
                        "id": 11099,
                        "code": "621123",
                        "name": "渭源县"
                    },
                    {
                        "id": 11095,
                        "code": "621124",
                        "name": "临洮县"
                    },
                    {
                        "id": 11100,
                        "code": "621125",
                        "name": "漳县"
                    },
                    {
                        "id": 11097,
                        "code": "621126",
                        "name": "岷县"
                    }
                ]
            },
            {
                "id": 815,
                "code": "621200",
                "name": "陇南",
                "children": [
                    {
                        "id": 11142,
                        "code": "621202",
                        "name": "武都区"
                    },
                    {
                        "id": 11135,
                        "code": "621221",
                        "name": "成县"
                    },
                    {
                        "id": 11141,
                        "code": "621222",
                        "name": "文县"
                    },
                    {
                        "id": 11136,
                        "code": "621223",
                        "name": "宕昌县"
                    },
                    {
                        "id": 11138,
                        "code": "621224",
                        "name": "康县"
                    },
                    {
                        "id": 11143,
                        "code": "621225",
                        "name": "西和县"
                    },
                    {
                        "id": 11139,
                        "code": "621226",
                        "name": "礼县"
                    },
                    {
                        "id": 11137,
                        "code": "621227",
                        "name": "徽县"
                    },
                    {
                        "id": 11140,
                        "code": "621228",
                        "name": "两当县"
                    }
                ]
            },
            {
                "id": 814,
                "code": "622900",
                "name": "临夏",
                "children": [
                    {
                        "id": 11132,
                        "code": "622901",
                        "name": "临夏市"
                    },
                    {
                        "id": 11133,
                        "code": "622921",
                        "name": "临夏县"
                    },
                    {
                        "id": 11131,
                        "code": "622922",
                        "name": "康乐县"
                    },
                    {
                        "id": 11134,
                        "code": "622923",
                        "name": "永靖县"
                    },
                    {
                        "id": 11128,
                        "code": "622924",
                        "name": "广河县"
                    },
                    {
                        "id": 11129,
                        "code": "622925",
                        "name": "和政县"
                    },
                    {
                        "id": 11127,
                        "code": "622926",
                        "name": "东乡族自治县"
                    },
                    {
                        "id": 11130,
                        "code": "622927",
                        "name": "积石山保安族东乡族撒拉族自治县"
                    }
                ]
            },
            {
                "id": 809,
                "code": "623000",
                "name": "甘南",
                "children": [
                    {
                        "id": 11102,
                        "code": "623001",
                        "name": "合作市"
                    },
                    {
                        "id": 11103,
                        "code": "623021",
                        "name": "临潭县"
                    },
                    {
                        "id": 11108,
                        "code": "623022",
                        "name": "卓尼县"
                    },
                    {
                        "id": 11107,
                        "code": "623023",
                        "name": "舟曲县"
                    },
                    {
                        "id": 11101,
                        "code": "623024",
                        "name": "迭部县"
                    },
                    {
                        "id": 11105,
                        "code": "623025",
                        "name": "玛曲县"
                    },
                    {
                        "id": 11104,
                        "code": "623026",
                        "name": "碌曲县"
                    },
                    {
                        "id": 11106,
                        "code": "623027",
                        "name": "夏河县"
                    }
                ]
            }
        ]
    },
    {
        "id": 56,
        "code": "630000",
        "name": "青海",
        "children": [
            {
                "id": 1027,
                "code": "630100",
                "name": "西宁",
                "children": [
                    {
                        "id": 12695,
                        "code": "630102",
                        "name": "城东区"
                    },
                    {
                        "id": 13852,
                        "code": "630103",
                        "name": "城中区"
                    },
                    {
                        "id": 12696,
                        "code": "630104",
                        "name": "城西区"
                    },
                    {
                        "id": 12694,
                        "code": "630105",
                        "name": "城北区"
                    },
                    {
                        "id": 12699,
                        "code": "630106",
                        "name": "湟中县"
                    },
                    {
                        "id": 12697,
                        "code": "630121",
                        "name": "大通回族土族自治县"
                    },
                    {
                        "id": 12698,
                        "code": "630123",
                        "name": "湟源县"
                    }
                ]
            },
            {
                "id": 1023,
                "code": "630200",
                "name": "海东",
                "children": [
                    {
                        "id": 12674,
                        "code": "630202",
                        "name": "乐都县"
                    },
                    {
                        "id": 12676,
                        "code": "630203",
                        "name": "平安县"
                    },
                    {
                        "id": 12675,
                        "code": "630222",
                        "name": "民和回族土族自治县"
                    },
                    {
                        "id": 12672,
                        "code": "630223",
                        "name": "互助土族自治县"
                    },
                    {
                        "id": 12673,
                        "code": "630224",
                        "name": "化隆回族自治县"
                    },
                    {
                        "id": 12677,
                        "code": "630225",
                        "name": "循化撒拉族自治县"
                    }
                ]
            },
            {
                "id": 1022,
                "code": "632200",
                "name": "海北",
                "children": [
                    {
                        "id": 12670,
                        "code": "632221",
                        "name": "门源回族自治县"
                    },
                    {
                        "id": 12671,
                        "code": "632222",
                        "name": "祁连县"
                    },
                    {
                        "id": 12669,
                        "code": "632223",
                        "name": "海晏县"
                    },
                    {
                        "id": 12668,
                        "code": "632224",
                        "name": "刚察县"
                    }
                ]
            },
            {
                "id": 1026,
                "code": "632300",
                "name": "黄南",
                "children": [
                    {
                        "id": 12692,
                        "code": "632301",
                        "name": "同仁县"
                    },
                    {
                        "id": 12691,
                        "code": "632322",
                        "name": "尖扎县"
                    },
                    {
                        "id": 12693,
                        "code": "632323",
                        "name": "泽库县"
                    },
                    {
                        "id": 12690,
                        "code": "632324",
                        "name": "河南蒙古族自治县"
                    }
                ]
            },
            {
                "id": 1024,
                "code": "632500",
                "name": "海南",
                "children": [
                    {
                        "id": 12678,
                        "code": "632521",
                        "name": "共和县"
                    },
                    {
                        "id": 12681,
                        "code": "632522",
                        "name": "同德县"
                    },
                    {
                        "id": 12679,
                        "code": "632523",
                        "name": "贵德县"
                    },
                    {
                        "id": 12682,
                        "code": "632524",
                        "name": "兴海县"
                    },
                    {
                        "id": 12680,
                        "code": "632525",
                        "name": "贵南县"
                    }
                ]
            },
            {
                "id": 1021,
                "code": "632600",
                "name": "果洛",
                "children": [
                    {
                        "id": 12667,
                        "code": "632621",
                        "name": "玛沁县"
                    },
                    {
                        "id": 12662,
                        "code": "632622",
                        "name": "班玛县"
                    },
                    {
                        "id": 12664,
                        "code": "632623",
                        "name": "甘德县"
                    },
                    {
                        "id": 12663,
                        "code": "632624",
                        "name": "达日县"
                    },
                    {
                        "id": 12665,
                        "code": "632625",
                        "name": "久治县"
                    },
                    {
                        "id": 12666,
                        "code": "632626",
                        "name": "玛多县"
                    }
                ]
            },
            {
                "id": 1028,
                "code": "632700",
                "name": "玉树",
                "children": [
                    {
                        "id": 12703,
                        "code": "632701",
                        "name": "玉树县"
                    },
                    {
                        "id": 12704,
                        "code": "632722",
                        "name": "杂多县"
                    },
                    {
                        "id": 12700,
                        "code": "632723",
                        "name": "称多县"
                    },
                    {
                        "id": 12705,
                        "code": "632724",
                        "name": "治多县"
                    },
                    {
                        "id": 12701,
                        "code": "632725",
                        "name": "囊谦县"
                    },
                    {
                        "id": 12702,
                        "code": "632726",
                        "name": "曲麻莱县"
                    }
                ]
            },
            {
                "id": 1025,
                "code": "632800",
                "name": "海西",
                "children": [
                    {
                        "id": 12686,
                        "code": "632800",
                        "name": "海西蒙古族藏族自治州"
                    },
                    {
                        "id": 12685,
                        "code": "632801",
                        "name": "格尔木市"
                    },
                    {
                        "id": 12683,
                        "code": "632802",
                        "name": "德令哈市"
                    },
                    {
                        "id": 12687,
                        "code": "632803",
                        "name": "茫崖市"
                    },
                    {
                        "id": 12689,
                        "code": "632821",
                        "name": "乌兰县"
                    },
                    {
                        "id": 12684,
                        "code": "632822",
                        "name": "都兰县"
                    },
                    {
                        "id": 12688,
                        "code": "632823",
                        "name": "天峻县"
                    }
                ]
            }
        ]
    },
    {
        "id": 55,
        "code": "640000",
        "name": "宁夏",
        "children": [
            {
                "id": 1019,
                "code": "640100",
                "name": "银川",
                "children": [
                    {
                        "id": 12657,
                        "code": "640104",
                        "name": "兴庆区"
                    },
                    {
                        "id": 12656,
                        "code": "640105",
                        "name": "西夏区"
                    },
                    {
                        "id": 12654,
                        "code": "640106",
                        "name": "金凤区"
                    },
                    {
                        "id": 12658,
                        "code": "640121",
                        "name": "永宁县"
                    },
                    {
                        "id": 12653,
                        "code": "640122",
                        "name": "贺兰县"
                    },
                    {
                        "id": 12655,
                        "code": "640181",
                        "name": "灵武市"
                    }
                ]
            },
            {
                "id": 1017,
                "code": "640200",
                "name": "石嘴山",
                "children": [
                    {
                        "id": 12645,
                        "code": "640202",
                        "name": "大武口区"
                    },
                    {
                        "id": 12646,
                        "code": "640205",
                        "name": "惠农区"
                    },
                    {
                        "id": 12647,
                        "code": "640221",
                        "name": "平罗县"
                    }
                ]
            },
            {
                "id": 1018,
                "code": "640300",
                "name": "吴忠",
                "children": [
                    {
                        "id": 12649,
                        "code": "640302",
                        "name": "利通区"
                    },
                    {
                        "id": 12648,
                        "code": "640303",
                        "name": "红寺堡区"
                    },
                    {
                        "id": 12652,
                        "code": "640323",
                        "name": "盐池县"
                    },
                    {
                        "id": 12651,
                        "code": "640324",
                        "name": "同心县"
                    },
                    {
                        "id": 12650,
                        "code": "640381",
                        "name": "青铜峡市"
                    }
                ]
            },
            {
                "id": 1016,
                "code": "640400",
                "name": "固原",
                "children": [
                    {
                        "id": 12644,
                        "code": "640402",
                        "name": "原州区"
                    },
                    {
                        "id": 12643,
                        "code": "640422",
                        "name": "西吉县"
                    },
                    {
                        "id": 12641,
                        "code": "640423",
                        "name": "隆德县"
                    },
                    {
                        "id": 12640,
                        "code": "640424",
                        "name": "泾源县"
                    },
                    {
                        "id": 12642,
                        "code": "640425",
                        "name": "彭阳县"
                    }
                ]
            },
            {
                "id": 1020,
                "code": "640500",
                "name": "中卫",
                "children": [
                    {
                        "id": 12660,
                        "code": "640502",
                        "name": "沙坡头区"
                    },
                    {
                        "id": 12661,
                        "code": "640521",
                        "name": "中宁县"
                    },
                    {
                        "id": 12659,
                        "code": "640522",
                        "name": "海原县"
                    }
                ]
            }
        ]
    },
    {
        "id": 66,
        "code": "650000",
        "name": "新疆",
        "children": [
            {
                "id": 1138,
                "code": "650100",
                "name": "乌鲁木齐",
                "children": [
                    {
                        "id": 13602,
                        "code": "650102",
                        "name": "天山区"
                    },
                    {
                        "id": 13600,
                        "code": "650103",
                        "name": "沙依巴克区"
                    },
                    {
                        "id": 13886,
                        "code": "650104",
                        "name": "新市区"
                    },
                    {
                        "id": 13601,
                        "code": "650105",
                        "name": "水磨沟区"
                    },
                    {
                        "id": 13603,
                        "code": "650106",
                        "name": "头屯河区"
                    },
                    {
                        "id": 13598,
                        "code": "650107",
                        "name": "达坂城区"
                    },
                    {
                        "id": 13599,
                        "code": "650109",
                        "name": "米东区"
                    },
                    {
                        "id": 13604,
                        "code": "650121",
                        "name": "乌鲁木齐县"
                    }
                ]
            },
            {
                "id": 1129,
                "code": "650200",
                "name": "克拉玛依",
                "children": [
                    {
                        "id": 13576,
                        "code": "650202",
                        "name": "独山子区"
                    },
                    {
                        "id": 13577,
                        "code": "650203",
                        "name": "克拉玛依区"
                    },
                    {
                        "id": 13575,
                        "code": "650204",
                        "name": "白碱滩区"
                    },
                    {
                        "id": 13578,
                        "code": "650205",
                        "name": "乌尔禾区"
                    }
                ]
            },
            {
                "id": 1137,
                "code": "650400",
                "name": "吐鲁番",
                "children": [
                    {
                        "id": 13595,
                        "code": "650402",
                        "name": "高昌区"
                    },
                    {
                        "id": 13596,
                        "code": "650421",
                        "name": "鄯善县"
                    },
                    {
                        "id": 13597,
                        "code": "650422",
                        "name": "托克逊县"
                    }
                ]
            },
            {
                "id": 1124,
                "code": "650500",
                "name": "哈密",
                "children": [
                    {
                        "id": 13552,
                        "code": "650502",
                        "name": "伊州区"
                    },
                    {
                        "id": 13550,
                        "code": "650521",
                        "name": "巴里坤哈萨克自治县"
                    },
                    {
                        "id": 13551,
                        "code": "650522",
                        "name": "伊吾县"
                    }
                ]
            },
            {
                "id": 1123,
                "code": "652300",
                "name": "昌吉",
                "children": [
                    {
                        "id": 13543,
                        "code": "652301",
                        "name": "昌吉市"
                    },
                    {
                        "id": 13544,
                        "code": "652302",
                        "name": "阜康市"
                    },
                    {
                        "id": 13545,
                        "code": "652323",
                        "name": "呼图壁县"
                    },
                    {
                        "id": 13547,
                        "code": "652324",
                        "name": "玛纳斯县"
                    },
                    {
                        "id": 13549,
                        "code": "652325",
                        "name": "奇台县"
                    },
                    {
                        "id": 13546,
                        "code": "652327",
                        "name": "吉木萨尔县"
                    },
                    {
                        "id": 13548,
                        "code": "652328",
                        "name": "木垒哈萨克自治县"
                    }
                ]
            },
            {
                "id": 1122,
                "code": "652700",
                "name": "博尔塔拉",
                "children": [
                    {
                        "id": 13540,
                        "code": "652701",
                        "name": "博乐市"
                    },
                    {
                        "id": 13539,
                        "code": "652702",
                        "name": "阿拉山口市"
                    },
                    {
                        "id": 13541,
                        "code": "652722",
                        "name": "精河县"
                    },
                    {
                        "id": 13542,
                        "code": "652723",
                        "name": "温泉县"
                    }
                ]
            },
            {
                "id": 1120,
                "code": "652800",
                "name": "巴音郭楞",
                "children": [
                    {
                        "id": 13532,
                        "code": "652801",
                        "name": "库尔勒市"
                    },
                    {
                        "id": 13533,
                        "code": "652822",
                        "name": "轮台县"
                    },
                    {
                        "id": 13536,
                        "code": "652823",
                        "name": "尉犁县"
                    },
                    {
                        "id": 13535,
                        "code": "652824",
                        "name": "若羌县"
                    },
                    {
                        "id": 13534,
                        "code": "652825",
                        "name": "且末县"
                    },
                    {
                        "id": 13537,
                        "code": "652826",
                        "name": "焉耆回族自治县"
                    },
                    {
                        "id": 13530,
                        "code": "652827",
                        "name": "和静县"
                    },
                    {
                        "id": 13531,
                        "code": "652828",
                        "name": "和硕县"
                    },
                    {
                        "id": 13529,
                        "code": "652829",
                        "name": "博湖县"
                    }
                ]
            },
            {
                "id": 1117,
                "code": "652900",
                "name": "阿克苏",
                "children": [
                    {
                        "id": 13512,
                        "code": "652901",
                        "name": "阿克苏市"
                    },
                    {
                        "id": 13516,
                        "code": "652902",
                        "name": "库车县"
                    },
                    {
                        "id": 13518,
                        "code": "652922",
                        "name": "温宿县"
                    },
                    {
                        "id": 13517,
                        "code": "652924",
                        "name": "沙雅县"
                    },
                    {
                        "id": 13520,
                        "code": "652925",
                        "name": "新和县"
                    },
                    {
                        "id": 13514,
                        "code": "652926",
                        "name": "拜城县"
                    },
                    {
                        "id": 13519,
                        "code": "652927",
                        "name": "乌什县"
                    },
                    {
                        "id": 13513,
                        "code": "652928",
                        "name": "阿瓦提县"
                    },
                    {
                        "id": 13515,
                        "code": "652929",
                        "name": "柯坪县"
                    }
                ]
            },
            {
                "id": 1130,
                "code": "653000",
                "name": "克孜勒苏",
                "children": [
                    {
                        "id": 13581,
                        "code": "653001",
                        "name": "阿图什市"
                    },
                    {
                        "id": 13580,
                        "code": "653022",
                        "name": "阿克陶县"
                    },
                    {
                        "id": 13579,
                        "code": "653023",
                        "name": "阿合奇县"
                    },
                    {
                        "id": 13582,
                        "code": "653024",
                        "name": "乌恰县"
                    }
                ]
            },
            {
                "id": 1127,
                "code": "653100",
                "name": "喀什",
                "children": [
                    {
                        "id": 13564,
                        "code": "653101",
                        "name": "喀什市"
                    },
                    {
                        "id": 13567,
                        "code": "653121",
                        "name": "疏附县"
                    },
                    {
                        "id": 13568,
                        "code": "653122",
                        "name": "疏勒县"
                    },
                    {
                        "id": 13571,
                        "code": "653123",
                        "name": "英吉沙县"
                    },
                    {
                        "id": 13573,
                        "code": "653124",
                        "name": "泽普县"
                    },
                    {
                        "id": 13566,
                        "code": "653125",
                        "name": "莎车县"
                    },
                    {
                        "id": 13570,
                        "code": "653126",
                        "name": "叶城县"
                    },
                    {
                        "id": 13565,
                        "code": "653127",
                        "name": "麦盖提县"
                    },
                    {
                        "id": 13572,
                        "code": "653128",
                        "name": "岳普湖县"
                    },
                    {
                        "id": 13563,
                        "code": "653129",
                        "name": "伽师县"
                    },
                    {
                        "id": 13562,
                        "code": "653130",
                        "name": "巴楚县"
                    },
                    {
                        "id": 13569,
                        "code": "653131",
                        "name": "塔什库尔干县塔吉克自治"
                    }
                ]
            },
            {
                "id": 1125,
                "code": "653200",
                "name": "和田",
                "children": [
                    {
                        "id": 13554,
                        "code": "653201",
                        "name": "和田市"
                    },
                    {
                        "id": 13555,
                        "code": "653221",
                        "name": "和田县"
                    },
                    {
                        "id": 13558,
                        "code": "653222",
                        "name": "墨玉县"
                    },
                    {
                        "id": 13559,
                        "code": "653223",
                        "name": "皮山县"
                    },
                    {
                        "id": 13556,
                        "code": "653224",
                        "name": "洛浦县"
                    },
                    {
                        "id": 13553,
                        "code": "653225",
                        "name": "策勒县"
                    },
                    {
                        "id": 13560,
                        "code": "653226",
                        "name": "于田县"
                    },
                    {
                        "id": 13557,
                        "code": "653227",
                        "name": "民丰县"
                    }
                ]
            },
            {
                "id": 1140,
                "code": "654000",
                "name": "伊犁",
                "children": [
                    {
                        "id": 13614,
                        "code": "654002",
                        "name": "伊宁市"
                    },
                    {
                        "id": 13610,
                        "code": "654003",
                        "name": "奎屯市"
                    },
                    {
                        "id": 13609,
                        "code": "654004",
                        "name": "霍尔果斯市"
                    },
                    {
                        "id": 13615,
                        "code": "654021",
                        "name": "伊宁县"
                    },
                    {
                        "id": 13606,
                        "code": "654022",
                        "name": "察布查尔锡伯自治县"
                    },
                    {
                        "id": 13608,
                        "code": "654023",
                        "name": "霍城县"
                    },
                    {
                        "id": 13607,
                        "code": "654024",
                        "name": "巩留县"
                    },
                    {
                        "id": 13613,
                        "code": "654025",
                        "name": "新源县"
                    },
                    {
                        "id": 13616,
                        "code": "654026",
                        "name": "昭苏县"
                    },
                    {
                        "id": 13612,
                        "code": "654027",
                        "name": "特克斯县"
                    },
                    {
                        "id": 13611,
                        "code": "654028",
                        "name": "尼勒克县"
                    }
                ]
            },
            {
                "id": 1134,
                "code": "654200",
                "name": "塔城",
                "children": [
                    {
                        "id": 13589,
                        "code": "654201",
                        "name": "塔城市"
                    },
                    {
                        "id": 13591,
                        "code": "654202",
                        "name": "乌苏市"
                    },
                    {
                        "id": 13586,
                        "code": "654221",
                        "name": "额敏县"
                    },
                    {
                        "id": 13588,
                        "code": "654223",
                        "name": "沙湾县"
                    },
                    {
                        "id": 13590,
                        "code": "654224",
                        "name": "托里县"
                    },
                    {
                        "id": 13592,
                        "code": "654225",
                        "name": "裕民县"
                    },
                    {
                        "id": 13587,
                        "code": "654226",
                        "name": "和布克赛尔蒙古自治县"
                    }
                ]
            },
            {
                "id": 1119,
                "code": "654300",
                "name": "阿勒泰",
                "children": [
                    {
                        "id": 13522,
                        "code": "654301",
                        "name": "阿勒泰市"
                    },
                    {
                        "id": 13523,
                        "code": "654321",
                        "name": "布尔津县"
                    },
                    {
                        "id": 13525,
                        "code": "654322",
                        "name": "富蕴县"
                    },
                    {
                        "id": 13524,
                        "code": "654323",
                        "name": "福海县"
                    },
                    {
                        "id": 13526,
                        "code": "654324",
                        "name": "哈巴河县"
                    },
                    {
                        "id": 13528,
                        "code": "654325",
                        "name": "青河县"
                    },
                    {
                        "id": 13527,
                        "code": "654326",
                        "name": "吉木乃县"
                    }
                ]
            },
            {
                "id": 1132,
                "code": "659001",
                "name": "石河子",
                "children": [
                    {
                        "id": 13584,
                        "code": "659001",
                        "name": "石河子"
                    }
                ]
            },
            {
                "id": 1118,
                "code": "659002",
                "name": "阿拉尔",
                "children": [
                    {
                        "id": 13521,
                        "code": "659002",
                        "name": "阿拉尔"
                    }
                ]
            },
            {
                "id": 1136,
                "code": "659003",
                "name": "图木舒克",
                "children": [
                    {
                        "id": 13594,
                        "code": "659003",
                        "name": "图木舒克"
                    }
                ]
            },
            {
                "id": 1139,
                "code": "659004",
                "name": "五家渠",
                "children": [
                    {
                        "id": 13605,
                        "code": "659004",
                        "name": "五家渠"
                    }
                ]
            },
            {
                "id": 1121,
                "code": "659005",
                "name": "北屯市",
                "children": [
                    {
                        "id": 13538,
                        "code": "659005",
                        "name": "北屯市"
                    }
                ]
            },
            {
                "id": 1135,
                "code": "659006",
                "name": "铁门关市",
                "children": [
                    {
                        "id": 13593,
                        "code": "659006",
                        "name": "铁门关市"
                    }
                ]
            },
            {
                "id": 1133,
                "code": "659007",
                "name": "双河市",
                "children": [
                    {
                        "id": 13585,
                        "code": "659007",
                        "name": "双河市"
                    }
                ]
            },
            {
                "id": 1128,
                "code": "659008",
                "name": "可克达拉市",
                "children": [
                    {
                        "id": 13574,
                        "code": "659008",
                        "name": "可克达拉市"
                    }
                ]
            },
            {
                "id": 1131,
                "code": "659009",
                "name": "昆玉市",
                "children": [
                    {
                        "id": 13583,
                        "code": "659009",
                        "name": "昆玉市"
                    }
                ]
            },
            {
                "id": 1126,
                "code": "659010",
                "name": "胡杨河市",
                "children": [
                    {
                        "id": 13561,
                        "code": "659010",
                        "name": "胡杨河市"
                    }
                ]
            }
        ]
    }
]`
